Repository: alimon/oscada
Catalog: src/moduls/bd/PostgreSQL/po/*.po
Languages: de

source: BD module. Provides support of the BD PostgreSQL.
de: BD-Modul unterstützt die PostgreSQL Datenbank.

source: Fatal error - unable to allocate connection.
de: Fataler Fehler - es ist unmöglich die Verbindung herzustellen

source: Connect to DB error: %s
de: Fehler des Anschlusses an die DB: %s

source: Query to DB error: %s. %s
de: Fehler der Anfrage an die Datenbank: %s. %s

source: Error open table <%s>. DB is disabled.
de: Fehler der Öffnung der Tabelle <%s>. Datenbank ist abgeschaltet.

source: Start trasaction error!
de: Start trasaction Fehler!

source: Stop trasaction error!
de: Stop trasaction Fehler!

source: PostgreSQL DB address must be written as: [<host>;<hostaddr>;<user>;<pass>;<db>;<port>;<connect_timeout>]. Where: host - Name of the host (PostgreSQL server) to connect to. If this begins with a slash ('/'), it specifies Unix domain communication rather than TCP/IP communication; the value is the name of the directory in which the socket file is stored. hostaddr - Numeric IP address of host to connect to; user - DB user name; pass - user's password for DB access; db - DB name; port - DB server port (default 5432); connect_timeout - connection timeout For local DB: [;;roman;123456;OpenSCADA;5432;10]. For remote DB: [server.nm.org;192.168.2.1;roman;123456;OpenSCADA;5432;10].
de: Die Adresse der Datenbank MySQL wird geschrieben als: [<host>;<hostaddr>;<user>;<pass>;<db>;<port>;<connect_timeout>]. Wo: host - Hostname des PostgreSQL-Servers. Falls sie mit dem Slash beginnt ('/'), wird UNIX-Socket statt TCP gezeigt Wert - Name der Directory, wo die Socketdatei gespeichert wird. hostaddr - Zahlenadresse des Hosts des PostgreSQL-Servers ; user - Name des Datenbankbenutzers; pass - Kennwort des Nutzers für den Zugang zu der DB; db - Name der Datenbank; port - Port des Datenbank-Servers (default 3306); connect_timeout - Timeout der Verbindung; Für lokale Datenbank: [;;roman;123456;OpenSCADA;5432;10]. Für entfernte Datenbank: [server.nm.org;192.168.2.1;roman;123456;OpenSCADA;5432;10].

source: Table is not present!
de: Die Tabelle ist nicht vorhanden!

source: Table is empty!
de: Tabelle ist leer!

source: Row is not present!
de: Die Zeile ist nicht vorhanden!
