Repository: alimon/oscada
Catalog: src/moduls/ui/Vision/po/*.po
Languages: uk

source: Copy page '%1' to '%2'.
uk: Копіювання сторінки '%1' до '%2'.

source: Move widget '%1' to '%2'.
uk: Переміщення віджету '%1' до '%2'.

source: Copy widget '%1' to '%2'.
uk: Копіювання віджету '%1' до '%2'.

source: Enter new widget's identifier and name.
uk: Введіть ідентифікатор та ім'я нового віджета.

source: Copy/move scheme from '%1' to '%2' is not supported.
uk: Схема копіювання/переміщення з '%1' до '%2' не підтримується.

source: Inherit:
uk: Наслідувати:

source: Try copy/move self to self for "%1/%1"!
uk: Спроба копіювання/пересунення себе у себе для "%1/%1"!

source: Widget's library properties
uk: Властивості бібліотеки віджетів

source: Widgets library
uk: Бібліотека віджетів

source: State
uk: Стан

source: Item's icon. Click for download other.
uk: Іконка елементу. Натисніть для завантаження іншої.

source: Enabled:
uk: Ввімкнено:

source: Container DB:
uk: БД контейнера:

source: Date of modification:
uk: Дата модифікації:

source: Configuration
uk: Конфігурація

source: Name:
uk: Ім'я:

source: Description:
uk: Опис:

source: Owner, group:
uk: Власник, група:

source: Access:
uk: Доступ:

source: Calculate period (ms):
uk: Період обчислення (мс):

source: Run window mode:
uk: Режим вікна виконання:

source: Keep aspect ratio on scale:
uk: Зберігати пропорцію під час масштабування

source: Mime data
uk: Mime дані

source: Mime type
uk: Mime тип

source: Data size
uk: Розмір даних

source: Add record
uk: Додати запис

source: Delete record
uk: Видалити запис

source: Load data
uk: Завантажити дані

source: Unload data
uk: Вивантажити дані

source: Styles
uk: Стилі

source: Style:
uk: Стиль:

source: Erase style
uk: Видалити стиль

source: Value
uk: Значення

source: Close
uk: Закрити

source: Get node '%1' information error.
uk: Помилка запиту інформації вузла '%1'.

source: No set
uk: Не встановлено

source: Load icon picture
uk: Завантажити зображення іконки

source: Images (*.png *.jpg)
uk: Зображення (*.png *.jpg)

source: Load icon image '%1' error.
uk: Помилка завантаження зображення іконки '%1'.

source: Changes apply
uk: Збереження змін

source: Some changes you don't apply! Apply now or lost the?
uk: Деякі зміни було зроблено. Зберегти зміни у БД перед виходом?

source: No one row is selected.
uk: Жодної строки не вибрано.

source: All files (*.*)
uk: Всі файли (*.*)

source: Open file '%1' is fail: %2
uk: Помилка відкриття файлу '%1': %2

source: Loadable file '%1' is too large.
uk: Завантажуваний файл '%1' дуже великий.

source: Save data
uk: Збереження даних

source: Write data to file '%1' is fail: %2
uk: Помилка запису до файлу '%1': %2

source: Widget properties
uk: Властивості віджету

source: Widget
uk: Віджет

source: Parent widget:
uk: Батьківський віджет:

source: Page type:
uk: Тип сторінки:

source: Root:
uk: Корінь:

source: Path:
uk: Шлях:

source: Attributes
uk: Атрибути

source: Widget process
uk: Обробка віджету

source: Name
uk: Ім'я

source: Data type
uk: Тип даних

source: Work area
uk: Робоча ділянка

source: Proc.
uk: Оброб.

source: Configuration template
uk: Конфігураційний шаблон

source: Add attribute
uk: Додати атрибут

source: Delete attribute
uk: Видалити атрибут

source: Procedure language:
uk: Мова процедури:

source: Procedure calculate (ms):
uk: Обчислення процедури (мс):

source: Links
uk: Зв'язки

source: Getting node '%1' information error.
uk: Помилка запиту інформації вузла '%1'.

source: Valid widget is not selected
uk: Не вибрано коректного віджету

source: Valid attribute is not selected
uk: Не вибрано коректного атрибуту

source: <Group>
uk: <Група>

source: Attribute
uk: Атрибут

source: Copy
uk: Копіювати

source: Edit
uk: Редагувати

source: Clear changes
uk: Очистити зміни

source: Press to clear attribute's changes.
uk: Натиснути для очищення змін атрибуту.

source: Changes put down to the parent
uk: Опущення змін до предку

source: Press to put down attribute's changes to the parent.
uk: Натиснути для опущення змін атрибуту до предку.

source: Full text of the attribute edit.
uk: Повнотекстове редагування атрибуту.

source: Attribute '%1' edit for widget '%2'.
uk: Редагування атрибуту '%1' для віджета '%2'.

source: Short help for text syntax description.
uk: Коротка допомога для опису синтаксису текста.

source: Widgets
uk: Віджети

source: Type
uk: Тип

source: Widgets' development tree '%s' request time %f ms.
uk: Час запиту дерева розробки віджетів '%s': %f мс.

source: Library
uk: Бібліотека

source: Library: %1
uk: Бібліотека: %1

source: Add widget based at '%1'
uk: Додання віджету базованого на '%1'

source: The button for addition widget based at '%1'
uk: Кнопка для додання віджету базованого на '%1'

source: Press to add widget based at '%1'.
uk: Натиснути для додання віджету базованого на '%1'

source: Container's widget
uk: Віджет контейнера

source: Widgets' development tree '%s' load time %f ms.
uk: Час завантаження дерева розробки віджетів '%s': %f мс.

source: Refresh libraries
uk: Оновити бібліотеки

source: Press to refresh present libraries.
uk: Натиснути для оновлення наявних бібліотек.

source: Projects
uk: Проекти

source: Project
uk: Проект

source: Project's development tree '%s' load time %f ms.
uk: Час завантаження дерева розробки проектів '%s': %f мс.

source: Page
uk: Сторінка

source: Refresh projects
uk: Оновити проекти

source: Press to refresh present projects.
uk: Натиснути для оновлення наявних проектів.

source: Scale
uk: Масштаб

source: Resize
uk: Зміна розміру

source: Warning! Edit widget already set.
uk: Увага! Віджет вже встановлено у редагування.

source: Exit from widget editing
uk: Вихід з редагування віджету

source: Press to exit from widget editing.
uk: Натиснути для виходу з редагування віджету.

source: Enter for the widget editing
uk: Вхід до редагування віджету

source: Press to enter for the widget editing.
uk: Натиснути для входу до редагування віджету.

source: Make icon from the widget
uk: Створити іконку з віджета

source: Press to make icon from the widget.
uk: Натиснути для створення іконки з віджета.

source: Make image from the widget
uk: Створити зображення з віджету

source: Press to make image from the widget.
uk: Натиснути для створення зображення з віджету.

source: Zoom in (+10%)
uk: Збільшити (+10%)

source: Press to increase the visual scale of the widget by 10%.
uk: Натисніть, щоб збільшити візуальний масштаб віджету на 10%.

source: Zoom out (-10%)
uk: Зменшити (-10%)

source: Press to decrease the visual scale of the widget by 10%.
uk: Натисніть, щоб зменшити візуальний масштаб віджету на 10%.

source: Reset zoom (100%)
uk: Скинути масштаб (100%)

source: Press to set the visual scale of the widget to 100%.
uk: Натисніть, щоб встановитии візуальний масштаб віджету у 100%.

source: Save widget's image
uk: Збереження зображення віджету

source: Images (*.png *.xpm *.jpg)
uk: Зображення (*.png *.xpm *.jpg)

source: Save to file '%1' is error.
uk: Помилка збереження у файл '%1'.

source: Selected elements --- xy(%2:%3) wh[%4:%5]
uk: Вибрані елементи --- xy(%2:%3) шв[%4:%5]

source: Page: '%1' --- xy(%2:%3) wh[%4:%5]
uk: Сторінка: '%1' --- xy(%2:%3) шв[%4:%5]

source: ... more items (%d)
uk: ... більше пунктів (%d)

source: geometry
uk: геометрія

source: attribute '%s'
uk: атрибут '%s'

source: new widget '%s' from '%s'
uk: новий віджет '%s' від '%s'

source: remove widget
uk: видалення віджету

source: copy past widget '%s' from '%s'
uk: копіювання-вставка віджету '%s' з '%s'

source: unknown
uk: невідомо

source: Widget is not enabled or shape is not supported!
uk: Віджет вимкнено або образ віджету не підтримується!

source: Selected elements: '%1'
uk: Обрано елементи: '%1'

source: Cursor --- xy(%1:%2)
uk: Курсор --- xy(%1:%2)

source: Vision runtime
uk: Vision-виконання

source: &Print
uk: &Друк

source: Print the master page
uk: Друк головної сторінки

source: The button for printing of the master page by default
uk: Кнопка для друку головної сторінки, по замовченню

source: Press for printing of the master page by default.
uk: Натиснути для друку головної сторінки, по замовченню.

source: Print the selected page
uk: Друк вибраної сторінки

source: The button for printing of the selected page
uk: Кнопка для друку вибраної сторінки

source: Press for printing of the selected page.
uk: Натиснути для друку вибраної сторінки.

source: Diagram
uk: Діаграма

source: Print the selected diagram
uk: Друк вибраної діаграми

source: The button for printing of the selected diagram
uk: Кнопка для друку вибраної діаграми

source: Press for printing of the selected diagram.
uk: Натиснути для друку вибраної діаграми.

source: Document
uk: Документ

source: Print the selected document
uk: Друк вибраного документу

source: The button for printing of the selected document
uk: Кнопка для друку вибраного документу

source: Press for printing of the selected document.
uk: Натиснути для друку вибраного документу.

source: &Export
uk: &Експорт

source: Export the master page
uk: Експорт головної сторінки

source: The button for exporting of the master page by default
uk: Кнопка для експорт головної сторінки

source: Press for exporting of the master page by default.
uk: Натиснути для експорту головної сторінки.

source: Export the selected page
uk: Експорт вибраної сторінки

source: The button for exporting of the selected page
uk: Кнопка для експорту вибраної сторінки

source: Press for exporting of the selected page.
uk: Натиснути для експорту вибраної сторінки.

source: Export the selected diagram
uk: Експорт вибраної діаграми

source: The button for exporting of the selected diagram
uk: Кнопка для експорту вибраної діаграми

source: Press for exporting of the selected diagram.
uk: Натиснути для експорту вибраної діаграми.

source: Export the selected document
uk: Експорт вибраного документу

source: The button for exporting of the selected document
uk: Кнопка для експорту вибраного документу

source: Press for exporting of the selected document.
uk: Натиснути для експорту вибраного документу.

source: The button for closing Vision runtime window
uk: Кнопка для закриття вікна виконання Vision

source: Press to close of the current Vision runtime window.
uk: Натиснути для закриття поточного вікна виконання Vision.

source: Press for display the program and OpenSCADA information.
uk: Натиснути для отримання інформації про програму та OpenSCADA.

source: Alarm level
uk: Рівень порушення

source: The button for all alarms quittance
uk: Кнопка для квітації всіх порушень

source: Press for all alarms quittance.
uk: Натиснути для квітації всіх порушень.

source: Blink alarm
uk: Квітація миготіння

source: The button for all blink alarms quittance
uk: Кнопка для квітації всіх порушень миготінням

source: Press for all blink alarms quittance.
uk: Натиснути для квітації всіх порушень миготінням.

source: Speaker alarm
uk: Квітація гудком

source: PC speaker alarm
uk: Квітація гудком

source: The button for all PC speaker alarms quittance
uk: Кнопка для квітації всіх порушень гудком

source: Press for all PC speaker alarms quittance.
uk: Натиснути для квітації всіх порушень гудком.

source: Sound/speech alarm
uk: Квітація звука/мови

source: Sound or speech alarm
uk: Квітація звука/мови

source: The button for all sound or speech alarms quittance
uk: Кнопка для квітації всіх порушень звуком або мовою

source: Press for all sound or speech alarms quittance.
uk: Натиснути для квітації всіх порушень звуком або мовою.

source: &Alarm
uk: Порушення

source: Alarms (status)
uk: Порушення (статус)

source: This label displays current system's time.
uk: Це маркування показує поточний системний час.

source: Field for display of the current user.
uk: Поле для відображення поточного користувача.

source: This label displays used VCA engine station.
uk: Це маркування показує використану станцію рущія СВК

source: Field for display of the used VCA engine station.
uk: Поле для відображення використаної станції рущія СВК

source: This label displays used interface style.
uk: Це маркування показує використаний стиль інтерфейсу.

source: Field for display the used interface style.
uk: Поле для відображення використаного стилю інтерфейсу.

source: Double click for style change.
uk: Подвійно клацнути для зміни стилю.

source: Connection to visualization server '%1' error: %2
uk: Помилка підключення до сервера візуалізації '%1': %2

source: Root page scale [%f:%f].
uk: Масштаб кореневої сторінки [%f:%f].

source: Print page
uk: Друк сторінки

source: No one page for print is present!
uk: Немає жодної сторінки для друку!

source: Select page for print.
uk: Вибір сторінки для друку.

source: Page print.
uk: Друк сторінки.

source: Pages:
uk: Сторінки:

source: Print page: "%1" (%2)
uk: Друк сторінки: "%1" (%2)

source: OpenSCADA project: "%1"
uk: Проект OpenSCADA: "%1"

source: User: "%1"
uk: Користувач: "%1"

source: Print diagram
uk: Друк діаграми

source: No one page is present!
uk: Немає жодної сторінки!

source: No one diagram is present!
uk: Немає жодної діаграми!

source: Select diagram for print.
uk: Вибір діаграми для друку.

source: Diagram print.
uk: Друк діаграми.

source: Diagrams:
uk: Діаграми:

source: Print diagram: "%1" (%2)
uk: Друк діаграми: "%1" (%2)

source: OpenSCADA project: "%1" %2 (%3)
uk: Проект OpenSCADA: "%1" %2 (%3)

source: User: "%1" %2
uk: Користувач: "%1" %2

source: Print document
uk: Друк документа

source: No one document is present!
uk: Немає жодного документа!

source: Select document for print.
uk: Вибір документа для друку.

source: Document print.
uk: Друк документа.

source: Document:
uk: Документ:

source: Print document: "%1" (%2)
uk: Друк документа: "%1" (%2)

source: Export page
uk: Експорт сторінки

source: No one page for export is present!
uk: Немає жодної сторінки для експорту!

source: Select page for export.
uk: Вибір сторінки для експорту.

source: Page export.
uk: Експорт сторінки.

source: Save page's image
uk: Збереження зображення сторінки

source: Export diagram
uk: Експорт діаграми

source: Select diagram for export.
uk: Вибір діаграми для експорту.

source: Diagram export.
uk: Експорт діаграми.

source: Save diagram
uk: Збереження діаграми

source: Trend %1.png
uk: Тренд %1.png

source: Images (*.png *.xpm *.jpg);;CSV file (*.csv)
uk: Зображення (*.png *.xpm *.jpg);;CSV файл (*.csv)

source: "Date and time";"us"
uk: "Дата та час";"мкс"

source: "Frequency (Hz)"
uk: "Частота (Гц)"

source: Error write to: %1.
uk: Помилка запису до: %1.

source: Export document
uk: Експорт документа

source: Select document for export.
uk: Вибір документа для експорту.

source: Document export.
uk: Експорт документа.

source: Save document
uk: Збереження документа

source: Document %1.html
uk: Документ %1.html

source: XHTML (*.html);;CSV file (*.csv)
uk: XHTML (*.html);;CSV файл (*.csv)

source: No data for export.
uk: Немає даних для експорту.

source: Several sessions are already opened on the project "%1". You can create new or connect to present session. Please, select needed or press "Cancel".
uk: Вже відкрито декілька сеансів для проекту "%1". Ви можете створити новий сеанс або під'єднатися до існуючого. Будь ласка, оберіть потрібне або натисніть "Скасувати".

source: Select session for connection or new creation
uk: Вибір сеансу для підключення або створення нового

source: <Create new session>
uk: <Створити новий сеанс>

source: Running project: %1
uk: Виконання проекту: %1

source: Error open: %s
uk: Помилка відкриття: %s

source: Error write to: %s
uk: Помилка запису до: %s

source: Alarm level: %1
uk: Рівень порушення: %1

source: Session creation restore for '%s'.
uk: Відновлення створення сеансу для '%s'.

source: Session '%s' update time %f ms.
uk: Час оновлення сеансу '%s' %f мс.

source: Page: '%1'. View access is not permitted.
uk: Сторінка: '%1'. Відсутній доступ для перегляду.

source: No style
uk: Немає стилю

source: Select your style from list.
uk: Оберіть Ваш стиль з переліку.

source: Style select
uk: Вибір стилю

source: Elementary figure
uk: Елементарна фігура

source: Make this point dynamic
uk: Зробити цю точку динамічною

source: Press to make this point dynamic
uk: Натисніть, щоб зробити цю точку динамічною.

source: Make this point static
uk: Зробити цю точку статичною

source: Press to make this point static
uk: Натисніть, щоб зробити цю точку статичною.

source: Make line width dynamic
uk: Зробити ширину лінії динамічною

source: Press to make line width dynamic
uk: Натисніть, щоб зробити ширину лінії динамічною.

source: Make line width static
uk: Зробити ширину лінії статичною

source: Press to make line width static
uk: Натисніть, щоб зробити ширину лінії динамічною.

source: Make line color dynamic
uk: Зробити колір лінії динамічним

source: Press to make line color dynamic
uk: Натисніть, щоб зробити колір лінії динамічним.

source: Make line color static
uk: Зробити колір лінії статичним

source: Press to make line color static
uk: Натисніть, щоб зробити колір лінії статичним.

source: Make border width dynamic
uk: Зробити ширину границі динамічною

source: Press to make border width dynamic
uk: Натисніть, щоб зробити ширину границі динамічною.

source: Make border width static
uk: Зробити ширину границі статичною

source: Press to make border width static
uk: Натисніть, щоб зробити ширину границі статичною.

source: Make border color dynamic
uk: Зробити колір границі динамічним

source: Press to make border color dynamic
uk: Натисніть, щоб зробити колір границі динамічним.

source: Make border color static
uk: Зробити колір границі статичним

source: Press to make border color static
uk: Натисніть, щоб зробити колір границі статичним.

source: Make line style dynamic
uk: Зробити стиль лінії динамічним

source: Press to make line style dynamic
uk: Натисніть, щоб зробити стиль лінії динамічним.

source: Make line style static
uk: Зробити стиль лінії статичним

source: Press to make line style static
uk: Натисніть, щоб зробити стиль лінії статичним.

source: Show the figure's properties
uk: Показати властивості елементарної фігури

source: Press to show the properties dialog
uk: Натиснути для отримання властивостей елементарної фігури.

source: Delete the current fill
uk: Видалити заповнення

source: Press to delete the current fill
uk: Натиснути для видалення заповнення.

source: Make fill color dynamic
uk: Зробити колір заповнення динамічним

source: Press to make fill color dynamic
uk: Натисніть, щоб зробити колір заповнення динамічним.

source: Make fill color static
uk: Зробити колір заповнення статичним

source: Press to make fill color static
uk: Натисніть, щоб зробити колір заповнення статичним.

source: Make fill image dynamic
uk: Зробити зображення заповнення динамічним

source: Press to make fill image dynamic
uk: Натисніть, щоб зробити зображення заповнення динамічним.

source: Make fill image static
uk: Зробити зображення заповнення статичним

source: Press to make fill image static
uk: Натисніть, щоб зробити зображення заповнення статичним.

source: Show the fill's properties
uk: Показати властивості заповнення

source: Press to show the fill's properties dialog
uk: Натиснути для отримання властивостей заповнення.

source: Make all values of the widget the static ones
uk: Зробити усі величини віджета статичними

source: Press to make all values of the widget static ones
uk: Натисніть, щоб зробити усі величини віджета статичними.

source: Properties for the %1 figures.
uk: Властивості для фігур: %1.

source: Properties for the '%1' figure: '%2'.
uk: Властивості для '%1' фігури: '%2'.

source: Elementary figure properties.
uk: Властивості елементарних фігур.

source: Line:
uk: Лінія:

source: Border:
uk: Границя:

source: Points:
uk: Точки:

source: Point 3:
uk: Точка 3:

source: Point 4:
uk: Точка 4:

source: Point 5:
uk: Точка 5:

source: Include(checked)/Exclude(unchecked) the fill color from the properties list.
uk: Включити(вибраний)/Виключити(невибраний) колір заповнення зі списку властивостей.

source: Fill Color
uk: Колір заповнення

source: Set the default fill color.
uk: Встановити колір заповнення за замовчуванням.

source: Include(checked)/Exclude(unchecked) the fill image from the properties list.
uk: Включити(вибраний)/Виключити(невибраний) зображення заповнення зі списку властивостей.

source: Fill Image
uk: Зображення заповнення

source: Set the default fill image.
uk: Встановити зображення заповнення за замовчуванням.

source: Make the fill color Dynamic(checked)/Static(unchecked).
uk: Зробити колір заповнення Динамічним(вибрана)/Статичним(невибрана).

source: Dyn/Stat
uk: Дін/Стат

source: Make the fill image Dynamic(checked)/Static(unchecked).
uk: Зробити зображення заповнення Динамічним(вибрана)/Статичним(невибрана).

source: Include(checked)/Exclude(unchecked) the line width from the properties list.
uk: Включити(вибраний)/Виключити(невибраний) ширину лінії зі списку властивостей.

source: Line width
uk: Ширина лінії

source: Set the default line width.
uk: Встановити ширину лінії за замовчуванням.

source: Make the line width Dynamic(checked)/Static(unchecked).
uk: Зробити ширину лінії Динамічною(вибрана)/Статичною(невибрана).

source: Include(checked)/Exclude(unchecked) the line color from the properties list.
uk: Включити(вибраний)/Виключити(невибраний) колір лінії зі списку властивостей.

source: Line color
uk: Колір лінії

source: Set the default line color.
uk: Встановити колір лінії за замовчуванням.

source: Make the line color Dynamic(checked)/Static(unchecked).
uk: Зробити колір лінії Динамічним(вибрана)/Статичним(невибрана).

source: Include(checked)/Exclude(unchecked) the line style from the properties list.
uk: Включити(вибраний)/Виключити(невибраний) стиль лінії зі списку властивостей.

source: Line style
uk: Стиль лінії

source: Set the default line style.
uk: Встановити стиль лінії за замовчуванням.

source: Make the line style Dynamic(checked)/Static(unchecked).
uk: Зробити стиль лінії Динамічним(вибрана)/Статичним(невибрана).

source: Include(checked)/Exclude(unchecked) the border width from the properties list.
uk: Включити(вибраний)/Виключити(невибраний) ширину границі зі списку властивостей.

source: Border width
uk: Ширина границі

source: Set the default line's border width.
uk: Встановити ширину границі за замовчуванням.

source: Make the border width Dynamic(checked)/Static(unchecked).
uk: Зробити ширину границі Динамічною(вибрана)/Статичною(невибрана).

source: Include(checked)/Exclude(unchecked) the border color from the properties list.
uk: Включити(вибраний)/Виключити(невибраний) колір границі зі списку властивостей.

source: Border color
uk: Колір границі

source: Set the default line's border color.
uk: Встановити колір границі за замовчуванням.

source: Make the border color Dynamic(checked)/Static(unchecked).
uk: Зробити колір границі Динамічним(вибрана)/Статичним(невибрана).

source: Point 1:
uk: Точка 1:

source: Make the 1 point Dynamic(checked)/Static(unchecked).
uk: Зробити 1 точку Динамічною(вибрана)/Статичною(невибрана).

source: Point 2:
uk: Точка 2:

source: Make the 2 point Dynamic(checked)/Static(unchecked).
uk: Зробити 2 точку Динамічною(вибрана)/Статичною(невибрана).

source: Make the 3 point Dynamic(checked)/Static(unchecked).
uk: Зробити 3 точку Динамічною(вибрана)/Статичною(невибрана).

source: Make the 4 point Dynamic(checked)/Static(unchecked).
uk: Зробити 4 точку Динамічною(вибрана)/Статичною(невибрана).

source: Make the 5 point Dynamic(checked)/Static(unchecked).
uk: Зробити 5 точку Динамічною(вибрана)/Статичною(невибрана).

source: Solid
uk: Суцільна

source: Dashed
uk: Пунктир

source: Dotted
uk: Крапкова

source: Point coordinates(x,y): (%1, %2)
uk: Координати точки(x,y): (%1, %2)

source: Coordinates(x,y): (%1, %2)
uk: Координати(x,y): (%1, %2)

source: Widget's shape '%1' is not implemented yet!
uk: Образ віджету '%1' ще не реалізовано!

source: Save file
uk: Збереження файлу.
