Repository: alimon/oscada
Catalog: src/moduls/ui/Vision/po/*.po
Languages: uk

source: Operation user interface (Qt)
uk: Робочий інтерфейс користувача (Qt)

source: Roman Savochenko
uk: Роман Савоченко

source: Roman Savochenko, Lysenko Maxim, Yashina Kseniya
uk: Роман Савоченко, Лисенко Максим, Яшина Ксенія

source: Visual operation user interface.
uk: Робочий інтерфейс користувача.

source: Developers
uk: Розробники

source: ======================= The module <%s:%s> options ======================= ---------- Parameters of the module section '%s' in config-file ---------- StartUser <user> No password requested start user. UserPass <pass> User password for no local start. RunPrjs <list> Run projects list on the module start. RunPrjsSt {0;1} Display status for run projects (default = 1). ExitLstRunPrjCls {0;1}Exit on last run project close (default = 1). CachePgLife <hours> Cached pages lifetime. VCAstation <id> VCA station id ('.' - local). PlayCom <cmd> Audio alarms' files play command.
uk: ======================== Опції модуля <%s:%s> ============================ ------- Параметри модульної секції '%s' у конфігураційному файлі --------- StartUser <корист> Стартовий, безпарольний, користувач. UserPass <пароль> Пароль користувача для нелокального запуску. RunPrjs <перелік> Перелік проектів які мають запускатися при старті модуля. RunPrjsSt {0;1} Відображати статус для проектів що запускаються (по замовченню = 1). ExitLstRunPrjCls {0;1}Вихід при закритті останього проекту що виконується (по замовченню = 1). CachePgLife <години> Час життя сторінок у кешу. VCAstation <id> Станція з рушієм СВК ('.' - локальна). PlayCom <команда> Команда програвання аудіо-файлів сигналізації.

source: Load module.
uk: Завантаження модуля.

source: Save module.
uk: Збереження модуля.

source: Error connection to remote station!
uk: Помилка підключення до віддаленої станції!

source: Auth wrong!!!
uk: Помилка аутентифікації!!!

source: Start module.
uk: Старт модуля.

source: Stop module.
uk: Зупинка модуля.

source: Display number
uk: Кількість екранів

source: Module options
uk: Опції модуля

source: VCA engine station
uk: Станція рушія СВК

source: Start user
uk: Стартовий користувач

source: User password
uk: Пароль користувача

source: Cached pages lifetime
uk: Час життя сторінок у кеші

source: The time in hours for close pages from cache by inactive. For zero time pages will not closed.
uk: Час вказано у годинах, який визначає інтервал бездіяльності для закриття сторінок у кеші. Нульове значення часу виключає закриття сторінок у кеші.

source: Run projects list
uk: Перелік проектів для пуску

source: Automatic started project's list separated by symbol ';'. For opening a project's window to need display (1) use project's name format: 'PrjName-1'.
uk: Перелік автоматично виконуваних проектів, поділених символом ';'. Для відкриття вікна проекту на потрібному дисплеї (1) використовуйте формат ім'я проекту: 'PrjName-1'.

source: Run projects status display
uk: Відображення статусу проектів для пуску

source: Exit on last run project close
uk: Вихід при закритті останього проекту що виконується

source: Go to remote stations list configuration
uk: Перейти до конфігурації переліку віддалених станцій

source: Alarms
uk: Порушення

source: Play command
uk: Команда програвання

source: Command line for call sounds play. Use %f for source file name inserting. If source file is not used play sample is sent to pipe.
uk: Командний рядок для виклику програвання звуку. Використовуйте %f для вставлення імені файлу джерела. Якщо файл джерела не вказано то дані направляються до каналу.

source: OpenSCADA Vision developing: %s
uk: OpenSCADA Vision-розробка: %s

source: Full screen
uk: Весь екран

source: Full screen toggle
uk: Перемикач режиму "На весь екран"

source: The button for full screen toggle
uk: Кнопка для перемикання режиму "На весь екран"

source: Press for toggle full screen.
uk: Натиснути для перемикання режиму "На весь екран".

source: &Close
uk: &Закрити

source: Close Vision window
uk: Закриття вікна Vision

source: The button for closing Vision developing window
uk: Кнопка для закриття вікна розробки Vision

source: Press to close the current Vision developing window.
uk: Натиснути для закриття вікна розробки Vision.

source: &Quit
uk: &Вихід

source: Quit from OpenSCADA
uk: Вихід з OpenSCADA

source: The button for full quit from OpenSCADA
uk: Кнопка для повного виходу з OpenSCADA

source: Press for full quit from OpenSCADA system.
uk: Натиснути для повного виходу з OpenSCADA.

source: &About
uk: &Про

source: Program and OpenSCADA information
uk: Інформація про програму та OpenSCADA

source: The button for display the program and OpenSCADA information
uk: Кнопка для отримання інформації про програму та OpenSCADA

source: Press to display the program and OpenSCADA information.
uk: Натиснути для отримання інформації про програму та OpenSCADA.

source: About &Qt
uk: Про &Qt

source: Qt information
uk: Інформація про Qt

source: The button for getting the using QT information
uk: Кнопка для отримання інформації про QT

source: Press to get the using QT information.
uk: Натиснути для отримання інформації про QT.

source: %1 manual
uk: %1 підручник

source: The button for getting the using %1 manual
uk: Кнопка для отримання підручника %1

source: Press to get the using %1 manual.
uk: Натиснути для отримання підручника %1.

source: What's &This
uk: Що &це

source: The button for question about GUI elements
uk: Кнопка для запиту інформації про GUI елементи

source: Get respond about user interface elements
uk: Запит інформації про GUI елементи

source: Press to respond about user interface elements.
uk: Натиснути для запиту інформації про GUI елементи.

source: Load from DB
uk: Завантажити з БД

source: Load item data from DB
uk: Завантажити дані елементу з БД

source: The button for loading item data from DB
uk: Кнопка для завантаження даних елементу з БД

source: Press to load item data from DB.
uk: Натиснути для завантаження даних елементу з БД.

source: Save to DB
uk: Зберегти у БД

source: Save item data to DB
uk: Зберегти дані елементу у БД

source: The button for saving item data to DB
uk: Кнопка для збереження даних елементу у БД

source: Press to save item data to DB.
uk: Натиснути для збереження даних елементу у БД.

source: Run project execution
uk: Запуск виконання проекту

source: Run project execution for selected item
uk: Запуск виконання проекту, для вибраного елемента

source: The button for running project execution for selected item
uk: Кнопка для запуску виконання проекту, для вибраного елемента

source: Press to run project execution for selected item.
uk: Натиснути для запуску виконання проекту, для вибраного елемента.

source: New project
uk: Новий проект

source: New project create
uk: Створення нового проекту

source: The button for creation of the new project
uk: Кнопка для створення нового проекту

source: Press to create the new project.
uk: Натиснути для створення нового проекту.

source: New library
uk: Нова бібліотека

source: New widgets library creation
uk: Створення нової бібліотеки

source: The button for creation of the new widgets library
uk: Кнопка для створення нової бібліотеки

source: Press to create the new widgets library.
uk: Натиснути для створення нової бібліотеки.

source: Add visual item
uk: Додати візуальний елемент

source: Add visual item into library, container widget, project or page
uk: Додавання візуальних елементів до бібліотеки, контейнерного віджету, проекту або сторінки

source: The button for addition of the visual item into library, container widget, project or page
uk: Кнопка для додавання візуальних елементів до бібліотеки, контейнерного віджету, проекту або сторінки

source: Press to add visual item into library, container widget, project or page.
uk: Натиснути для додавання візуальних елементів до бібліотеки, контейнерного віджету, проекту або сторінки.

source: Delete visual item
uk: Видалити візуальний елемент

source: Delete visual item from library, container widget, project or page
uk: Видалення візуального елементу з бібліотеки, контейнерного віджета, проекту або сторінки

source: The button for deleting visual item from library, container widget, project or page
uk: Кнопка для видалення візуального елементу з бібліотеки, контейнерного віджета, проекту або сторінки

source: Press to delete visual item from library, container widget, project or page.
uk: Натиснути для видалення візуального елементу з бібліотеки, контейнерного віджета, проекту або сторінки.

source: Visual item properties
uk: Властивості візуального елементу

source: Get visual item properties
uk: Отримання властивостей візуального елементу

source: The button for getting the visual item properties
uk: Кнопка для отримання властивостей візуального елементу

source: Press to get the visual item properties.
uk: Натиснути для отримання властивостей візуального елементу.

source: Visual item edit
uk: Редагувати візуальний елемент

source: Goes visual item edit
uk: Перехід до редагування візуального елементу

source: The button for going to visual item edition
uk: Кнопка для переходу до редагування візуального елементу

source: Press to go to visual item edition.
uk: Натиснути для переходу до редагування візуального елементу.

source: Visual item changes clear
uk: Очистити зміни візуального елементу

source: Goes visual item changes clear
uk: Перехід до очищення змін візуального елементу

source: The button for going to visual item changes clear
uk: Кнопка для переходу до очищення змін візуального елементу

source: Press to go to visual item changes clear.
uk: Натиснути для переходу до очищення змін візуального елементу.

source: Visual item changes put down
uk: Опустити зміни візуального елементу

source: Goes visual item changes put down to the parent
uk: Перехід до опущення змін візуального елементу до предку

source: The button for going to visual item changes put down to the parent
uk: Кнопка для переходу до опущення змін візуального елементу до предку

source: Press to go to visual item changes put down to the parent.
uk: Натиснути для переходу до опущення змін візуального елементу до предку.

source: Visual item changes UnDo
uk: Відмінити зміни візуального елементу

source: Make visual item changes UnDo:
uk: Виконання відміни змін візуального елементу:

source: The button for making visual item changes UnDo
uk: Кнопка для виконання відміни змін візуального елементу

source: Press to make visual item changes UnDo.
uk: Натиснути для виконання відміни змін візуального елементу.

source: Visual item changes ReDo
uk: Повторити зміни візуального елементу

source: Make visual item changes ReDo:
uk: Виконати повтор змін візуального елементу:

source: The button for making visual item changes ReDo
uk: Кнопка для виконання повтору змін візуального елементу

source: Press to make visual item changes ReDo.
uk: Натиснути для виконання повтору змін візуального елементу.

source: Visual item cut
uk: Вирізати візуальний елемент

source: Make visual item cut
uk: Виконати вирізання візуального елементу

source: The button for making visual item cut
uk: Кнопка для виконання вирізання візуального елементу

source: Press to make visual item cut.
uk: Натиснути для виконання вирізання візуального елементу.

source: Visual item copy
uk: Копіювати візуальний елемент

source: Make visual item copy
uk: Виконання копіювання візуального елементу

source: The button for making visual item copy
uk: Кнопка для виконання копіювання візуального елементу

source: Press to make visual item copy.
uk: Натиснути для виконання копіювання візуального елементу.

source: Visual item paste
uk: Вставити візуальний елемент

source: Make visual item paste
uk: Виконати вставку візуального елементу

source: The button for making visual item paste
uk: Кнопка для виконання вставки візуального елементу

source: Press to make visual item paste.
uk: Натиснути для виконання вставки візуального елементу.

source: Up widget
uk: Підняти віджет

source: Raise selected widget to the top
uk: Підняти вибраний віджет догори

source: The button for raising the selected widget to the top
uk: Кнопка для підняття вибраного віджету догори

source: Press to raise the selected widget to the top.
uk: Натиснути для підняття вибраного віджету догори.

source: Down widget
uk: Опустити віджет

source: Down selected widget to the bottom
uk: Опустити вибраний віджет донизу

source: The button for downing the selected widget to the bottom
uk: Кнопка для опускання вибраного віджету донизу

source: Press to down the selected widget to the bottom.
uk: Натиснути для опускання вибраного віджету донизу.

source: Rise widget
uk: Віджет догори

source: Raise selected widget
uk: Підняття вибраного віджета

source: The button for raising the selected widget
uk: Кнопка для підняття вибраного віджета

source: Press to raise the selected widget.
uk: Натиснути для підняття вибраного віджета.

source: Lower widget
uk: Віджет донизу

source: Down selected widget
uk: Опускання вибраного віджета

source: The button for downing the selected widget
uk: Кнопка для опускання вибраного віджета

source: Press to down the selected widget.
uk: Натиснути для опускання вибраного віджета.

source: Align to left
uk: Вирівняти ліворуч

source: Align selected widgets to the left
uk: Вирівнювання вибраних віджетів зліва

source: The button for alignment of selected widgets to the left
uk: Кнопка для вирівнювання вибраних віджетів зліва

source: Press to align selected widgets to the left.
uk: Натиснути для вирівнювання вибраних віджетів зліва.

source: Align to vertical center
uk: Вирівняти у центрі вертикально

source: Align selected widgets to the vertical center
uk: Вирівнювання вибраних віджетів у центрі вертикально

source: The button for alignment of selected widgets to the vertical center
uk: Кнопка для вирівнювання вибраних віджетів у центрі вертикально

source: Press to align selected widgets to the vertical center.
uk: Натиснути для вирівнювання вибраних віджетів у центрі вертикально.

source: Align to right
uk: Вирівняти праворуч

source: Align selected widgets to the right
uk: Вирівнювання вибраних віджетів праворуч

source: The button for alignment of selected widgets to the right
uk: Кнопка для вирівнювання вибраних віджетів праворуч

source: Press to align selected widgets to the right.
uk: Натиснути для вирівнювання вибраних віджетів праворуч.

source: Align to top
uk: Вирівняти догори

source: Align selected widgets to the top
uk: Вирівнювання вибраних віджетів догори

source: The button for alignment of selected widgets to the top
uk: Кнопка для вирівнювання вибраних віджетів догори

source: Press to align selected widgets to the top.
uk: Натиснути для вирівнювання вибраних віджетів догори.

source: Align to horizontal center
uk: Вирівняти у центрі горизонтально

source: Align selected widgets to the horizontal center
uk: Вирівнювання вибраних віджетів у центрі горизонтально

source: The button for alignment selected widgets to the horizontal center
uk: Кнопка для вирівнювання вибраних віджетів у центрі горизонтально

source: Press to align selected widgets to the horizontal center.
uk: Натиснути для вирівнювання вибраних віджетів у центрі горизонтально.

source: Align to bottom
uk: Вирівняти додолу

source: Align selected widgets to the bottom
uk: Вирівнювання вибраних віджетів додолу

source: The button for alignment selected widgets to the bottom
uk: Кнопка для вирівнювання вибраних віджетів додолу

source: Press to align selected widgets to the bottom.
uk: Натиснути для вирівнювання вибраних віджетів додолу.

source: Cursor
uk: Курсор

source: Unset cursor
uk: Повернення курсору

source: The button for unset cursor
uk: Кнопка для повернення курсору

source: Press to unset cursor
uk: Кнопка для повернення курсору

source: Add line
uk: Додати лінію

source: Add line to elementary figure
uk: Додання лінії до елементарної фігури

source: The button for adding line to elementary figure
uk: Кнопка для додання лінії до елементарної фігури

source: Press to add line to elementary figure.
uk: Натиснути для додання лінії до елементарної фігури.

source: Add arc
uk: Додати дугу

source: Add arc to elementary figure
uk: Додання дуги до елементарної фігури

source: The button for adding arc to elementary figure
uk: Кнопка для додання дуги до елементарної фігури

source: Press to add arc to elementary figure.
uk: Натиснути для додання дуги до елементарної фігури.

source: Add Besier curve
uk: Додати криву Безьє

source: Add Besier curve to elementary figure
uk: Додання кривої Безьє до елементарної фігури

source: The button for adding Besier curve to elementary figure
uk: Кнопка для додання кривої Безьє до елементарної фігури

source: Press to add Besier curve to elementary figure.
uk: Натиснути для додання кривої Безьє до елементарної фігури.

source: Connections
uk: Під'єднатися

source: Enable connections
uk: Включення прив'язок

source: The button for enabling connections
uk: Кнопка для включення прив'язок

source: Press to enable connections
uk: Включення прив'язок

source: Cl&ose
uk: &Закрити

source: Close active window
uk: Закриття активного вікна

source: The button for the active window closing
uk: Кнопка для закриття активного вікна

source: Press to close active window.
uk: Натиснути для закриття активного вікна.

source: Close &All
uk: Закрити &все

source: Close all windows
uk: Закриття всіх вікон

source: The button for all windows closing
uk: Кнопка для закриття всіх вікон

source: Press to close all windows.
uk: Натиснути для закриття всіх вікон.

source: &Tile
uk: &Укласти

source: Tile all windows
uk: Укладення всіх вікон

source: The button for all windows tiling
uk: Кнопка для укладення всіх вікон

source: Press to tile all windows.
uk: Натиснути для укладення всіх вікон.

source: &Cascade
uk: &Каскадувати

source: Cascade all windows
uk: Каскадування всіх вікон

source: The button for all windows cascading
uk: Кнопка для каскадування всіх вікон

source: Press to cascade all windows.
uk: Натиснути для каскадування всіх вікон.

source: Ne&xt
uk: &Наступний

source: Activate next window
uk: Активувати наступне вікно

source: The button for next window activation
uk: Кнопка для активування наступного вікна

source: Press to activate next window.
uk: Натиснути для активування наступного вікна.

source: Pre&vious
uk: &Минулий

source: Activate previous window
uk: Активувати минуле вікно

source: The button for previous window activation
uk: Кнопка для активування минулого вікна

source: Press to activate previous window.
uk: Натиснути для активування минулого вікна.

source: &File
uk: &Файл

source: &Edit
uk: &Редагування

source: &Project
uk: &Проект

source: &Widget
uk: &Віджет

source: &View
uk: В&ид

source: &Window
uk: Вікн&о

source: &Help
uk: &Допомога

source: Visual items toolbar
uk: Панель візуальних елементів

source: Widgets view functions
uk: Функції видимості віджетів

source: Elementars figure tools
uk: Панель елементарних фігур

source: This label displays current user.
uk: Це маркування показує поточного користувача.

source: Field for display the current user.
uk: Поле для відображення поточного користувача.

source: Double click to change user.
uk: Подвійно клацнути для зміни користувача.

source: This label displays the using VCA engine station.
uk: Це маркування показує використану станцію рушія СВК

source: Field for display of the using VCA engine station.
uk: Поле для відображення використаної станції рушія СВК

source: This label displays widgets' scaling mode.
uk: Це маркування показує поточний режим масштабування.

source: Field for display widgets' scaling mode.
uk: Поле для відображення поточного режиму масштабування.

source: Click to change widgets' scaling mode.
uk: Натиснути для зміни режиму масштабування віджетів.

source: This label displays modifying.
uk: Це маркування показує факт внесення змін.

source: Field for display modifying.
uk: Поле для відображення факту внесення змін.

source: Click to save all modifyings.
uk: Натиснути для збереження всіх змін.

source: This label displays current widget's scale.
uk: Це маркування показує поточний режим масштабування.

source: Field for display the scale of the current widget.
uk: Поле для відображення поточного користувача.

source: Dock window for projects management.
uk: Плаваюче вікно для керування проектами

source: Dock window for widgets and their libraries management.
uk: Плаваюче вікно для керування віджетами та їх бібліотеками.

source: Dock window for widget's attributes inspection.
uk: Плаваюче вікно для інспектора атрибутів віджета.

source: Dock window for widget's links inspection.
uk: Плаваюче вікно для інспектора посилань віджета.

source: Ready
uk: Готовий

source: Icons size
uk: Розмір іконок

source: Small (16x16)
uk: Малі (16x16)

source: Medium (22x22)
uk: Середні (22x22)

source: Big (32x32)
uk: Великі (32x32)

source: Huge (48x48)
uk: Дуже великі (48x48)

source: Visual items save
uk: Збереження візуальних елементів

source: Some visual items changed. Save the changes to DB on exit?
uk: Деякі візуальні елементи було змінено. Зберегти зміни у БД при виході?

source: %1 v%2. %3 Author: %4 Developers: %5 License: %6 %7 v%8. %9 License: %10 Author: %11 Web site: %12
uk: %1 v%2. %3 Автор: %4 Розробники: %5 Ліцензія: %6 %7 v%8. %9 Ліцензія: %10 Автор: %11 Web сайт: %12

source: Manual
uk: Підручник

source: No the manual '%1' found offline or online!
uk: Не знайдено підручника '%1' локально та віддалено!

source: Are you sure of loading visual items '%1' from DB?
uk: Ви дійсно бажаєте завантажити візуальні елементи '%1' з БД?

source: Load visual item's data from DB
uk: Завантаження даних візуального елементу з БД

source: Are you sure of saving all modifications to DB?
uk: Ви дійсно бажаєте зберегти всі зміни у БД?

source: Are you sure of saving visual items '%1' to DB?
uk: Ви дійсно бажаєте зберегти візуальні елементи '%1' у БД?

source: Save visual item's data to DB
uk: Збереження даних візуальних елементів у БД

source: Enter new project's identifier and name.
uk: Введіть ідентифікатор та ім'я нового проекта.

source: Enter new widget's library identifier and name.
uk: Введіть ідентифікатор та ім'я нової бібліотеки віджетів.

source: New widget's library
uk: Нова бібліотека віджетів

source: Enter new widget's/page's identifier and name.
uk: Введіть ідентифікатор та ім'я нового віджета/сторінки.

source: Create widget/page
uk: Створити віджет/сторінку

source: Are you sure of deleting visual items: '%1'?
uk: Ви дійсно бажаєте видалити візуальні елементи '%1'?

source: Delete visual items
uk: Видалення візуальних елементів

source: Widget: %1
uk: Віджет: %1

source: Widget's '%1' editing window is already opened.
uk: Вікно редагування віджету '%1' вже відкрито.

source: Are you sure of clear all changes for visual items: '%1'? All changes will be lost and variables are returning to default values or will be inherited!
uk: Ви дійсно бажаєте очищення всіх змін візуальних елементів: '%1'? Всі зміни буде втрачено та значення повернуться до попереднього стану або будуть успадковані!

source: Visual items' changes clear
uk: Очищення змін візуальних елементів

source: Are you sure for put down to parent all changes for visual items: '%1'? All other inherited from the parent visual items will use the changes!
uk: Ви дійсно бажаєте опустити предку всі зміни візуальних елементів: '%1'? Всі інші візуальні елементи, нашадки від даного предку, будуть використовувати ці зміни!

source: Visual items move or copy
uk: Копіювання або переміщення візуальних елементів

source: Project '%1' move.
uk: Переміщення проекту '%1'.

source: Project '%1' copy.
uk: Копіювання проекту '%1'.

source: Widget's library '%1' move.
uk: Переміщення бібліотеки віджетів '%1'.

source: Widget's library '%1' copy.
uk: Копіювання бібліотеки віджетів '%1'.

source: Move page '%1' to '%2'.
uk: Переміщення сторінки '%1' до '%2'.
