Repository: alimon/oscada
Catalog: src/moduls/ui/Vision/po/*.po
Languages: uk

source: Load file
uk: Завантаження файлу.

source: Write file '%1' is fail.
uk: Помилка запису до файлу '%1'.

source: kHz
uk: кГц

source: Hz
uk: Гц

source: %ds
uk: %dс

source: %gs
uk: %gс

source: %gms
uk: %gмс

source: Trend build: %f ms.
uk: Час формування тренду: %f мс.

source: Trend draw: %f ms.
uk: Час відображення тренду: %f мс.

source: Date and time
uk: Дата та час

source: mcsec
uk: мкс

source: Level
uk: Рівень

source: Category
uk: Категорія

source: Message
uk: Повідомлення

source: Document parsing error: %s
uk: Помилка розбору документу: %s

source: Loading page: '%1'.
uk: Завантаження сторінки: '%1'.

source: Ok
uk: Прийняти

source: Cancel
uk: Скасувати

source: Select user
uk: Вибір користувача

source: User:
uk: Користувач:

source: Password:
uk: Пароль:

source: Font select
uk: Вибір шрифту

source: Font:
uk: Шрифт:

source: Size:
uk: Розмір:

source: Bold
uk: Підсилений

source: Italic
uk: Нахилений

source: Strikeout
uk: Перекреслений

source: Underline
uk: Підкреслений

source: Sample:
uk: Зразок:

source: AaBbCcDdEeFf
uk: АаБбВвГгДдЕе

source: Find
uk: Пошук

source: Find next
uk: Пошук наступного

source: Cursor = (%1:%2)
uk: Курсор = (%1:%2)

source: Enter text string for search:
uk: Введіть строку тексту для пошуку:

source: String search
uk: Рядок пошуку

source: Backward
uk: Зворотній

source: Case sensitively
uk: Чутливий до регістру

source: Whole words
uk: Слово цілком

source: Request to VCA engine '%s' time %f ms.
uk: Час запиту до рушія СВК '%s' %f мс.

source: Load '%s' time %f ms.
uk: Час завантаження '%s' %f мс.

source: Init '%s' time %f ms.
uk: Час ініціалізації '%s' %f мс.

source: Vision dialog
uk: Vision діалог
