Repository: alimon/oscada
Catalog: src/moduls/arhiv/DBArch/po/*.po
Languages: de, ru, uk

source: Archiver on the DB
de: Archiver auf der DB

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: The archiver module. Provides functions for messages and values archiving to the DB.
de: Das Archivierungsmodul. Funktionen zum Archivieren von Nachrichten und Werten in die Datenbank.

source: Check value archivator '%s' error.
de: Überprüfen Sie Wert Archivator '%s' Fehler.

source: In minutes
de: In Minuten

source: Time, seconds
de: Zeit, Sekunden

source: Time, microseconds
de: Zeit, Mikrosekunden

source: Category
de: Kategorie
ru: Категория
uk: Категорія

source: Message
de: Nachricht
ru: Сообщение
uk: Повідомлення

source: Level
de: Stufe
ru: Уровень
uk: Рівень

source: Enable target DB error: %s
de: Aktivieren Sie Ziel-DB-Fehler: %s
ru: Ошибка включения целевой БД: %s
uk: Помилка ввімкнення цільової БД: %s

source: Archive is not started!
de: Archiv ist nicht gestartet!
ru: Архив не запущен!
uk: Архів не запущено!

source: Archiving time (msek)
de: Archivierungszeit (msek)
ru: Время архивирования (мс)
uk: Час архівування (мс)

source: Additional options
de: Zusätzliche Optionen
ru: Дополнительные опции
uk: Додаткові опції

source: Archive size (days)
de: Grösse des Archivs (Tage)
ru: Размер архива (дней)
uk: Розмір архіву (днів)

source: Set to 0 for the limit disable and some performance rise.
de: Wird auf 0 gesetzt für die Grenze zu deaktivieren und einige Performance-Anstieg.
ru: Установить в 0 для отключения данного лимита и некоторого повышения производительности.
uk: Встановити у 0 для вимкнення обмеження та деякого підвищення продуктивності.

source: Force time as string
de: Force-Zeit als String
ru: Формировать время как строка
uk: Формувати час як рядок

source: Only for DBs it supports by a specific data type like to "datetime" into MySQL.
de: Nur für DBs unterstützt sie durch einen bestimmten Datentyp wie "Datetime" in MySQL.
ru: Только для БД поддерживающих такое посредством специфических типов данных вроде "datetime" в MySQL.
uk: Тільки для БД які підтримують таке за посередництвом специфічних типів даних на кшталт "datetime" у MySQL.

source: Mark, time/(10*per)
de: Kennzeichen, time/(10*per)

source: Set to 0 for the limit disable and some performance rise
de: Wird auf 0 gesetzt für die Grenze zu deaktivieren und einige Performance-Anstieg
ru: Установить в 0 для отключения данного лимита и некоторого повышения производительности
uk: Встановити у 0 для вимкнення обмеження та деякого підвищення продуктивності

source: Grouping parameters limit
de: Gruppierung Parameter Limit

source: Enable grouping arhivator's parameters into a single table. Set to '0' for one table per parameter.
de: Aktivieren arhivator Parameter in einer einzigen Tabelle zu gruppieren. Auf '0' für eine Tabelle pro Parameter.

source: Value
de: Wert
ru: Значение
uk: Значення

source: To DB archivator
ru: Архиватор на БД
uk: Архіватор до БД

source: The archiver module. Provides functions for messages and values archiving to DB.
ru: Модуль архиватора. Предоставляет функции архивирования сообщений и значений на БД.
uk: Модуль архіватору. Надає функції архівації повідомлень та значень на БД.

source: Time (s)
ru: Время (с)
uk: Час (с)

source: Time (us)
ru: Время (мкс)
uk: Час (мкс)

source: Archive size (hours)
ru: Размер архива (часов)
uk: Розмір архіву (годин)
