Repository: alimon/oscada
Catalog: src/moduls/transport/Sockets/po/*.po
Languages: de

source: Roman Savochenko, Maxim Kochetkov
de: Roman Savotschenko, Maxim Kochetkov

source: Provides sockets based transport. Support inet and unix sockets. Inet socket uses TCP, UDP and RAWCAN protocols.
de: Gewährt den auf Sockets gebauten Transport. Internet und UNIX Sockets werden unterstützt. Internet Socket benutzt die TCP, UDP und RAWCAN Protokolle.

source: Addition parameters
de: Weitere Optionen

source: Connections %d, opened %d, last %s. Traffic in %s, out %s. Closed connections by limit %d.
de: Verbindungen %d, eröffnet %d, letzte %s. Eingangstraffik %s, Ausgangs %s. Verbindungen geschlossen nach dem Limit %d.

source: Processing time %s[%s].
de: Bearbeitungszeit %s[%s].

source: Create %s socket error: '%s (%d)'!
de: Erstellen %s socket Fehler: '%s (%d)'!

source: Socket type '%s' error!
de: Fehler des Typs '%s' des Sockets!

source: Host '%s' not found!
de: Host '%s' wurde nicht gefunden!

source: The requested name '%s' does not have an IP address!
de: Der angeforderte Name '%s' hat keine IP-Adresse!

source: A non-recoverable name server error occurred while for '%s'!
de: Ein nicht behebbarer Name-Server-Fehler ist aufgetreten, während für '%s'!

source: A temporary error occurred on an authoritative name server for '%s'!
de: Ein temporärer Fehler aufgetreten auf einem autoritativen Nameserver für '%s'!

source: Unknown error code from gethostbyname_r for '%s'!
de: Unbekannter Fehlercode aus gethostbyname_r für '%s'!

source: Connect to %s socket error: '%s (%d)'!
de: Eine Verbindung mit %s Socket Fehler: '%s (%d)'!

source: Bind to %s socket error: '%s (%d)'!
de: Binden %s Socket Fehler: '%s (%d)'!

source: RAWCAN socket binded '%s'!
de: RAWCAN Socket ist verbunden mit '%s'!

source: Started
de: Gestartet

source: Stopped
de: Gestoppt

source: Restart by no input activity to '%s'.
de: Neustart durch keine Eingabeaktivität auf '%s'.

source: Write: wrote %s.
de: Schreiben: schrieb %s.

source: Write: reply for zero bytes.
de: Schreiben: Antwort für Null-Bytes.

source: Write: error '%s (%d)'!
de: Schreiben: Fehler '%s (%d)'!

source: %d:Transmitted directly to '%s'
de: %d:Direkt zu '%s' übertragen

source: Close input transport by error: '%s (%d)'
de: Close-Eingang Transport durch Fehler: '%s (%d)'

source: Error creation of the thread!
de: Fehler der Schaffung des Stroms!

source: Read datagram %s from '%s'!
de: Lesen Datagramm %s aus '%s'!

source: Wrote datagram %s to '%s'!
de: Schrieb Datagramm %s auf '%s'!

source: Received CAN frame id:%08X; dlc:%d; data:%02X%02X%02X%02X%02X%02X%02X%02X!
de: Empfangenen CAN-Rahmen id:%08X; dlc:%d; data:%02X%02X%02X%02X%02X%02X%02X%02X!

source: stopping client tasks ...
de: Client-Aufgaben stoppen ...

source: Has been connected by '%s'!
de: Verbunden von '%s'!

source: Has been terminated by error: '%s (%d)'
de: Von Fehler beendet: '%s (%d)'

source: Read message %s from '%s'.
de: Nachricht lesen %s aus '%s'.

source: %d:Received from '%s'
de: %d:Empfangen von '%s'

source: Wrote message %s to '%s'.
de: Schrieb Nachricht %s auf '%s'.

source: Transmitting error: %s
de: Übertragungsfehler: %s

source: %d:Transmitted to '%s'
de: %d:Übertragen in '%s'

source: Has been disconnected by '%s'!
de: Abgebunden vom '%s'!

source: Has been terminated by execution: %s
de: Ausführung beendet wurde: %s

source: %d:Has been terminated by execution: %s
de: %d:Ausführung beendet wurde: %s

source: New input protocol's object '%s' created!
de: Neue Eingangsprotokoll-Objekt '%s' erstellt!

source: Input protocol's object '%s' closed by self!
de: Die Eingangsprotokoll-Objekt '%s' durch Selbst geschlossen!

source: Error request to protocol.
de: Fehler der Anfrage ans Protokoll.

source: A new client %d from '%s' connected
de: Ein neuer Kunde %d aus '%s' verbunden

source: Client %d from '%s' disconnected
de: Client %d aus '%s' getrennt

source: State
de: Staats

source: Active connections
de: Aktive Verbindungen

source: Socket's input transport has address format: TCP:{addr}:{port}:{mode} - TCP socket: addr - address for socket to be opened, empty address opens socket for all interfaces; port - network port (/etc/services); mode - work mode (0 - break connection; 1 - keep alive; 2 - initiative connection). UDP:{addr}:{port} - UDP socket: addr - address for socket to be opened, empty address opens socket for all interfaces; port - network port (/etc/services). RAWCAN:{if}:{mask}:{id} - CAN socket: if - interface name; mask - CAN frame id mask; id - CAN id. UNIX:{name}:{mode} - UNIX socket: name - UNIX-socket's file name; mode - work mode (0 - break connection; 1 - keep alive; 2 - initiative connection).
de: Eingangstransport Socket hat das Format der Adresse: TCP:{addr}:{port}:{mode} - TCP Socket: addr - die Adresse der Eröffnung des Sockets, leere Adresse eröffnet den Socket in allen Interfaces; port - Netzwerk Port (/etc/services); mode - Arbeitsregime (0 - die Verbindung brechen; 1 - speichern die Verbidung; 2 - Initiative Verbindung). UDP:{addr}:{port} - UDP Socket: addr - die Adresse der Eröffnung des Sockets, leere Adresse eröffnet den Socket in allen Interfaces; port - Netzwerk Port (/etc/services). RAWCAN:{if}:{mask}:{id} - CAN socket: if - Schnittstellennamen; mask - CAN-ID Maskenrahmen; id - CAN id. UNIX:{name}:{mode} - UNIX Socket: name - Name der Datei des UNIX-Sockets; mode - Arbeitsregime (0 - die Verbindung brechen; 1 - die Verbindung speichern; 2 - Initiative Verbindung).

source: Empty value for the protocol selection switchs the transport to mode of creation associated output transports for each connection to one.
de: Leer Wert für die Protokollauswahl switchs den Transport nach Art der Schaffung zugehörige Ausgangstransporte für jede Verbindung zu einem.

source: Input buffer (kbyte)
de: Eingangsbuffer (kbyte)

source: Priority
de: Priorität

source: Maximum segment size (MSS)
de: Maximale Segmentgröße (MSS)

source: Set 0 for system MSS.
de: Stellen Sie 0 für System MSS.

source: Queue length
de: Reihenlänge

source: Clients maximum
de: Kunden Maximum

source: Clients maximum, per host
de: Kunden Maximum, pro Host

source: Set to zero for disable that limit.
de: Wird auf null gesetzt für Behinderte, die zu begrenzen.

source: Keep alive requests
de: Keep alive Anfragen

source: Close the connection after specified requests. Zero value for disable (not close ever).
de: Schließen Sie die Verbindung nach bestimmten Anfragen. Null-Wert für disable (nicht immer schließen).

source: Keep alive timeout, seconds
de: Keep alive Timeout, Sekunden

source: Close the connection after no requests at specified timeout. Zero value for disable (not close ever).
de: Schließen Sie die Verbindung nach keine Anfragen zu bestimmten Timeout. Null-Wert für disable (nicht immer schließen).

source: %s %d(%s): last %s; traffic in %s, out %s; client detachings %g;
de: %s %d(%s): letzte %s; eingangstraffik %s, Ausgangs- %s; Client-Ablösungen %g;

source: processing time %s[%s];
de: Bearbeitungszeit %s[%s];

source: Traffic in %s, out %s.
de: Eingangstraffik %s, Ausgangs- %s.

source: Respond time %s[%s].
de: Reaktionszeit %s[%s].

source: Type socket '%s' error!
de: Fehler im Typ '%s' des Sockets!

source: Error force socket %d using: '%s (%d)'!
de: Fehler Kraftsockel %d mit: '%s (%d)'!

source: Error creation TCP socket: '%s (%d)'!
de: Fehler der Schaffung des TCP Sockets: '%s (%d)'!

source: Error creation UDP socket: '%s (%d)'!
de: Fehler der Schaffung des UDP Sockets: '%s (%d)'!

source: Error connecting during the time %s: '%s (%d)'
de: Fehler beim Verbinden während der Zeit %s: '%s (%d)'

source: Error connection to the internet socket '%s:%s' during the timeout, it seems in down or inaccessible: '%s (%d)'!
de: Fehler beim Verbinden mit dem Internet-Socket '%s:%s' während des Timeouts, es scheint nicht aktiv oder erreichbar zu sein: '%s (%d)'!

source: Error creation UNIX socket: '%s (%d)'!
de: Fehler der Schaffung des UNIX Sockets: '%s (%d)'!

source: Connect to UNIX error: '%s (%d)'!
de: Fehler der Verbindung mit dem UNIX Socket: '%s (%d)'!

source: Error create '%s' socket!
de: Fehler der Schaffung des Sockets '%s'!

source: RAWCAN socket doesn't bind to '%s'!
de: RAWCAN Socket ist nicht verbunden mit '%s'!

source: Unknown error
de: Unbekannter Fehler

source: Transport is not started!
de: Transport ist nicht gestartet!

source: Request error: %s
de: Request-Fehler: %s

source: No data wrote
de: Keine Daten geschrieben

source: Write error: %s
de: Fehler beim Schreiben: %s

source: Transmitted to
de: Übertragen an

source: Wrote %s.
de: Schrieb %s.

source: Read timeouted.
de: Lesen timeouted.

source: Receiving timeouted
de: Empfangen zeitgesteuert

source: Read (select) error: %s
de: Lesefehler (select): %s

source: Receiving (select) error: %s
de: Empfangen (select) Fehler: %s

source: No data
de: Keine Daten

source: Read error: %s
de: Lesefehler: %s

source: Receiving error: %s
de: Empfangsfehler: %s

source: Read %s.
de: Lesen Sie %s.

source: Received from
de: Empfangen von

source: Socket's output transport has address format: TCP:{addr}:{port} - TCP socket: addr - address for remote socket to be opened; port - network port (/etc/services); UDP:{addr}:{port} - UDP socket: addr - address for remote socket to be opened; port - network port (/etc/services). RAWCAN:{if}:{mask}:{id} - CAN socket: if - interface name; mask - CAN frame id mask; id - CAN id. UNIX:{name} - UNIX socket: name - UNIX-socket's file name.
de: Ausgangstransport Socket hat das Format der Adresse: TCP:{addr}:{port} - TCP Socket: addr - die Adresse für die Eröffnung des entfernten Sockets; port - das Netzwerk Port (/etc/services); UDP:{addr}:{port} - UDP Socket: addr - die Adresse für die Eröffnung des entfernten Sockets ; port - das Netzwerk Port (/etc/services); RAWCAN:{if}:{mask}:{id} - CAN socket: if - Schnittstellennamen; mask - CAN-ID Maskenrahmen; id - CAN id. UNIX:{name} - UNIX Socket: name - Name der Datei des UNIX-Sockets.

source: Timings
de: Zeitabstände

source: Connection timings in format: "conn:next[:rep]". Where: conn - maximum time for connection respond wait, in seconds; next - maximum time for continue respond wait, in seconds; rep - minimum repeate timeout, in seconds.
de: Zeitabschnitte der Verbindung im Format: "conn:next[:rep]". Wo: conn - Maximale Zeit der Erwartung der Antwort der Verbindung, in Sekunden; next - Maximale Zeit der Erwartung der Fortsetzung der Antwort, in Sekunden; rep - Minimum repeate Timeout, in Sekunden.
