Repository: alimon/oscada
Catalog: src/moduls/daq/JavaLikeCalc/po/*.po
Languages: ru, uk

source: Variable '%s' is used but undefined
ru: Переменная '%s' не определена но использована
uk: Змінна '%s' не визначена але використана

source: Array have more 255 items.
ru: Массив имеет более 255 элементов.
uk: Масив має більш 255 елементів.

source: RegExp require one or two parameters.
ru: RegExp требует одного или двух параметров.
uk: RegExp вимагає одного або двох параметрів.

source: Don't support operation code %d.
ru: Не поддерживаемый код операции %d.
uk: Код виконання %d не підтримується.

source: More than %d(%d) parameters are specified for function '%s'
ru: Указанно более %d(%d) параметров для функции '%s'
uk: Вказано більш %d(%d) параметрів для функції '%s'

source: Function is requested '%s', but it doesn't have return of IO
ru: Вызвана функция '%s', но она не имеет IO возврата
uk: Викликано функцію '%s', але вона не має IO-повернення

source: No object variable for function
ru: Нет объектной переменной для функции
uk: Не об'єктна змінна для функції

source: Object's function have more 255 parameters.
ru: Функция объекта имеет более 255 параметров.
uk: Функція об'єкту містить більш 255 параметрів.

source: Get object from no object's register
ru: Получение объекта из не объектного регистра
uk: Отримання об'єкту з не об'єктного регістру

source: Function execution terminated by error
ru: Выполнение функции прервано ошибкой
uk: Виконання функції перервано помилкою

source: Timeouted function calculation %d > %d+%d
ru: Исчерпано время вычисления функции %d > %d+%d
uk: Перевищено час обчислення функції %d > %d+%d

source: Not supported type for operation 'Add'.
ru: Не поддерживаемый тип для операции 'Add'.
uk: Тип, який не підтримується операцією 'Add'.

source: Call object's function for no object or function name is empty.
ru: Вызов функции объекта для не объекта или имя функции пусто.
uk: Виклик об'єктної функції без об'єкту або ім'я функції порожнє.

source: Operation %c(%xh) error. Function '%s' is stopped.
ru: Ошибка операции %c(%xh). Функция '%s' остановлена.
uk: Помилка операції %c(%xh). Функція '%s' зупинена.

source: Function:
ru: Функция:
uk: Функція:

source: Date of modification
ru: Дата модификации
uk: Дата модифікації

source: Name
ru: Имя
uk: Ім'я

source: Description
ru: Описание
uk: Опис

source: Maximum calculate time (sec)
ru: Максимальное время вычисления (сек)
uk: Максимальний час обрахунку (сек)

source: Program
ru: Программа
uk: Програма

source: Type
ru: Тип
uk: Тип

source: Real;Integer;Boolean;String;Text;Object
ru: Веществ.;Целый;Логич.;Строка;Текст;Объект
uk: Реальний;Цілий;Логічний;Рядок;Текст;Об'єкт

source: Mode
ru: Режим
uk: Режим

source: Input;Output;Return
ru: Вход;Выход;Возврат
uk: Вхід;Вихід;Повернення

source: Hide
ru: Скрытый
uk: Прихов.

source: Default
ru: Умолч.
uk: Замовч.

source: New IO
ru: Новый IO
uk: Нове IO

source: Empty value is not valid.
ru: Пустое значение не допустимо.
uk: Порожнє значення не припустиме.

source: Function's library:
ru: Библиотека функций:
uk: Бібліотека функцій:

source: Function
ru: Функция
uk: Функція

source: Library
ru: Библиотека
uk: Бібліотека

source: State
ru: Состояние
uk: Стан

source: Accessing
ru: Доступен
uk: Доступно

source: Library DB
ru: БД библиотеки
uk: БД бібліотеки

source: Configuration
ru: Конфигурация
uk: Конфігурація

source: Program's text translation
ru: Перевод текста программы
uk: Переклад тексту програми

source: Functions
ru: Функции
uk: Функції

source: Java-like based calculator
ru: Вычислитель на java подобном языке
uk: Обчислювач на мові схожій на Java

source: Roman Savochenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Allow java-like based calculator and function's libraries engine. User can create and modify function and libraries.
ru: Предоставляет основанные на java подобном языке вычислитель и движок библиотек. Пользователь может создавать и модифицировать функции и библиотеки.
uk: Надає базований на мові схожій на Java обчислювач та рушій бібліотек функцій. Користувач може створювати та модифікувати функції та бібліотеки.

source: Parameters table
ru: Таблица параметров
uk: Таблиця параметрів

source: Controller's function
ru: Функция контроллера
uk: Функція контролера

source: Calculation schedule
ru: Планирование вычисления
uk: Планування обчислення

source: Calculation task priority
ru: Приоритет задачи вычисления
uk: Пріоритет задачі обчислення

source: Iteration number in single calculation
ru: Количество итераций в одном вычислении
uk: Кількість ітерацій у одному обчисленні

source: IO value
ru: Значение IO
uk: Значення IO

source: Standard
ru: Стандартный
uk: Стандартний

source: Data fields
ru: Поля данных
uk: Поля даних

source: Data base
ru: База данных
uk: База даних

source: Formula
ru: Формула
uk: Формула

source: Function ID
ru: ID функции
uk: ID функції

source: Default value
ru: Знач. по умолч.
uk: Знач. по замовч.

source: Position
ru: Позиция
uk: Позиція

source: Compilation with the help of the program language %s is not supported.
ru: Компиляция на языке программирования %s не поддерживается.
uk: Компіляція на мові програмування %s не підтримується.

source: Compile error: %s
ru: Ошибка компиляции: %s
uk: Помилка компіляції: %s

source: Load function's libraries error.
ru: Ошибка загрузки библиотеки функций.
uk: Помилка завантаження бібліотеки функцій.

source: Safe timeout (sec)
ru: Таймаут безопасности (сек)
uk: Таймаут безпеки (сек)

source: Functions' Libraries
ru: Библиотеки функций
uk: Бібліотеки функцій

source: Libraries
ru: Библиотеки
uk: Бібліотеки

source: Call now.
ru: Вызов сейчас.
uk: Виклик зараз.

source: Call by period: %s.
ru: Вызовы с периодом: %s.
uk: Виклик за періодом: %s.

source: Call next by cron '%s'.
ru: Следующий вызов по cron '%s'.
uk: Наступний виклик за cron '%s'.

source: Spent time: %s.
ru: Затрачено времени: %s.
uk: Витрачено часу: %s.

source: Functions library '%s' is not present. Please, create functions library!
ru: Библиотека функций '%s' отсутствует. Пожалуйста, создайте библиотеку функций!
uk: Бібліотека функції '%s' відсутня. Будь ласка, створіть бібліотеку функцій!

source: Create new function '%s'.
ru: Создание новой функции '%s'.
uk: Створення нової функції '%s'.

source: Load function and its IO error.
ru: Ошибка загрузки функции и её IO.
uk: Помилка завантаження функції та її IO.

source: Function calculate frequency (Hz)
ru: Частота вычисления функции (Гц)
uk: Частота обчислення функції (Гц)

source: Function start flag
ru: Флаг запуска функции
uk: Прапорець запуску функції

source: Function stop flag
ru: Флаг останова функции
uk: Прапорець зупинки функції

source: This controller object link
ru: Связь на объект этого контроллера
uk: Зв'язок на об'єкт цього контролера.

source: Calculation controller's function error.
ru: Ошибка вычисления функции контроллера
uk: Помилка обчислення функції контролеру.

source: No started or no present function.
ru: Функция отсутствует или не запущена.
uk: Функція відсутня або не запущена.

source: Calculation
ru: Вычисления
uk: Обчислення

source: Data
ru: Данные
uk: Дані

source: Attribute mode
ru: Режим атрибута
uk: Режим атрибуту

source: Read only;Read and Write;Read and Write
ru: Только чтение;Чтение и запись;Чтение и запись
uk: Тільки читання;Читання та запис;Читання та запис

source: Value
ru: Значение
uk: Значення

source: Deleting lock attribute in not allow.
ru: Недопустимо удаление заблокированного атрибута.
uk: Видалення заблокованого атрибуту не дозволене.

source: Changing locked attribute is not allowed.
ru: Недопустимо изменение заблокированного атрибута.
uk: Зміна заблокованого атрибуту не дозволена.

source: 2:Controller is stopped
ru: 2:Контроллер остановлен!
uk: 2:Контролер зупинено!

source: 1:Parameter is disabled
ru: 1:Параметр отключен
uk: 1:Параметр вимкнено

source: Attributes configuration list. List must be written by lines in format: [<io>:<aid>:<anm>] Where: io - calculation function's IO; aid - created attribute identifier; anm - created attribute name. If 'aid' or 'anm' are not set they will be generated from selected function's IO.
ru: Список конфигурации атрибутов. Список должен быть записан строками в формате: [<io>:<aid>:<anm>] Где: io - IO вычисляемой функции; aid - идентификатор создаваемого атрибута; anm - имя создаваемого атрибута. Если 'aid' или 'anm' не установлены то они будут генерироваться из выбранного IO функции.
uk: Перелік конфігурації атрибутів. Перелік має бути записаний строками у форматі: [<io>:<aid>:<anm>] Де: io - IO обчислюваної функції; aid - ідентифікатор створюваного атрибута; anm - ім'я створюваного атрибута. Якщо 'aid' або 'anm' не встановлено тоді вони будуть згенеровані з обраного IO функції.

source: Error constant after constant
ru: Ошибка постоянной после постоянной
uk: Помилка константи після константи

source: %s, pos: (%d,%d)-(%d,%d).
ru: %s, позиция: (%d,%d)-(%d,%d).
uk: %s, позиція: (%d,%d)-(%d,%d).

source: Unexpected end program, expect end string symbol '"',
ru: Неожиданное окончание программы, ожидается символ окончания строки '"',
uk: Неочікуване завершення програми, очікувався символ кінця строки '"',

source: The next line symbol failed into string,
ru: Символ перевода линии недопустим в строке,
uk: Символ переведення лінії не дозволено у рядку,

source: Using namespace is error or empty,
ru: Ошибка использования области имён или она пуста,
uk: Помилка площини найменувань або вона порожня,

source: Build in function has too much parameters,
ru: Встроенная функция имеет слишком много параметров,
uk: Вбудована функція має дуже багато параметрів,

source: Function error,
ru: Ошибка функции,
uk: Помилка функції,

source: Symbol error,
ru: Ошибка символа,
uk: Помилка символу,

source: Object's properties too long,
ru: Свойства объекта очень длинные,
uk: Властивості об'єкту дуже довгі,
