Repository: alimon/oscada
Catalog: src/moduls/transport/Serial/po/*.po
Languages: de

source: Serial interfaces
de: Serielle Schnittstellen

source: Roman Savochenko
de: Roman Savotschenko

source: Allow serial based interfaces. Used for data exchanging through serial interfaces like RS232, RS485, GSM and other.
de: Ermöglicht die Verwendung der Seriellen Schnittstellen für den Datenaustausch mit RS232, RS485, GSM und anderen.

source: Addition parameters
de: Zusätzliche Parameter

source: Write line error.
de: Fehler der Einschreibung der Zeile.

source: Read from serial error.
de: Fehler des Lesens des seriellen Interfaces

source: Traffic in %s, out %s. Maximum char timeout %.4g ms.
de: Datenverkehr eingehend %s, ausgehend %s. Maximale Wartezeit für ein Zeichen %.4g msek.

source: Serial port '%s' open error: %s.
de: Fehler beim Öffnen der Seriellen Schnittstelle '%s': %s.

source: Speed '%s' error.
de: Speed '%s' Fehler.

source: Asynchronous data format '%s' error.
de: Formatfehler der asynchronen Daten '%s'.

source: Char length '%d' error.
de: Fehler in der Länge des Zeichen '%d'.

source: Parity checking mode '%c' error.
de: Fehler '%c' in der Parität.

source: Stop bits '%d' error.
de: Fehler in der Anzahl der Stopbits '%d'.

source: No response to initial request '%s'.
de: Keine Antwort auf die Initialisierungsanfrage '%s'.

source: Serial received message '%d'.
de: Die Serielle Schnittstelle hat eine Nachricht empfangen '%d'.

source: Error request to protocol.
de: Fehler in der Protokollanfrage.

source: Serial replied message '%d'.
de: Die Serielle Schnittstelle hat die Nachricht bestätigt '%d'.

source: Serial transport has address format: "dev:speed:format:[fc]:[mdm]". Where: dev - serial device address (/dev/ttyS0); speed - device speed (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200, 230400, 460800, 500000, 576000 or 921600); format - asynchronous data format '<size><parity><stop>' (8N1, 7E1, 5O2); fc - flow control: 'h' - hardware (CRTSCTS); 's' - software (IXON|IXOFF); 'rts' - use RTS signal for transfer(false) and check for echo, for pure RS-485. mdm - modem mode, listen for 'RING'.
de: Serielle Übertragung hat die Parameter im Format: "dev:speed:format:[fc]:[mdm]". Wo: dev - Adresse der seriellen Gerät (/dev/ttyS0); speed - Speed-Geräte (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200, 230400, 460800, 500000, 576000 oder 921600); format - Format der asynchronen Daten '<Grösse><Parität><Stop>' (8N1, 7E1, 5O2). fc - Stromregierung: 'h' - Hardware (CRTSCTS); 's' - Software (IXON|IXOFF); 'rts' - Nutzung des RTS-Signals für die Übertragung (false) und überprüfen Sie auf ein Echo auf das rohe RS-485. mdm - modem Regime, warten auf den 'RING'.

source: Timings
de: Zeitabstände

source: Connection timings in format: "symbol:frm". Where: symbol - one symbol maximum time, used for frame end detection, in ms; frm - maximum frame length, in ms.
de: Wartezeit der Verbindung im Format: "symbol:frm". Wo: symbol - maximale Wartezeit für ein Zeichens, wird für die Erkennung des Rahmenendes verwendet, in msek; frm - maximale Rahmenlänge, in msek.

source: Timeout (sec)
de: Wartezeit (sec)

source: Pre-initial delay (sec)
de: Pre-erste Ausdauer (sek)

source: Post-initial delay (sec)
de: Aufhalten der Post-erste (sek)

source: Initialization string 1
de: Initialisierungszeile 1

source: Initialization string 2
de: Initialisierungszeile 2

source: Initial response
de: Initialisierung, Ergebnis

source: Ring request
de: Anfrage des Anrufs.

source: Ring answer
de: Ring Antwort

source: Ring answer response
de: Ring Antwort, Ergebnis

source: Traffic in %s, out %s.
de: Datenverkehr eingehend %s, ausgehend %s.

source: Device '%s' is used now.
de: Device '%s' wird nun verwendet.

source: Modem busy
de: Modem ist beschäftigt

source: Modem no carrier
de: Modem, keine Tragende

source: Modem no dial tone
de: Modem, kein Signal

source: Modem no connected
de: Modem nicht verbunden

source: Transport is not started!
de: Übertragung ist nicht gestartet!

source: Writing request error.
de: Fehler beim Senden der Anfrage.

source: Timeouted!
de: Zeit ist aus!

source: Echo request reading error.
de: Fehler beim Lesen der Echo-Request.

source: Serial error!
de: Serielle Fehler

source: Serial transport has address format: "dev:speed:format:[fc]:[modTel]". Where: dev - serial device address (/dev/ttyS0); speed - device speed (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200, 230400, 460800, 500000, 576000 or 921600 ); format - asynchronous data format '<size><parity><stop>' (8N1, 7E1, 5O2); fc - flow control: 'h' - hardware (CRTSCTS); 's' - software (IXON|IXOFF); 'rts' - use RTS signal for transfer(false) and check for echo, for pure RS-485. modTel - modem telephone, the field presence do switch transport to work with modem mode.
de: Serielle Übertragung hat die Parameter im Format: "dev:speed:format:[fc]:[modTel]". Wo: dev - Adresse der seriellen Gerät (/dev/ttyS0); speed - Speed-Geräte (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200, 230400, 460800, 500000, 576000 oder 921600 ); format - Format der asynchronen Daten '<Grösse><Parität><Stop>' (8N1, 7E1, 5O2). fc - Stromregierung: 'h' - Hardware (CRTSCTS); 's' - Software (IXON|IXOFF); 'rts' - Nutzung des RTS-Signals für die Übertragung (false) und überprüfen Sie auf ein Echo auf das rohe RS-485. modTel - Telefon des Modems, Anwesenheit deises Feldes schaltet die Übertragung auf die Arbeit im Regime des Modems.

source: Connection timings in format: "conn:symbol[:KeepAliveTm]". Where: conn - maximum time for connection respond wait, in ms; symbol - one symbol maximum time, used for frame end detection, in ms; KeepAliveTm - keep alive timeout in seconds for restart transport.
de: Wartezeit der Verbindung im Format: "conn:symbol". Wo: conn - maximale Wartezeit für die Antwort der Verbindung, in msek; symbol - maximale Wartezeit für ein Zeichen, wird für die Erkennung des Rahmenendes verwendet, in msek; KeepAliveTm - Lebens-Timeout in Sekunden, Neustart des Transport.

source: Life time (sec)
de: Lebenszeit (sek)

source: Dial string
de: Dialzeile

source: Connect response
de: Anschluss, Ergebnis

source: Busy response
de: Beschäftigt, Ergebnis

source: No carrier response
de: Keine Tragende, Ergebnis

source: No dial tone response
de: Kein Signal, Ergebnis

source: Exit
de: Ausgang

source: Hangup string
de: den Hörer legen

source: Hangup response
de: den Hörer legen, Ergebnis
