Repository: alimon/oscada
Catalog: src/moduls/daq/DCON/po/*.po
Languages: de

source: Roman Savochenko, Almaz Karimov
de: Roman Savotschenko, Almaz Karimov

source: Allow realization of DCON client service. Supported I-7000 DCON protocol.
de: Realisierung des I-7000 DCON Client-Protokolls.

source: Parameters table
de: Parametertabelle

source: Gather data period (s)
de: Datenerfassungsperiode (sek)

source: Acquisition schedule
de: Planung der Befragung

source: Gather task priority
de: Priorität der Datenerfassung

source: Transport
de: Übertragung

source: Request tries
de: Fordern Sie versucht

source: Module address
de: Adresse des Moduls I-7000

source: CRC control
de: CRC-Kontrolle

source: No signal;HostOK
de: Kein Signal;Host Signal ist in Ordnung

source: AI method
de: Al-Methode

source: No AI;1AI (#AA);2AI (#AA);3AI (#AA);4AI (#AA);6AI (#AA);8AI (#AA);10AI (#AA);20AI (#AA);16AI (#AA^AA);1AI (#AAN);2AI (#AAN);3AI (#AAN);4AI (#AAN);6AI (#AAN);8AI (#AAN);10AI (#AANN);20AI (#AANN);16AI (#AAN^AAN)
de: Nicht vorhanden AI;1AI (#AA);2AI (#AA);3AI (#AA);4AI (#AA);6AI (#AA);8AI (#AA);10AI (#AA);20AI (#AA);16AI (#AA^AA);1AI (#AAN);2AI (#AAN);3AI (#AAN);4AI (#AAN);6AI (#AAN);8AI (#AAN);10AI (#AANN);20AI (#AANN);16AI (#AAN^AAN)

source: Engineer or percent;Hexadecimal (0000 FFFF);Hexadecimal (8000 7FFF)
de: Ingenieur oder Prozent; Hexadezimal (0000 FFFF);Hexadezimal (8000 7FFF)

source: AO method
de: AO-Methode

source: No AO;1AO (#AA);2AO (#AAN);4AO (#AAN);4AO (#AACN)
de: Nicht vorhanden AO;1AO (#AA);2AO (#AAN);4AO (#AAN);4AO (#AACN)

source: Engineer (00.000 20.000);Engineer (04.000 20.000);Engineer (00.000 10.000);Engineer (+00.000 +20.000);Engineer (+04.000 +20.000);Engineer (+00.000 +10.000);Engineer (-10.000 +10.000);Engineer (+00.000 +05.000);Engineer (-05.000 +05.000);Percent (+000.00 +100.00);Hexadecimal (000 FFF)
de: Ingenieur (00.000 20.000);Ingenieur (04.000 20.000);Ingenieur (00.000 10.000);Ingenieur (+00.000 +20.000);Ingenieur (+04.000 +20.000);Ingenieur (+00.000 +10.000);Ingenieur (-10.000 +10.000);Ingenieur (+00.000 +05.000);Ingenieur (-05.000 +05.000);Prozent (+000.00 +100.00);Hexadezimal (000 FFF)

source: DI method
de: DI-Methode

source: No DI;3DI ($AA6);4DI ($AA6);7DI ($AA6);8DI ($AA6);14DI ($AA6);16DI ($AA6);1DI (@AADI);8DI ($AA6,FF00)
de: Nicht vorhanden DI;3DI ($AA6);4DI ($AA6);7DI ($AA6);8DI ($AA6);14DI ($AA6);16DI ($AA6);1DI (@AADI);8DI ($AA6,FF00)

source: DO method
de: DO-Methode

source: No DO;2DO (@AA,0300);3DO (@AA,7);4DO (@AA,F);5DO (@AA,1F);7DO (@AA,7F);8DO (@AA,FF);12DO (@AA,0FFF);13DO (@AA,1FFF);16DO (@AA,FFFF);2DO (^AADOVVV);3DO (^AADOVVV);2DO (@AADO);4DO (@AADO);6DO (@AADODD);2DO (@AADO0D);4DO (@(^)AADO0D);4DO (@AA,0F00);8DO (@AA,FF00);4DO (#AA000F);8DO (#AA00FF);12DO (#AA000FFF)
de: Nicht vorhanden DO;2DO (@AA,0300);3DO (@AA,7);4DO (@AA,F);5DO (@AA,1F);7DO (@AA,7F);8DO (@AA,FF);12DO (@AA,0FFF);13DO (@AA,1FFF);16DO (@AA,FFFF);2DO (^AADOVVV);3DO (^AADOVVV);2DO (@AADO);4DO (@AADO);6DO (@AADODD);2DO (@AADO0D);4DO (@(^)AADO0D);4DO (@AA,0F00);8DO (@AA,FF00);4DO (#AA000F);8DO (#AA00FF);12DO (#AA000FFF)

source: CI method
de: CI-Methode

source: No CI;2CI (#AA);3CI (#AA)
de: Nicht vorhanden CI;2CI (#AA);3CI (#AA)

source: Call now.
de: Aufruf jetzt.

source: Call by period: %s.
de: Aufruf mit einer Periode: %s.

source: Call next by cron '%s'.
de: Call nächsten durch cron '%s'.

source: Spent time: %s.
de: Gebrauchte Zeit: %s.

source: REQ -> '%s'
de: Anfrage -> '%s'

source: 13:Error respond: Not full.
de: 13:Fehler reagieren: Nicht voll.

source: 20:Respond length error.
de: 20:Modul Paketlänge Fehler.

source: 21:Invalid module CRC.
de: 21:Ungültige Modul CRC.

source: 22:Invalid module response.
de: 22:Ungültige Modul Antwort.

source: RESP -> '%s'
de: Antwort -> '%s'

source: 10:Transport error:
de: 10:Transport-Fehler:

source: ERR -> '%s': %s
de: Fehler -> '%s': %s

source: 23:Undefined range
de: 23:Unbestimmter Bereich

source: 24:Module out of range
de: 24:Module außerhalb der Reichweite

source: 25:Command ignored (host watchdog).
de: 25:Kommando ist ignoriert (host watchdog).

source: 1:Parameter is disabled.
de: 1:Parameter ist abgeschaltet.

source: 2:Acquisition is stopped.
de: 2:Erfassung ist angehalten.
