Repository: alimon/oscada
Catalog: src/po/*.po
Languages: de, uk

source: Disable controller!
de: Controller abschalten!
uk: Виключення контролеру!

source: Disable parameter '%s' error.
de: Fehler beim Abschalten des Parameters '%s'.
uk: Помилка виключення параметру '%s'.

source: Add parameter '%s' error.
de: Fehler beim Hinzufügen des Parameters '%s'.
uk: Помилка додання параметру '%s'.

source: Search and create new parameters error.
de: Fehler bei der Suche und Erstellung neuer Parameter.
uk: Помилка пошуку та створення нових параметрів.

source: Controller:
uk: Контролер:

source: Controller
uk: Контролер

source: Status
uk: Статус

source: Run
de: Aktiv
uk: Запущено

source: Controller DB
de: Datenbank des Controllers
uk: БД контролера

source: Parameter
uk: Параметр

source: Parameters
de: Optionen
uk: Параметри

source: To add parameters
de: Optionen hinzufügen
uk: Додавати параметри

source: Diagnostics
de: Diagnostik
uk: Діагностика

source: Get messages for level more and equal it. Also affect to specific-diagnostic messages generation by data source.
de: Empfang von Nachrichten für gleiche und höhere Stufe. Wirkt sich auch auf das Erzeugen der Datenquelle Diagnosemeldungen.
uk: Отримання повідомлень з рівнем більш або дорівнює вказаному. Також впливає на генерацію джерелом даних специфічних-діагностичних повідомлень.

source: Data acquisition
de: Datenerfassung
uk: Збір даних

source: Maximum calculate time (sec)
de: Maximale Zeit der Berechnung (sek)
uk: Максимальний час обрахунку (сек)

source: Template program
de: Vorlagenprogramm
uk: Програма шаблону

source: Date of modification
de: Änderungsdatum
uk: Дата модифікації

source: Template ID
de: ID der Vorlage
uk: ID шаблону

source: Flags
uk: Прапорці

source: Real position
de: Reale Stelle
uk: Реальна позиція

source: Error
de: Fehler
uk: Помилка

source: === Attributes ===
de: === Attribute ===
uk: === Атрибути ===

source: Load template's libraries error.
de: Fehler beim Laden der Vorlagenbibliotheken.
uk: Помилка завантаження бібліотек шаблонів.

source: Add controller '%s' error.
de: Fehler beim Hinzufügen eines Controllers '%s'.
uk: Помилка додання контролеру '%s'.

source: Start subsystem.
de: Subsystems starten.
uk: Запуск підсистеми.

source: Start template library '%s' error.
de: Fehler beim Starten der Vorlagenbibliothek '%s'.
uk: Помилка запуску бібліотеки шаблону '%s'.

source: Enable controller '%s' error.
de: Fehler beim Einschalten des Controllers '%s'.
uk: Помилка ввімкнення контролера '%s'.

source: Stop controller '%s' error.
de: Fehler beim Anhalten des Controllers '%s'.
uk: Помилка зупинки контролера '%s'.

source: Disable controller '%s' error.
de: Fehler beim Abschalten des Controllers '%s'.
uk: Помилка вимкнення контролеру '%s'.

source: No DAQ node present '%s'.
de: Kein DAQ Knoten vorhanden '%s'.
uk: Відсутній DAQ вузол '%s'.

source: Pointed node is not parameter '%s'.
de: Spitz Knoten nicht Parameter '%s'.
uk: Вказаний вузол не параметр '%s'.

source: Pointed node is not attribute '%s'.
de: Spitz Knoten nicht Attribut '%s'.
uk: Вказаний вузол не атрибут '%s'.

source: =================== Subsystem "Data acquisition" options ================ ------------ Parameters of section '%s' in config-file ----------- RdStLevel <lev> The current station redundant level. RdTaskPer <s> The redundant task call period. RdRestConnTm <s> Restore connection timeout to dead reserve stations. RdRestDtTm <hour> Restore data archive depth from a reserve station after deadline. RdStList <list> Redundant stations list, separated symbol ';' (st1;st2).
de: =================== Optionen des Subsystems "Datenempfang" ====================== --------------- Parameter der Sektion '%s' in der Konfigurationsdatei -------------- RdStLevel <уров> Das Niveau der laufenden Station im Bereitstellungschema. RdTaskPer <с> Die Periodizität des Aufrufes der Bedinungsaufgabeрезервирования. RdRestConnTm <с> Zeitinterval der Wiederstellung der Verbindung mit "toter" Reservstation. RdRestDtTm <час> Wiederstellungstiefe der Archivdaten aus der Reservstation beim Einschalten. RdStList <список> Liste von Reservstationen, mit dem Symbol getrennt ';' (st1;st2).
uk: ==================== Опції підсистеми "Збір даних" ====================== ------- Параметри секції '%s' у конфігураційному файлі ----------- RdStLevel <рів> Рівень резервування поточної станції. RdTaskPer <с> Період виклику задачі обслуговування резервування. RdRestConnTm <с> Час відновлення з'єднання з "мертвою" резервною станцією. RdRestDtTm <год> Глибина часу відновлення даних архіву з резервної станції, під час включення. RdStList <перел> Перелік резервних станції, поділено символом ';' (st1;st2).

source: Template library
de: Vorlagenbibliothek
uk: Бібліотеки шаблонів

source: Redundancy
de: Redundanz
uk: Резервування

source: Station level
de: Stationsstufe
uk: Рівень станції

source: Redundant task period (s)
de: Zeit der Reservierungsaufgabe
uk: Період задачі резервування (с)

source: Restore connection timeout (s)
de: Interval der Wiederherstellungzeit der Verbindung
uk: Час відновлення підключення (с)

source: Restore data depth time (hour)
de: Tiefe der Wiederherstellungzeit der Daten (Stunden)
uk: Глибина часу відновлення даних (годин)

source: Stations
de: Stationen
uk: Станції

source: Live
de: Lebendig
uk: Жива

source: Cntr.
de: Zähl.
uk: Ліч.

source: Go to remote stations list configuration
de: Konfiguration der entfernten Stationen
uk: Перехід до конфігурації переліку віддалених станцій

source: Controllers
de: Controller
uk: Контролери

source: Run.
de: Akt.
uk: Вик.

source: Redund.
de: Überfl.
uk: Резерв.

source: Off;Asymmetric
de: Off;Asymmetrisch
uk: Виключено;Асиметрично

source: Pref. run
de: Prior. Stufe
uk: Уподоб. вик.

source: Remote
de: Gelöscht
uk: Віддалений

source: Template libraries
de: Vorlagenbibliotheken
uk: Бібліотеки шаблонів

source: Spent time: %s.
de: Verbrauchte Zeit: %s.
uk: Витрачено часу: %s.

source: <newStat>
de: <neueStation>
uk: <новСтанц>

source: <High level>
de: <Hohes Niveau>
uk: <Високий рівень>

source: <Low level>
de: <Niedriges Niveau>
uk: <Низький рівень>

source: <Optimal>
uk: <Оптимально>

source: Id error!
de: Fehler des Bezeichners!
uk: Помилка ідентифікатору!

source: The element container is already attached!
de: Elementencontainer ist schon eingeschaltet!
uk: Елемент контейнеру вже під'єднано!

source: Element '%s' is not present!
de: Element '%s' ist nicht vorhanden!
uk: Елемент '%s' відсутній!

source: Field is not String.
de: Feld ist kein Text.
uk: Поле не рядок.

source: Field is not Integer.
de: Feld ist keine Ganzzahl.
uk: Поле не ціле.

source: Field is not Real.
de: Feld ist keine reelle Zahl.
uk: Поле не реальне.

source: Field is not Boolean.
de: Feld ist nicht Logisch.
uk: Поле не логічне.

source: Field is not select type!
de: Feld ist nicht ausgewählter Typ!
uk: Поле не вибіркового типу!

source: Empty
de: Leer
uk: Порожньо

source: Select error! Val: '%s'.
de: Auswahlfehler! Wert: '%s'.
uk: Помилка вибору! Значення: '%s'.

source: Select error! Val: '%d'.
de: Auswahlfehler! Wert: '%d'.
uk: Помилка вибору! Значення: '%d'.

source: Select error! Val: '%f'.
de: Auswahlfehler! Wert: '%f'.
uk: Помилка вибору! Значення: '%f'.

source: Function is used by: %s
de: Funktion wird verwendet: %s
uk: Функція використана: %s

source: Index %d is broken!
de: Index %d ist beschädigt!
uk: Індекс %d пошкоджено!

source: Delete IO '%d' error.
de: Fehler beim Löschen von IO '%d'.
uk: Помилка видалення IO '%d'.

source: Move IO from %d to %d error.
de: Fehler beim Verschieben von IO von %d nach %d.
uk: Помилка пересування IO з %d до %d.

source: Change is not permitted while function is used: %s
de: Änderung nicht möglich solange die Funktion verwendet wird: %s
uk: Зміни неможливі тому що функція використана: %s

source: Value '%s' is already attached!
de: Wert '%s' ist schon eingeschaltet!
uk: Значення '%s' вже підключено!

source: Function:
de: Funktion:
uk: Функція:

source: Function
de: Funktion
uk: Функція

source: Accessing
de: Zugriff
uk: Доступний

source: Used
de: Verwendet
uk: Використано

source: Type
de: Typ
uk: Тип

source: Mode
de: Modus
uk: Режим

source: Hide
de: Unsichtbar
uk: Приховано

source: Default
de: Standard
uk: По замовченню

source: Execute
de: Ausführen
uk: Виконати

source: Number runs
de: Startenzahl
uk: Кількість запусків

source: Spent time
de: Verbrauchte Zeit
uk: Витрачено часу

source: String
de: Text
uk: Рядок

source: Integer
de: Ganzzahl
uk: Цілий

source: Real
de: Reele Zahl
uk: Реальний

source: Bool
de: Logisch
uk: Логічний

source: Object
de: Objekt
uk: Об'єкт

source: Return
de: Rückgabe
uk: Повернення

source: Output
de: Ausgang
uk: Вихід

source: Input
de: Eingang
uk: Вхід

source: IO '%s' is not present!
de: IO '%s' ist nicht vorhanden!
uk: IO '%s' відсутній!

source: Function is not attached!
de: Funktion ist nicht aktiviert!
uk: Функція не підключена!

source: %s: Id or IO %d error!
de: %s: Fehler des Bezeichners oder IO %d!
uk: %s: Помилка ідентифікатору або IO %d!

source: Get object from not object's IO %d error!
de: Fehler beim Empfang des Objekts vom anderen IO %d !
uk: Помилка отримання об'єкту з не об'єктного IO %d!

source: Error 'iconv' open: %s
de: Fehler beim Öffnen 'iconv': %s
uk: Помилка відкриття 'iconv': %s

source: Error input sequence convert: %s
de: Fehler beim Konvertieren der Eingangssequenz: %s
uk: Помилка перетворення вхідної послідовності: %s

source: DB address in format [<DB module>.<DB name>]. For use main work DB set '*.*'.
de: Datenbank Parameter im Format [<DB-Modul>.<DB-Name>]. Für die Hauptdatenbank '*.*' verwenden.
uk: Адреса БД у форматі [<Модуль БД>.<Ім'я БД>]. Для використання основної робочої БД вставити '*.*'.

source: Schedule is wrote in seconds periodic form or in standard CRON form. Seconds form is one real number (1.5, 1e-3). Cron it is standard form "* * * * *". Where items by order: - minutes (0-59); - hours (0-23); - days (1-31); - month (1-12); - week day (0[Sunday]-6). Where an item variants: - "*" - any value; - "1,2,3" - allowed values; - "1-5" - raw range of allowed values; - "*/2" - range divider for allowed values. Examples: "1e-3" - periodic call by one millisecond; "* * * * *" - each minute; "10 23 * * *" - only 23 hour and 10 minute for any day and month; "*/2 * * * *" - for minutes: 0,2,4,...,56,58; "* 2-4 * * *" - for any minutes in hours from 2 to 4(include).
de: Spielplan Wird in Sekunden periodische Form oder in Standard-cron-Form Write. Sekunden Form ist eine Realzahl (1.5, 1e-3). Cron ist es Standardform "* * * * *". Wo Artikel bestellen: - Minuten (0-59); - Stunden (0-23); - Tage (1-31); - Monat (1-12); - Wochentag (0 [Sonntag] -6). Wo ein Posten Varianten: - "*" - einen Wert; - "1,2,3" - zulässigen Werte; - "1-5" - Roh Bereich der zulässigen Werte; - "*/2" - Bereich Teiler für die zulässigen Werte. Beispiele: "1e-3" - periodischen rufen von einer Millisekunde; "* * * * *" - jede Minute; "10 23 * * *" - nur 23 Stunden und 10 Minuten für jeden Tag und Monat; "*/2 * * * *" - für Minuten: 0,2,4,..., 56,58; "* 2-4 * * *" - für alle Minuten in Stunden von 2 bis 4 (einschließlich).
uk: Планування записується у формі секундної періодичності або у формі стандарту CRON. Секундна форма це одне реальне число (1.5, 1e-3). Форма стандарту Cron це "* * * * *". Де елементи по черзі: - хвилини (0-59); - години (0-23); - дні (1-31); - місяця (1-12); - дні тижня (0[Неділя]-6). Де варіанти елементу: - "*" - будь яке значення; - "1,2,3" - дозволені значення; - "1-5" - діапазон дозволених значень; - "*/2" - дільник діапазону дозволених значень. Приклади: "1e-3" - періодичний виклик з однією мілісекундою; "* * * * *" - кожна хвилина; "10 23 * * *" - тільки 23я година та 10а хвилина будь якого дня та місяця; "*/2 * * * *" - для хвилин: 0,2,4,...,56,58; "* 2-4 * * *" - для будь якої хвилини у годині від 2 до 4(включно).

source: Task priority level (-1...99), where: -1 - lowest priority batch policy; 0 - standard userspace priority; 1...99 - realtime priority level (round-robin), often allowed only for "root".
de: Task-Priorität (-1 ... 99), wobei: -1 - Niedrigste Priorität, Hintergrund Politik; 0 - Standard-Benutzer Priorität; 1...99 - Die Prioritätsstufe der Echtzeit-(Round-Robin), oft nur für "root".
uk: Рівень пріоритету задачі (-1...99), де: -1 - мінімальний пріоритет, фонова політика; 0 - стандартний користувацький пріоритет; 1...99 - рівень пріоритету реального часу (round-robin), часто доступно тілько для "root".

source: Modules scheduler
de: Modulsteuerung
uk: Керування модулями

source: =================== Subsystem "Module scheduler" options ================= --ModPath=<path> Modules <path> (/var/os/modules/). ------------ Parameters of section '%s' in config-file ----------- ModPath <path> Path to shared libraries(modules). ModAllow <list> List of shared libraries allowed for automatic loading, attaching and starting (bd_DBF.so;daq_JavaLikeCalc.so). Use '*' value for allow all modules. ModDeny <list> List of shared libraries deny for automatic loading, attaching and starting (bd_DBF.so;daq_JavaLikeCalc.so). ChkPer <sec> Period of checking at new shared libraries(modules).
de: =================== Subsystem "Modulsteuerung" ==================== --ModPath=<path> Pfad zu den Modulen (/var/os/modules/). --------- Parameter des Abschnitts '%s' in der Konfigurationsdatei --------- ModPath <path> Pfad zu den gemeinsamen Bibliotheken (Module). ModAllow <list> Liste von erlaubten gemeinsamen Bibliotheken werden automatisch geladenen, verbunden und gestartet (bd_DBF.so;daq_JavaLikeCalc.so). Verwenden Sie '*' für alle Module. ModDeny <list> Liste von verbotenen gemeinsamen Bibliotheken werden nicht automatisch geladen, verbunden und gestartet (bd_DBF.so;daq_JavaLikeCalc.so). ChkPer <sec> Zeitintervall für die Suche von neuen gemeinsamen Bibliotheken(Module).
uk: ================ Опції підсистеми "Керування модулями" ================== --ModPath=<шлях> Шлях до модулів (/var/os/modules/). ------- Параметри секції '%s' у конфігураційному файлі ----------- ModPath <шлях> Шлях до поділяємих бібліотек (модулів). ModAllow <перелік> Перелік поділяємих бібліотек дозволених для автоматичного завантаження, підключення та виконання (bd_DBF.so;daq_JavaLikeCalc.so). Використовувати значення '*' для дозволу всіх модулів. ModDeny <перелік> Перелік поділяємих бібліотек заборонених для автоматичного завантаження, підключення та виконання (bd_DBF.so;daq_JavaLikeCalc.so). ChkPer <сек> Період пошуку нових поділяємих бібліотек (модулів).

source: SO '%s' is not present!
de: SO '%s' ist nicht vorhanden!
uk: SO '%s' відсутнє!

source: SO '%s' is already attached!
de: SO '%s' ist eingeschaltet!
uk: SO '%s' вже підключене!

source: SO '%s' error: %s !
de: SO '%s' Fehler: %s !
uk: SO '%s' помилка: %s !

source: %s for type '%s' doesn't support module version: %d!
de: %s für Typ '%s' unterstützt die Version %d des Moduls nicht!
uk: %s для типу '%s' не підтримує версію модуля: %d!

source: Module '%s' is already present!
de: Modul '%s' ist schon vorhanden!
uk: Модуль '%s' вже присутній

source: Attach module '%s' error!
de: Fehler beim Einschaltung des Moduls '%s'!
uk: Помилка підключення модуля '%s'!

source: Can't detach library '%s'.
de: Bibliothek '%s' ausschalten ist nicht möglich.
uk: Неможливо відключити бібліотеку '%s'.

source: Subsystem
uk: Підсистема

source: Path to shared libs(modules)
de: Pfad zu den gemeinsamen Bibliotheken (Modulen)
uk: Шлях до поділяємих бібліотек(модулів)

source: Denied modules
de: Nicht erlaubte Module
uk: Заборонені модулі

source: List of shared libs(modules) deny for auto connection. Elements separated by symbol ';'.
de: Liste von gemeinsamen Bibkiotheken (Modulen) die für die automatische Verbindung nicht erlaubt sind. Elemente sind mit dem Symbol ';' getrennt. Wert '*' wird für die Auflistung aller Module verwendet.
uk: Перелік поділяємих бібліотек(модулів) заборонених для автоматичного підключення. Елементи поділено символом ';'.

source: Allowed modules
de: Erlaubte Module
uk: Дозволені модулі

source: List of shared libs(modules) allowed for auto connection. Elements separated by symbol ';'. Value '*' used for allow all modules.
de: Liste von gemeinsamen Bibliotheken (Modulen) die für die automatische Verbindung erlaubt sind. Elemente sind mit dem Symbol ';' getrennt. Wert '*' wird für die Auflistung aller Module verwendet.
uk: Перелік поділяємих бібліотек(модулів) дозволених для автоматичного підключення. Елементи поділено символом ';'. Значення '*' використано для дозволу всіх модулів.

source: Check modules period (sec)
de: Zeitintervall für die Prüfung der Module (sek)
uk: Період перевірки модулів (сек)

source: Check modules now.
de: Module jetzt prüfen.
uk: Перевірити модулі зараз.

source: Shared libs(modules)
de: Pfad zu den gemeinsamen Bibliotheken (Modulen)
uk: Поділяємі бібліотеки (модулі)

source: Path
de: Pfad
uk: Шлях

source: Modules
de: Module
uk: Модулі

source: Author
de: Autor
uk: Автор

source: License
de: Lizenz
uk: Ліцензія

source: Connect module.
de: Modul verbinden.
uk: Під'єднання модуля.

source: Function '%s' is not present in the module!
de: Funktion '%s' ist nicht vorhanden im Modul!
uk: Функція '%s' відсутня в модулі!

source: Module:
de: Modul:
uk: Модуль:

source: Module
de: Modul
uk: Модуль

source: Module information
de: Modulinformation
uk: Інформація про модуль

source: 1:Parameter is disabled.
de: 1:Parameter ist deaktiviert.
uk: 1:Параметр вимкнено.

source: 2:Controller is stopped.
de: 2:Controller ist angehalten!
uk: 2:Контролер зупинено.

source: Parameter:
uk: Параметр:

source: Change type lead to data lost for specific configurations.
de: Ändern Art führen zu Daten für bestimmte Konfigurationen verloren.
uk: Зміна типу потягне за собою втрату даних специфічної конфігурації.

source: Inclusion
de: Einbeziehung
uk: Включення

source: Controller is not started!
de: Controller ist nicht gestartet!
uk: Контролер не запущено!

source: Function calculate frequency (Hz)
de: Frequenz der Berechnung der Funktion (Hz)
uk: Частота обчислення функції (Гц)

source: Function start flag
de: Schalter fürs Startens der Funktion
uk: Прапорець запуску функції

source: Function stop flag
de: Die Flagge fürs Stoppen der Funktion
uk: Прапорець зупинки функції

source: Function error
de: Fehler in der Funktion
uk: Помилка функції

source: Template is disabled.
de: Vorlage ist abgeschaltet.
uk: Шаблон вимкнено.

source: Parameter template:
de: Parametervorlage:
uk: Шаблон параметра:

source: Template
de: Vorlage
uk: Шаблон

source: Real;Integer;Boolean;String;Text;Object
de: Reelle Zahl;Ganzzahl;Logisch;Linie;Text;Objekt
uk: Реальний;Цілий;Логічний;Рядок;Текст;Об'єкт

source: Input;Output
de: Eingang;Ausgang
uk: Вхід;Вихід

source: Attribute
de: Attribut
uk: Атрибут

source: No attribute;Read only;Full access
de: Nicht Attribut;Nur Lesen;Voller Zugang
uk: Не атрибут;Тільки читання;Повний доступ

source: Configure
de: Konfiguration
uk: Конфігурація

source: Constant;Public constant;Link
de: Konstante;Konstante frei verfügbar;Verbindung
uk: Константа;Публічна константа;Зв'язок

source: Program language
de: Programmsprache
uk: Мова програми

source: Program
de: Programm
uk: Програма

source: New IO
de: Neu IO
uk: Нове IO

source: Deleting lock attribute in not allow.
de: Löschen des blockierten Attributs ist nicht zulässig.
uk: Видалення заблокованого атрибуту неможливе.

source: Changing locked attribute is not allowed.
de: Änderung des blockierten Attributs ist nicht zulässig.
uk: Зміна заблокованого атрибуту неможлива.

source: Empty value is not valid.
de: Leerer Wert ist nicht zulässig.
uk: Порожнє значення недозволене.

source: Template '%s' start is error.
de: Fehler beim Starten der Vorlage '%s'.
uk: Помилка запуску шаблону '%s'.

source: Some templates start error.
de: Fehler beim Starten einiger Vorlagen.
uk: Помилка запуску деяких шаблонів.

source: Parameter templates library:
de: Bibliothek der Parametervorlagen:
uk: Бібліотека шаблонів параметрів:

source: Library
de: Bibliothek
uk: Бібліотека

source: Library BD
de: Datenbank der Bibliothek
uk: БД бібліотеки

source: DB address in format [<DB module>.<DB name>.<Table name>]. For use main work DB set '*.*'.
de: Datenbankadresse im Format [<DB module>.<DB name>.<Table name>]. Für die Hauptdatenbank '*.*' verwenden.
uk: Адреса БД у форматі [<Модуль БД>.<Ім'я БД>.<Ім'я таблиці>]. Для використання основної робочої БД вставити '*.*'.

source: Parameter templates
de: Parametervorlagen
uk: Шаблони параметрів

source: Templates
de: Vorlagen
uk: Шаблони

source: Transport protocols
de: Übertragungsprotokolle
uk: Транспортні протоколи

source: =============== Subsystem "Transport protocols" options =================
de: ============== Optionen des Subsystems "Übertragungsprotokolle" ================
uk: =============== Опції підсистеми "Транспортні протоколи" ================

source: Security
de: Sicherheit
uk: Безпека

source: Full name
de: Voller Name
uk: Повне ім'я

source: Password
de: Kennwort
uk: Пароль

source: User picture
de: Bild des Benutzers
uk: Картинка користувача

source: Users
de: Benutzer
uk: Користувачі

source: Administrator (superuser)!!!
de: Administrator (Supernutzer)!!!
uk: Адміністратор (суперкористувач)!!!

source: Simple user.
de: Normaler Benutzer.
uk: Простий користувач.

source: Administrators group.
de: Gruppe von Administratoren.
uk: Група адміністраторів.

source: Users group.
de: Gruppe von Benutzern.
uk: Група користувачів

source: Removal of system user is inadmissible.
de: Löschen des Systembenutzers ist nicht zulässig.
uk: Видалення системного користувача неможливе.

source: Removal of system group is inadmissible.
de: Löschen der Systemgruppe ist nicht zulässig.
uk: Видалення системної групи неможливе.

source: Search and create new users error.
de: Fehler beim Suchen und Erstellen neuer Benutzer.
uk: Помилка пошуку та створення нових користувачів.

source: Search and create new user's groups error.
de: Fehler beim Suchen und Erstellen neuer Benutzergruppen.
uk: Помилка пошуку та створення нових груп користувачів.

source: ======================= Subsystem "Security" options ====================
de: ================== Optionen des Subsystems "Sicherheit" =================
uk: ======================== Опції підсистеми "Безпеки" =====================

source: User
de: Benutzer
uk: Користувач

source: Group
de: Gruppe
uk: Група

source: Users and groups
de: Benutzer und Gruppen
uk: Користувачі та групи користувачів

source: Groups
de: Gruppen
uk: Групи користувачів

source: User
de: Benutzer:
uk: Користувач:

source: User DB
de: Datenbank des Benutzers
uk: БД користувача

source: Include
de: Eingeschlossen
uk: Включено до

source: Group
de: Gruppe
uk: Група

source: User group DB
de: Datenbank der Benutzergruppe
uk: БД групи користувачів

source: Specials
de: Zusätze
uk: Спеціальні

source: ======================= Subsystem "Special" options =====================
de: ===================== Optionen des Subsystems "Zusatz" ====================
uk: ====================== Опції підсистеми "Спеціальні" ====================

source: Special
de: Zusatz
uk: Спеціальний модуль

source: The subsystem is not modular!
de: Das Subsystem ist nicht modular!
uk: Підсистема не модульна!

source: Disconnect module '%s'!
de: Verbindung trennen für das Modul '%s'!
uk: Від'єднання модуля '%s'!

source: Start module '%s' error.
de: Fehler beim Starten des Moduls '%s'.
uk: Помилка запуску модуля '%s'!

source: Stop module '%s' error.
de: Fehler beim Anhahalten des Moduls '%s'.
uk: Помилка зупинки модуля '%s'.

source: Subsystem:
uk: Підсистема:

source: Empty Station
de: Leere Station
uk: Порожня станція

source: System counters on exit: %s
de: System Zählern an der Ausfahrt: %s
uk: Системні лічильники при виході: %s
