Repository: alimon/oscada
Catalog: src/po/*.po
Languages: de, uk

source: Change work directory to '%s' error: %s. Perhaps current directory already set correct to '%s'.
de: Fehler der Veränderung der Arbeitsdirectory in '%s': %s. Wahrscheinlich ist die laufende Directory schon korrekt installiert in '%s'.
uk: Помилка зміни робочої директорії у '%s': %s. Можливо поточну директорію вже коректно встановлено у %s'.

source: Read only access to file '%s'.
de: Nur Lesezugriff auf Datei '%s'.
uk: Доступ тільки на читання до файлу '%s'.

source: day
de: Tag
uk: день

source: hour
de: Zeit
uk: год

source: min
uk: хвил

source: s
uk: с

source: ms
uk: мс

source: us
uk: мкс

source: ns
uk: нс

source: YiB
uk: ЙіБ

source: ZiB
uk: ЗіБ

source: EiB
uk: ЕіБ

source: PiB
uk: ПіБ

source: TiB
uk: ТіБ

source: GiB
uk: ГіБ

source: MiB
uk: МіБ

source: KiB
uk: КіБ

source: B
uk: Б

source: *************************************************************************** ********** %s v%s (%s-%s). ********* *************************************************************************** =========================================================================== ========================= The general system options ====================== =========================================================================== -h, --help Info message about system options. --Config=<path> Config-file path. --Station=<id> The station identifier. --StatName=<name> The station name. --demon Start into demon mode. --CoreDumpAllow Set limits for core dump creation allow on crash. --MessLev=<level> Process messages <level> (0-7). --log=<direct> Direct messages to: <direct> & 1 - syslogd; <direct> & 2 - stdout; <direct> & 4 - stderr; <direct> & 8 - archive. ----------- The config-file station '%s' parameters ----------- StName <nm> Station name. WorkDB <Type.Name> Work DB (type and name). Workdir <path> Work directory. ModDir <path> Modules directory. IcoDir <path> Icons directory. DocDir <path> Documents directory. MessLev <level> Messages <level> (0-7). SelDebCats <list> Debug categories list (separated by ';'). LogTarget <direction> Direct messages to: <direct> & 1 - syslogd; <direct> & 2 - stdout; <direct> & 4 - stderr; <direct> & 8 - archive. Lang <lang> Work-internal language, like "en_US.UTF-8". Lang2CodeBase <lang> Base language for variable texts translation, two symbols code. SaveAtExit <true> Save system at exit. SavePeriod <sec> Save system period.
de: *************************************************************************** ********** %s %s (%s-%s). ********* *************************************************************************** =========================================================================== ====================== Grundoptionen des Systems ========================== =========================================================================== -h, --help Info Nachricht über System-Optionen. --Config=<path> Pfad der Konfigurationsdatei. --Station=<id> Station-ID. --StatName=<name> Name der Station. --demon Start im Hintergrund-Modus. --CoreDumpAllow Festlegen von Limits für Core-Dump-Erstellung auf Crash erlauben. --MessLev=<Stufe> Nachrichtenstufe <Stufe> von Nachrichten (0-7). --log=<direct> Umleitung der Nachrichten in: <direct> & 1 - Systemlog (syslogd); <direct> & 2 - Standardausgang (stdout); <direct> & 4 - Standardfehlerausgang (stderr); <direct> & 8 - Archiv. ---------- Parameter der Station '%s' in der Konfigurationsdatei ---------- StName <nm> Stationsname. WorkDB <Type.Name> Arbeitsdatenbank (Typ und Name). Workdir <path> Arbeitsverzeichnis. ModDir <path> Modulverzeichnis. IcoDir <path> Symbolverzeichnis. DocDir <path> Documenteverzeichnis. MessLev <level> Nachrichtenstufe <level> von Nachrichten (0-7). SelDebCats <Liste> Liste der Kategorien Debuggen (geteilt ';'). LogTarget <direction> Umleitung der Nachrichten in: <direction> & 1 - Systemlog (syslogd); <direction> & 2 - Standardausgang (stdout); <direction> & 4 - Standardfehlerausgang (stderr); <direction> & 8 -Archiv. Lang <Sprache> Worker-interne Sprache, wie "de_DE.UTF-8". Lang2CodeBase <Sprache> Grundsprache für die Übersetzung von Textvariablen, zwei Symbole. SaveAtExit <true> System beim Beenden Speichern. SavePeriod <sec> Zeitintervall für Systemspeicherung.
uk: *************************************************************************** ********** %s %s (%s-%s). ********* *************************************************************************** =========================================================================== ======================== Основні опції системи ============================ =========================================================================== -h, --help Інформація про опції системи. --Config=<шлях> Конфігураційний файл. --Station=<ид> Ідентифікатор станції. --StatName=<ім'я> Ім'я станції. --demon Запуск у режимі демона. --CoreDumpAllow Встановлення обмеження для дозволу генерації дампу пам'яті при падінні. --MessLev=<рівень> Оброблюваний <рівень> повідомлень (0-7). --log=<напрямок> Спрямування повідомлень до: <напрямок> & 1 - системний логер (syslogd); <напрямок> & 2 - стандартний вихід (stdout); <напрямок> & 4 - стандартний вихід помилок (stderr); <напрямок> & 8 - архів повідомлень. ------ Параметри станції '%s' у конфігураційному файлі -------- StName <ім'я> Ім'я станції. WorkDB <Тип.Ім'я> Робоча БД (ім'я та тип). Workdir <шлях> Робоча директорія. ModDir <path> Директорія модулів. IcoDir <path> Директорія іконок. DocDir <path> Директорія документів. MessLev <рівень> Оброблюваний <рівень> повідомлень (0-7). SelDebCats <перелік> Перелік категорій налагодження (поділено ';'). LogTarget <напрямок> Спрямування повідомлень до: <напрямок> & 1 - системний логер (syslogd); <напрямок> & 2 - стандартний вихід (stdout); <напрямок> & 4 - стандартний вихід помилок (stderr); <напрямок> & 8 - архів повідомлень. Lang <мова> Робоча-внутрішня мова, як "uk_UA.UTF-8". Lang2CodeBase <мова> Базова мова для перекладу текстових змінних, два символи. SaveAtExit <true> Зберігати систему при виході. SavePeriod <сек> Період збереження системи.

source: Config-file '%s' error: %s
de: Konfigurationsdatei '%s' Fehler: %s
uk: Помилка конфігураційного файлу '%s': %s

source: Config-file '%s' load error.
de: Config-Datei '%s' Ladefehler.
uk: Помилка завантаження конфігураційного файлу '%s'.

source: Station '%s' is not present in the config-file. Use '%s' station configuration!
de: Station '%s' fehlt in der Konfigurationsdatei. Konfiguration der Station '%s' wird verwendet!
uk: Станція '%s' відсутня у конфігураційному файлі. Використано конфігурацію станції '%s'!

source: Configuration '%s' error!
de: Konfigurationsfehler '%s'!
uk: Помилка конфігурації '%s'!

source: Load config-file error: %s
de: Fehler beim Laden der Konfigurationsdatei: %s
uk: Помилка завантаження конфігураційного файлу: %s

source: Configuration '%s' write error. %s
de: Konfigurationsdatei '%s' Fehler: %s
uk: Помилка конфігураційного файлу '%s': %s

source: Load!
de: Laden!
uk: Завантаження

source: No one module is loaded. Your configuration broken!
de: Kein Modul ist geladen. Ihre Konfiguration ist kaput
uk: Жодного модуля не завантажено. Вашу конфігурацію зламано!

source: Error load subsystem '%s'.
de: Fehler beim Laden des Subsysems '%s'.
uk: Помилка завантаження підсистеми '%s'.

source: Save!
de: Speicherung!
uk: Збереження

source: Start!
de: Starten!
uk: Запуск!

source: Error start subsystem '%s'.
de: Fehler beim Starten des Subsystems '%s'.
uk: Помилка старту підсистеми '%s'.

source: Final starting!
de: Starten ist beendet
uk: Запуск завершено!

source: Stop!
de: Anhalten!
uk: Зупинка!

source: Error stop subsystem '%s'.
de: Fehler beim Anhalten des Subsystems '%s'.
uk: Помилка зупинки підсистеми '%s'.

source: The Terminate signal is received. Server is being stopped!
de: Signal zum Beenden wird empfangen. Server wird angehalten!
uk: Отримано сигнал припинення. Сервер буде зупинено!

source: Floating point exception is caught!
de: Fehler bei Fliesskommaoperation abgefangen!
uk: Виключення операції з плаваючою крапкою!

source: Free child process %d!
de: Beenden des Kindprozesses %d!
uk: Закриття процесу нащадка %d!

source: Segmentation fault signal!
de: Fehler Speichersegmentierung!
uk: Сигнал помилки сегментації пам'яті!

source: OpenSCADA is aborted!
de: OpenSCADA ist abgebrochen!
uk: OpenSCADA перервано!

source: Unknown signal %d!
de: Unbekanntes Signal %d!
uk: Невідомий сигнал %d!

source: Timeouted !!!
de: Zeitüberschreitung !!!
uk: Час очікування вичерпано!!!

source: Wait event...
de: Warte auf Ereignis...
uk: Очікування повідомлення...

source: Task '%s' is already present!
de: Aufgabe '%s' ist schon geschafft!
uk: Завдання '%s' вже присутнє!

source: No permission for create real-time policy for '%s'. Default thread is created!
de: Kein Zugang für das Schaffen der Realzeitpolitik für '%s'. Der Strom ist geschaffen default!
uk: Немає доступу для створення політики реального часу для '%s'. Створено звичайну нитку!

source: Task creation error %d.
de: Fehler des Schaffens der Aufgabe %d!
uk: Помилка створення задачі %d.

source: Task '%s' start timeouted!
de: Task-Start '%s' timeouted!
uk: Завдання '%s' не запущено!

source: Task '%s' is not stopped!
de: Aufgabe '%s' ist nicht gestoppt!
uk: Завдання '%s' не зупинено!

source: Task %u unexpected terminated by exception.
de: Task %u unerwartet beendet durch Ausnahme.
uk: Завдання %u несподівано перервано виключенням.

source: 1:Request is not object!
de: 1:Die Anfrage ist kein Objekt!
uk: 1:Запит не є об'єкт!

source: %s station: "%s"
uk: %s станція: "%s"

source: Station
uk: Станція

source: Station name
de: Stationsnamen
uk: Ім'я станції

source: Version
uk: Версія

source: Host name
de: Rechnername
uk: Ім'я хосту

source: System user
de: Systembenutzer
uk: Системний користувач

source: Operation system
de: Betriebssystem
uk: Операційна система

source: Frequency (MHZ)
de: Systemtakt (MHz)
uk: Частота (МГц)

source: Real-time clock resolution
de: Auflösung Echtzeituhr
uk: Роздільна здатність годиннику реального часу

source: Internal charset
de: Interne Kodierung
uk: Внутрішнє кодування

source: Config-file
de: Konfigurationsdatei
uk: Конфігураційний файл

source: Work directory
de: Arbeitsverzeichnis
uk: Робоча директорія

source: Modules directory
de: Modulverzeichnis
uk: Директорія модулів

source: Icons directory
de: Symbolverzeichnis
uk: Директорія іконок

source: Separate directory paths with icons by symbol ';'.
de: Separate Verzeichnispfade mit Ikonen Symbol ';'.
uk: Відокремлювати шляхи тек із іконками символом ';'.

source: Documents directory
de: Documenteverzeichnis
uk: Директорія документів

source: Separate directory paths with documents by symbol ';'.
de: Separate Verzeichnispfade mit Documents Symbol ';'.
uk: Відокремлювати шляхи тек із документами символом ';'.

source: Work DB
de: Arbeitsdatenbank
uk: Робоча БД

source: Work DB address in format [<DB module>.<DB name>]. Change it field if you want save or reload all system from other DB.
de: Arbeitsdatenbank im Format [<DB Modul>.<DB Name>]. Ändern Sie dieses Feld falls Sie eine andere Datenbank laden oder speichern wollen.
uk: Адреса робочої БД у форматі [<Модуль БД>.<Ім'я БД>]. Змініть це поле якщо бажаєте зберегти або перевантажити всю систему з іншої БД.

source: Save system at exit
de: System beim Beenden speichern
uk: Зберегти систему при виході

source: Select for automatic system saving to DB on exit.
de: Auswahl für das automatische Speichern in die Datenbank beim Beenden.
uk: Вибрати для автоматичного збереження системи у БД під час виходу.

source: Save system period
de: Zeit für Sicherungsintervall des Systems
uk: Період збереження системи

source: Use no zero period (seconds) for periodic saving of changed systems parts to DB.
de: Keine Nullperiode (Sekunden) für periodische Speicherung der geänderten Systemteile in die Datenbank verwenden.
uk: Використати не нульовий період (секунди) для періодичного збереження змін частин системи у БД.

source: Language
de: Sprache
uk: Мова

source: Text variable's base language
de: Basissprache für die Variablentexte
uk: Базова мова текстових змінних

source: Multilingual for variable texts support enabling by base language selection.
de: Schließt die multisprachliche Unterstützung für die Textvariable durch die Wahl der Grundsprache.
uk: Вмикає багатомовну підтримку для текстових змінних шляхом вибору базової мови.

source: Least level
de: Niedrigste Nachrichtenstufe
uk: Найменший рівень

source: Least messages level which process by the system.
de: Die niedrigste Nachrichtenstufe, welche vom System bearbeitet wird.
uk: Найменший рівень повідомлень, які обробляються системою.

source: To syslog
de: Systemlog (syslog)
uk: До системного логера(syslog)

source: To stdout
de: Standardausgang (stdout)
uk: До стандартного виходу(stdout)

source: To stderr
de: Standardfehlerausgang (stderr)
uk: До стандартного виходу помилок(stderr)

source: To archive
de: Zum Archiv
uk: До архіву

source: Subsystems
de: Subsysteme
uk: Підсистеми

source: Tasks
de: Aufgaben
uk: Задачі

source: For CPU set use processors numbers string separated by symbol ':'. CPU numbers started from 0.
de: Für die Bezeichnung der Prozessors benutzen Sie die Nummerzeile, getrennt mit dem Symbol ':'. Prozessorsnummer beginnen mit 0.
uk: Для встановлення процесорів використовуйте строку номерів, поділену символом ':'. Номера процесорів починаються з 0.

source: Thread
de: Der Strom
uk: Нитка

source: Policy
de: Politik
uk: Політика

source: Prior.
de: Priorität
uk: Пріор.

source: CPU set
de: CPU Installation
uk: Вст. CPU

source: Debug
de: Debuggen
uk: Наладка

source: Counters
de: Zähler
uk: Лічильники

source: Debug categories
de: Kategorien Debugging
uk: Категорії налагодження

source: See to messages
de: Ansicht der Nachrichten
uk: Перегляд повідомлень

source: Finished.
uk: Закінчено.

source: Last: %s. Consume: %3.1f%% (%s from %s). Lag: %s. Cycles lost: %g.
de: Letzter: %s. Konsumieren: %3.1f%% (%s von %s). Lag: %s. Verlust Zyklen: %g.
uk: Останній: %s. Використ.: %3.1f%% (%s із %s). Відстав.: %s. Втрата циклів: %g.

source: Standard
uk: Стандарт

source: Style "batch"
de: Stil "batch"
uk: Стиль "batch"

source: No present task '%s'.
de: Die Aufgabe ist nicht vorhanden '%s'.
uk: Задача '%s' відсутня.

source: Set no allowed processors.
de: Unzugängliche Prozesse sind installiert
uk: Встановлено недопустимі процесори.

source: CPU set for thread error.
de: Fehler bei der Installation von Prozessoren für den Strom.
uk: Помилка встановлення CPU для потоку.

source: Redundant
de: Überflüssig
uk: Резервування

source: Preferable run
de: Prioritätsstufe
uk: Уподобання виконання

source: Start controller '%s' error.
de: Fehler beim Starten des Controllers '%s'.
uk: Помилка запуску контролера '%s'.

source: Id of parameter type error!
de: Fehler Typ des Parameterbezeichners!
uk: Id параметру помилкове!

source: Parameter type '%s' is not present.
de: Parametertyp '%s' ist nicht vorhanden.
uk: Тип параметру '%s' відсутній.

source: Error attach new controller %s.
de: Fehler beim Anbinden des neuen Controllers %s.
uk: Помилка підключення нового контролера %s.

source: Module doesn't support the function for compilation programming languages.
de: Modul unterstützt Kompilierung der Programmiersprache nicht.
uk: Модуль не підтримує функцію компіляції мови програмування.

source: Owner
uk: Власник

source: Transport type
de: Übertragungstypen
uk: Тип транспорту

source: Transport protocol
de: Übertragungsprotokoll
uk: Транспортний протокол

source: Open user
de: Der offene Benutzer
uk: Користувач що відкриває

source: Transport
de: Übertragung
uk: Транспорт

source: Transport address
de: Adresse des Übertragung
uk: Адреса транспорту

source: Request user
de: Benutzer der Anfrage
uk: Користувач запиту

source: Request password
de: Kennwort der Anfrage
uk: Пароль запиту

source: Search and create new input transports error.
de: Fehler bei der Suche und Erstellung neuer Eingangsübertragungen.
uk: Помилка пошуку та створення нових вхідних транспортів.

source: Search and load external hosts DB error.
de: Fehler bei der Suche und Laden der externen Datenbank.
uk: Помилка пошуку та завантаження БД зовнішніх хостів.

source: Start input transport '%s' error.
de: Fehler beim Starten der Eingangsübertragung '%s'.
uk: Помилка запуску вхідного транспорту '%s'.

source: Start output transport '%s' error.
de: Fehler beim Starten der Ausgangsübertragung '%s'.
uk: Помилка запуску вихідного транспорту '%s'.

source: Stop input transport '%s' error.
de: Fehler beim Anhalten der Eingangsübertragung '%s'.
uk: Помилка зупинки вхідного транспорту '%s'.

source: Stop output transport '%s' error.
de: Fehler beim Anhalten der Ausgangsübertragung '%s'.
uk: Помилка зупинки вихідного транспорту '%s'.

source: ======================= Subsystem "Transports" options ==================
de: ================== Optionen des Subsystems "Übertragung" ================
uk: ======================= Опції підсистеми "Транспорти" ===================

source: Remote host '%s' error!
de: Fehler des entfernten Systems '%s'!
uk: Помилка віддаленого хосту '%s'!

source: External hosts poll
de: Liste der entfernten Systeme
uk: Перелік зовнішніх хостів

source: User;System;User and System
uk: Корист.;Системн.;Корист. та Системн.

source: New external host
de: Neuer externe Host
uk: Новий зовнішній хост

source: Input transport
de: Eingangsübertragung
uk: Вхідний транспорт

source: Output transport
de: Ausgangsübertragung
uk: Вихідний транспорт

source: Transports
de: Übertragungen
uk: Транспорти

source: Stoped.
de: Angehalten.
uk: Зупинено.

source: Delete node error: %s
de: Löschen Knotenfehler: %s
uk: Помилка видалення вузла: %s

source: Input transport:
de: Eingangsübertragung:
uk: Вхідний транспорт:

source: Transport DB
de: Datenbank der Übertragung
uk: БД транспорту

source: Transport protocol '%s' no present
de: Übertragungsprotokoll ist '%s' nicht vorhanden
uk: Транспортний протокол '%s' відсутній

source: Output transport:
de: Ausgangsübertragung:
uk: Вихідний транспорт:

source: Binary;Text(LF);Text(CR);Text(CR/LF)
de: Binär;Text(LF);Text(CR);Text(CR/LF)
uk: Бінарний;Текст(LF);Текст(CR);Текст(CR/LF)

source: Wait timeout
de: Timeout erwarten
uk: Очікувати таймауту

source: Sign for expect by timeout when a response is received. Many systems in response to various protocols (HTTP) are send the response data in several pieces. Without this flag will be received and displayed only the first piece. When this flag will be set all the pieces awaiting an answer, until the lack of data during the timeout the transport elapsed .
de: Signal für das Timeout-Warten beim Erhalten der Antwort. Mehrere Systeme (HTTP) können bei der Antwort an verschiedenen Protokollen Daten der Antwort in einigen Stückchen senden. Ohne dieser Flagge wird nur das erste Stück erhalten und gezeigt. Bei der Installation dieser Flaggewird das Erwarten aller Antwortstückchen, bis zum Datenfehlen während Transport-Timeout erfüllt.
uk: Ознака очікувати таймауту при отриманні відповіді. Багато систем під час відповіді на різних протоколах (HTTP) можуть надсилати дані відповіді декількома частинами. Без цього прапорцю буде отримано та відображено тільки першу частину. При встановлені цього прапорцю буде здійснено очікування всіх частин відповіді, до відсутності даних протягом таймаута доочікування транспорту.

source: Answer
de: Antwort
uk: Відповідь

source: User interfaces
de: Benutzerschnittstellen
uk: Інтерфейси користувача

source: ===================== Subsystem "User interfaces" options ===============
de: ============= Optionen des Subsystems "Benutzerschnittstellen" ============
uk: ================= Опції підсистеми "Інтерфейси користувачів" ============

source: User interface
de: Benutzerschnittstelle
uk: Інтерфейс користувача

source: Parameter: %s
uk: Параметр: %s

source: Attributes
de: Attribute
uk: Атрибути

source: Unknown
de: Unbekannt
uk: Невідомий

source: Boolean
de: Logisch
uk: Логічний

source: -select
de: -Wahl
uk: -вибір

source: Parameter's attribute ID: '%s' Name: '%s' Type: '%s'
de: Das Attribut Parameter ID: '%s' Name: '%s' Typ: '%s'
uk: Атрибут параметру ID: '%s' Ім'я: '%s' Тип: '%s'

source: Values:
de: Werte:
uk: Значення:

source: Selected names:
de: Namen zu verwalten:
uk: Імена для обрання:

source: Archiving
de: Archivierung
uk: Архівація

source: Not select type!
de: Typ ist nicht ausgewählt!
uk: Не вибірковий тип!

source: Write access is denied!
de: Schreibzugriff verboten!
uk: Немає доступу на запис!

source: Write value to archive error: %s
de: Fehler beim Schreiben des Wertes ins Archiv: %s
uk: Помилка запису значення до архіву: %s

source: Attribute doesn't have archive
de: Attribut hat kein Archiv
uk: Атрибут не має архіву

source: Too big string length (> 130 MB)!
de: Sehr große Größe der Zeichenfolge (> 130 MB)!
uk: Дуже великий розмір рядка (> 130 MB)!

source: Memory alloc for big string length (%d) error!
de: Fehler Zuweisung von Speicher für eine Reihe von Großformat (%d)!
uk: Помилка виділення пам'яті для рядка великого розміру (%d)!

source: Double disconnection try: %d.
de: Ein Versuch, verdoppeln sich aus: %d.
uk: Спроба подвійного від'єднання: %d.

source: Deletion child '%d' error.
de: Fehler beim Löschen des Nachkommens IO %d.
uk: Помилка видалення нащадку '%d'.

source: Child '%d' is not allow.
de: Nachkommen %d ist verboten.
uk: Нащадок '%d' не доступний.

source: Child %s:%d is not found!
de: Kind %s:%d wurde nicht gefunden!
uk: Нащадок %s:%d не знайдений!

source: 2:Open file '%s' error: %s
de: Fehler der Öffnung der Datei '%s' : %s
uk: 2:Помилка відкриття файлу '%s': %s

source: 3:Load file '%s' error.
de: 3:Datei laden '%s' Fehler.
uk: 3:Помилка завантаження файлу '%s'.

source: The object don't attached to node of OpenSCADA tree.
de: Das Objekt ist an den OpenSCADA-Baumknoten nicht angeschaltet.
uk: Об'єкт не підключено до вузла дерева OpenSCADA.

source: Child %d is not present.
de: Kind %d ist nicht vorhanden.
uk: Нащадок %d відсутній.

source: Child with attribut %s=%s is not present.
de: Kind mit dem Attribut %s=%s ist nicht vorhanden.
uk: Нащадок з атрибутом %s=%s відсутній.

source: Unexpected end. Pos: %d
de: Unerwartetes Ende. Pos: %d
uk: Неочікуваний кінець. Поз: %d

source: No comment block end. Pos: %d
de: Kein Kommentar Blockende. Pos: %d
uk: Немає завершення блоку коментаря. Поз: %d

source: Unfinished '!DOCTYPE' block. Pos: %d
de: Unvollendete '! DOCTYPE' zu blockieren. Pos: %d
uk: Незавершений блок '!DOCTYPE'. Поз: %d

source: Unfinished '!DOCTYPE [ ]' container. Pos: %d
de: Unvollendete '! DOCTYPE []' Container. Pos: %d
uk: Незавершений контейнер '!DOCTYPE [ ]'. Поз: %d

source: Unexpected or error end tag. Pos: %d
de: Unerwarteter oder Fehler End-Tag. Pos: %d
uk: Неочікуване або помилкове завершення тегу. Поз: %d

source: Unfinished start comment or unknown block. Pos: %d
de: Unfertig starten Kommentar oder unbekannte blockieren. Pos: %d
uk: Незавершений початок коментарю або невідомий блок. Поз: %d

source: Start tag error. Pos: %d
de: Start-Tag-Fehler. Pos: %d
uk: Помилка початку тегу. Поз: %d

source: Unfinished attribute. Pos: %d
de: Unfertig Attribut. Pos: %d
uk: Незавершений атрибут. Поз: %d

source: Entity error. Pos: %d
de: Entity Fehler. Pos: %d
uk: Помилка сутності. Поз: %d

source: Unknown entity '%s'. Pos: %d
de: Unbekannte Entität '%s'. Pos: %d
uk: Невідома сутність '%s'. Поз: %d

source: Message archive no support!
de: Nachrichtarchiv wird nicht unterstützt!
uk: Архів повідомлень не підтримується!

source: Value archive no support!
de: Wertearchiv wird nicht unterstützt!
uk: Архів значень не підтримується!

source: Function '%s' no support!
de: Funktion '%s' wird nicht unterstützt!
uk: Функція '%s' не підтримується!

source: %s: No function set!
de: %s: Keine Funktion gesetzt!
uk: %s: Функцію не встановлено!
