Repository: alimon/oscada
Catalog: src/po/*.po
Languages: de, uk

source: Error open semaphore!
de: Fehler beim Öffnen des Semaphors!
uk: Помилка відкриття семафору!

source: Resource is try deadlock a thread!
de: Die Ressource versucht den toten Block in den Strom einzusetzen
uk: Ресурс намагається намертво заблокувати нитку!

source: Resource is timeouted!
de: Wartezeit der Ressource ist aus
uk: Час очікування ресурсу вичерпано!

source: Module(plugin) name
de: Name des Moduls (plugin)
uk: Ім'я модуля(плагіна)

source: Name
uk: Ім'я

source: Description
de: Beschreibung
uk: Опис

source: To start
de: Starten
uk: Запускати

source: Messages categories
de: Nachrichtenkategorien
uk: Категорії повідомлень

source: Messages level
de: Nachrichtenstufe
uk: Рівень повідомлень

source: Debug (0);Information (1);Notice (2);Warning (3);Error (4);Critical (5);Alert (6);Emergency (7)
de: Debuggen (0);Information (1);Bemerkung (2);Warnung (3);Fehler (4);Kritisch (5);Wach (6);Notfall (7)
uk: Отладка (0);Інформація (1);Зауваження (2);Попередження (3);Помилка (4);Критично (5);Тривога (6);Аварія (7)

source: Address
de: Adresse
uk: Адреса

source: Value period (sec)
de: Wiederholung des Werts (sek)
uk: Період значень (сек)

source: Period archiving (sec)
de: Zeitintervall für die Archivierung (Sek)
uk: Період архівування (сек)

source: Selection priority
de: Auswahl Priorität
uk: Пріоритет обрання

source: Source mode
de: Quellenmodus
uk: Режим джерела

source: Passive;Passive param. attribute;Active param. attribute
de: Passiv;Passives Parameterattribut;Aktives Parameterattribut
uk: Пасивний;Пасивний атрибут параметру;Активний атрибут параметру

source: Source
de: Quelle
uk: Джерело

source: Data combining mode
de: Modus der Assoziation Daten
uk: Режим поєднання даних

source: Moving average;Single;Minimum;Maximum
de: Gleitender Durchschnitt;Einer;Minimum;Maximum
uk: Ковзне середне;Один;Мінімум;Максимум

source: Value type
de: Datentyp der Werte
uk: Тип значення

source: Boolean;Integer;Real;String;Int16;Int32;Int64;Real(Float);Real(Double)
de: Logisch;Ganzzahl;Reelle Zahl;Linie;Ganzzahl16;Ganzzahl32;Ganzzahl64;Reelle(Float);Reelle(Double)
uk: Логічне;Ціле;Реальне;Рядок;Ціле16;Ціле32;Ціле64;Реальне(Float);Реальне(Double)

source: Buffer period (sec)
de: Zeitintervall für Speicherung (Sek)
uk: Період буфера (сек)

source: Buffer size (items)
de: Speichergrösse (Einheiten)
uk: Розмір буферу (одиниць)

source: Buffer in hard time grid
de: Raster der Pufferzeit
uk: Жорстка сітка часу буфера

source: Buffer in high time resolution
de: Auflösung Pufferzeit
uk: Висока роздільна здатність часу буфера

source: Process into archivators
de: Bearbeitung mit Archivaren
uk: Обслуговувати у архіваторах

source: Message archivators load error.
de: Fehler beim Laden des Nachrichtarchivars.
uk: Помилка завантаження архіваторів повідомлень.

source: Value archivators load error.
de: Fehler beim Laden des Wertearchivars.
uk: Помилка завантаження архіваторів значень.

source: Value archives load error.
de: Fehler beim Laden des Wertearchivs.
uk: Помилка завантаження архівів значень.

source: ======================== Subsystem "Archives" options =================== ------------ Parameters of section '%s' in config-file ----------- MessBufSize <items> Messages buffer size. MessPeriod <sec> Message archiving period. ValPeriod <msec> Values archiving period. ValPriority <level> Values task priority level. MaxReqMess <items> Maximum request messages. MaxReqVals <items> Maximum request values.
de: ==================== Optionen des Subsystems "Archive" ====================== ---------- Parameter des Abschnitts '%s' in der Konfigurationsdatei -------- MessBufSize <items> Größe des Nachrichtenspeichers. MessPeriod <sec> Zeitperiode für Archivierung der Nachrichten. ValPeriod <msec> Zeitperiode für Archivierung der Werte. ValPriority <level> Prioritätsstufe der Werte. MaxReqMess <items> Maximale Anzahl der Nachrichten. MaxReqVals <items> Maximale Anzahl der Werte.
uk: ====================== Опції підсистеми "Архіви" ======================== ------------ Параметри секції '%s' у конфігураційному файлі ----------- MessBufSize <од.> Розмір буферу повідомлень. MessPeriod <сек> Період архівації повідомлень. ValPeriod <мсек> Період архівації значень. ValPriority <рівень> Рівень пріоритету задачі значень. MaxReqMess <од.> Максимальна кількість запитаних повідомлень. MaxReqVals <од.> Максимальна кількість запитаних значень.

source: Start/update subsystem.
de: Subsystems starten/aktualisierung.
uk: Запуск/оновлення підсистеми.

source: Message archivator '%s' start error.
de: Fehler beim Starten des Nachrichtarchivars '%s'.
uk: Помилка запуску архіватору повідомлень '%s'.

source: Value archivator '%s' start error.
de: Fehler beim Starten des Wertearchivars '%s'.
uk: Помилка запуску архіватору значень '%s'.

source: Value archive '%s' start error.
de: Fehler beim Starten des Wertearchivs '%s'.
uk: Помилка запуску архіву значень '%s'.

source: Stop subsystem.
de: Subsystem anhalten.
uk: Зупинка підсистеми.

source: Value archivator '%s' stop error.
de: Fehler beim Anhalten des Wertearchivars '%s'.
uk: Помилка зупинки архіватору значень '%s'.

source: Message archivator '%s' stop error.
de: Fehler beim Anhalten des Nachrichtarchivars '%s'.
uk: Помилка зупинки архіватору повідомлень '%s'.

source: Value archive '%s' stop error.
de: Fehler beim Anhalten des Wertearchivs '%s'.
uk: Помилка зупинки архіву значень '%s'.

source: Message buffer process error.
de: Meldepuffer Prozessfehler.
uk: Помилка опрацювання буферу повідомлень.

source: Value archive
de: Wertearchiv
uk: Архів значень

source: Messages archive
de: Nachrichtarchiv
uk: Архів повідомлень

source: Messages buffer size
de: Größe des Nachrichtenspeichers
uk: Розмір буферу повідомлень

source: Archiving period (s)
de: Archivierungsperiode (Sek.)
uk: Період архівації (с)

source: View messages
de: Ansicht der Nachrichten
uk: Перегляд повідомлень

source: Time
de: Zeit
uk: Час

source: Size (s)
de: Größe (s)
uk: Розмір (сек)

source: Category pattern
de: Kategoriemuster
uk: Шаблон категорії

source: Messages category template or regular expression. Use template symbols for group selection: '*' - any substring; '?' - any symbol. Regular expression enclosed in symbols '/' (/mod_(System|LogicLev)/).
de: Nachrichten Kategorie Vorlage oder einem regul.ren Ausdruck. Vorlage verwenden Symbole für Gruppen-Auswahl: '*' - jeder Teilstring; '?' - ein beliebiges Symbol. Regulärer Ausdruck in Symbolen umschlossen '/' (/mod_(System|LogicLev)/).
uk: Шаблон або регулярний вираз категорії повідомлень. Використовуйте символи шаблону для групового вибору: '*' - будь який підрядок; '?' - будь який символ. Регулярний вираз розташовується між символами '/' (/mod_(System|LogicLev)/).

source: Level
de: Stufe
uk: Рівень

source: Debug (0);Information (1);Notice (2);Warning (3);Error (4);Critical (5);Alert (6);Emergency (7);Information (1), ALARMS;Notice (2), ALARMS;Warning (3), ALARMS;Error (4), ALARMS;Critical (5), ALARMS;Alert (6), ALARMS;Emergency (7), ALARMS
de: Debuggen (0);Information (1);Bemerkung (2);Warnung (3);Fehler (4);Kritisch (5);Wach (6);Notfall (7);Information (1), ALARM;Bemerkung (2), ALARM;Warnung (3), ALARM;Fehler (4), ALARM;Kritisch (5), ALARM;Wach (6), ALARM;Notfall (7), ALARM
uk: Отладка (0);Інформація (1);Зауваження (2);Попередження (3);Помилка (4);Критично (5);Тривога (6);Аварія (7);Інформація (1), ПОРУШЕННЯ;Зауваження (2), ПОРУШЕННЯ;Попередження (3), ПОРУШЕННЯ;Помилка (4), ПОРУШЕННЯ;Критично (5), ПОРУШЕННЯ;Тривога (6), ПОРУШЕННЯ;Аварія (7), ПОРУШЕННЯ

source: Get messages for level more and equal it.
de: Empfang von Nachrichten für gleiche und höhere Stufe.
uk: Отримання повідомлень з рівнем більш або дорівнює вказаному.

source: Archivator
de: Archivar
uk: Архіватор

source: Messages archivator. No set archivator for process by buffer and all archivators. Set '<buffer>' for process by buffer.
de: Nachrichtenarchivator. Zeigen Sie nicht den Archivar für die Bearbeitung der Anfrage vom Puffer und von allen Archivatoren. Installieren Sie '<buffer>' für die Bearbeitung der Anfrage vom Puffer.
uk: Архіватор повідомлень. Не встановлюйте поле для обробки запиту буфером та всіма архіваторами. Встановіть '<buffer>' для обробки запиту буфером.

source: Messages
de: Nachrichten
uk: Повідомлення

source: mcsec
de: mks
uk: мкс

source: Category
de: Kategorie
uk: Категорія

source: Lev.
de: St.
uk: Рів.

source: Message
de: Nachricht
uk: Повідомлення

source: Value archives
de: Wertearchive
uk: Архіви значень

source: Get data period (ms)
de: Zeitintervall für Datenempfang (ms)
uk: Період отримання даних (мс)

source: Get data task priority level
de: Prioritätsstufe Datenempfanges
uk: Рівень пріоритету задачі отримання даних

source: Number
de: Anzahl
uk: Кількість

source: All: %d; Enabled: %d
de: Insgesamt: %d; Eingeschaltet: %d
uk: Всього: %d; Включено: %d

source: Archivators
de: Archivar
uk: Архіватори

source: Message archivator
de: Nachrichtarchivar
uk: Архіватор повідомлень

source: Value archivator
de: Wertearchivar
uk: Архіватор значень

source: Message archivators
de: Nachrichtarchivare
uk: Архіватори повідомлень

source: Value archivators
de: Wertearchivare
uk: Архіватори значень

source: Message archivator:
de: Nachtrichtarchivar:
uk: Архіватор повідомлень:

source: State
de: Zustand
uk: Стан

source: Running
de: Aktiv
uk: Виконується

source: Archivator DB
de: Archivar Datenbank
uk: БД архіватору

source: End
de: Ende
uk: Кінець

source: Begin
de: Beginn
uk: Початок

source: Configuration
de: Konfiguration
uk: Конфігурація

source: Messages category template or regular expression to processing by archivator, separated by symbol ';'. Use template symbols for group selection: '*' - any substring; '?' - any symbol. Regular expression enclosed in symbols '/' (/mod_(System|LogicLev)/).
de: Nachrichten Kategorie Vorlage oder einem regulären Ausdruck auf die Verarbeitung von Archivar von Symbol getrennt ';'. Vorlage verwenden Symbole für Gruppen-Auswahl: '*' - jeweilige Subzeile; '?' - jeweiliges Symbol. Regulärer Ausdruck in Symbolen umschlossen '/' (/mod_(System|LogicLev)/).
uk: Шаблон або регулярний вираз категорії повідомлень для обробки архіватором, поділені символом ';'. Використовуйте символи шаблону для групової вибірки: '*' - будь який підрядок; '?' - будь який символ. Регулярний вираз розташовується між символами '/' (/mod_(System|LogicLev)/).

source: Value is not present.
de: Der Wert ist nicht vorhanden.
uk: Значення відсутнє.

source: Grid mode doesn't support inserting too old values %lld (%lld-%lld).
de: Gittermodus unterstützt nicht das Einfügen sehr alter Werte %lld (%lld-%lld).
uk: Не підтримується вставка дуже старих повідомлень у режимі прив'язки до сітки %lld (%lld-%lld).

source: Grid mode doesn't support inserting old values.
de: Gittermodus unterstützt nicht das Einfügen alter Werte.
uk: Не підтримується вставка старих повідомлень у режимі прив'язки до сітки.

source: Set too old value to buffer.
de: Einfügen von sehr alten Werten in den Speicher.
uk: Вставка дуже старого значення до буфера.

source: Connect to source '%s' error.
de: Fehler beim Verbinden mit der Quelle '%s'.
uk: Помилка підключення до джерела '%s'.

source: The archive '%s' was already connected to target parameter '%s'.
de: Archiv '%s' ist bereits auf die Zielparameter '%s' verbunden.
uk: Архів '%s' вже підключено до цільового параметру '%s'.

source: Archivator '%s' error or it is not started.
de: Archivar '%s' Fehler oder Archivar ist nicht gestartet.
uk: Помилка архіватору '%s' або його не запущено.

source: gdImageStringFT for font '%s' error: %s.
de: Der Fehler gdImageStringFT für die Schrift '%s': %s.
uk: Помилка gdImageStringFT для шрифту '%s': %s.

source: %ds
de: %dс
uk: %dс

source: %gs
de: %gc
uk: %gс

source: %gms
de: %gмс
uk: %gмс

source: Range error
de: Fehler des Bereichs
uk: Помилкова межа

source: No support data mode '%d'
de: Dateimodus '%d' wird nicht unterstützt
uk: Режим даних '%d' не підтримується

source: Binary mode no support for string data
de: Binärer Modus für Textdaten wird nicht unterstützt
uk: Бінарний режим не підтримується для строкових даних

source: Value archive:
de: Wertearchiv:
uk: Архів значень:

source: Archive
de: Archiv
uk: Архів

source: Buffer end
de: Buffersende
uk: Кінець буферу

source: Buffer begin
de: Buffersbeginn
uk: Початок буферу

source: Archive DB
de: Archiv Datenbank
uk: БД архіву

source: Start
de: Starten
uk: Запущено

source: Process
de: Bearbeitung
uk: Обробка

source: Period (s)
de: Intervall (sek)
uk: Період (с)

source: Values
de: Werte
uk: Значення

source: Microseconds
de: Mikrosekunden
uk: Мікросекунди

source: Values archivator. No set archivator for process by buffer and all archivators. Set '<buffer>' for process by buffer.
de: Wertearchivator. Bezeichnen Sie nicht den Archivar für die Bearbeitung der Anfrage vom Puffer und von allen Archivers. Installieren Sie '<buffer>' für die Bearbeitung der Anfrage vom Puffer.
uk: Архіватор значень. Не встановлюйте поле для обробки запиту буфером та всіма архіваторами. Встановіть '<buffer>' для обробки запиту буфером.

source: Show trend
de: Trend zeigen
uk: Показати графік

source: Values table
de: Tabelle der Werte
uk: Таблиця значень

source: Value
de: Wert
uk: Значення

source: Picture size
de: Größe des Bildes
uk: Розмір зображення

source: Picture width in pixels.
de: Bildbreite in Pixeln.
uk: Ширина зображення у пікселях.

source: Picture height in pixels.
de: Bildhöhe in Pixeln.
uk: Висота зображення у пікселях.

source: Value scale
de: Bereich der Werte
uk: Шкала значення

source: Picture minimum value.
de: Der minimale Wert des Bildes.
uk: Мінімальне значення зображення.

source: Picture maximum value.
de: Der maximale Wert des Bildes.
uk: Максимальне значення зображення.

source: Values trend
de: Verlauf der Werte
uk: Графік значень

source: Value archivator:
de: Wertearchivar:
uk: Архіватор значень:

source: Archiving time
de: Archivierungszeit
uk: Час архівації

source: Set zero period for disable using the archiver for buffer processing, only for direct write.
de: Nullpunktperiode für Behinderte mit dem Archivierungs für Puffer-Verarbeitung, nur für den direkten Schreib.
uk: Встановити нульовий період для відключення використання архіватору у обробці буферу, тільки прямий запис.

source: Selection the archiver priority for "All" sources using mode. Set to zero for full the selection disable.
de: Auswahl der Archivierungs Priorität für "Alle" mit Quellen-Modus. Auf Null einstellen für Voll der Auswahl deaktivieren.
uk: Пріоритет обрання архіватору для режиму використання джерела "Всі". Встановити у нуль для повного виключення із обрання.

source: Archives
de: Aufzeichnungen
uk: Архіви

source: Buffer size
de: Speichergrösse
uk: Розмір буферу

source: Data Bases
de: Datenbank
uk: Бази даних

source: Value ID
de: ID des Werts
uk: ID значення

source: DB type (module)
de: Typ der Datenbank (Modul)
uk: Тип БД (модуль)

source: Code page
de: Unicode Zeichensatz
uk: Кодова сторінка

source: To enable
de: Aktivieren
uk: Вмикати

source: Close DB '%s' error!
de: Fehler beim Schliessen der Datenbank '%s'!
uk: Помилка закриття БД '%s'!

source: Requested row no present.
de: Angeforderte Zeile nicht vorhanden.
uk: Запитаний запис відсутній.

source: Write row to DB or config file error.
de: Schreiben Reihe zum DB-oder Konfigurationsfehler.
uk: Помилка запису до БД або конфігураційного файлу.

source: ========================= Subsystem "DB" options ======================== ----------- The config-file station '%s' parameters ----------- SYSStPref <1> Use station id prefix into generic (SYS) table.
de: ========================= Optionen des Subsystems"DB" ========================= -------------- Parameter der Station '%s' in der Konfigurationsdatei ------------ SYSStPref <1> Den Bezeichner der Station in der gemeinsamen (SYS) Tabelle benutzen.
uk: ========================= Опції підсистеми "БД" ========================= ------ Параметри станції '%s' у конфігураційному файлі -------- SYSStPref <1> Використовувати ідентифікатор станції у загальній (SYS) таблиці.

source: Search and open new DB error.
de: Fehler beim Suchen und Öffnen einer neuen Datenbank.
uk: Помилка пошуку та відкриття нової БД.

source: DB
de: Datenbank
uk: БД

source: Full DB delete
de: Endgültiges Löschen der Datenbank
uk: Повне видалення БД

source: Select for full deletion DB on DB close. Else DB will be simply closed.
de: Auswahl für das endgültige Löschen der Datenbank beim Schliessen, andernfalls wird die Datenbank einfach geschlossen.
uk: Обрати для повного видалення БД під час закриття. Інакше БД буде просто закрито.

source: Data base:
de: Datenbank:
uk: База даних:

source: Opened table
de: Geöffnete Tabelle
uk: Відкриті таблиці

source: Data base
de: Datenbank
uk: База даних

source: Enable
de: Einschalten
uk: Ввімкнено

source: Accessible tables
de: Verfügbare Tabellen
uk: Наявні таблиці

source: Tables which are in the DB, tables which are not opened at that moment.
de: Tabellen sind in der Datenbank aber nicht geöffnet.
uk: Таблиці у БД, але не відкриті на цей час.

source: Load system from this DB
de: System aus der Datenbank laden
uk: Завантажити систему з цієї БД

source: Codepage of data into DB. For example: UTF-8, KOI8-R, KOI8-U ... .
de: Unicode Zeichensatz in der Datenbank, zum Beispiel: UTF-8, KOI8-R, KOI8-U ... .
uk: Кодування даних у БД. Наприклад: UTF-8, KOI8-R, KOI8-U ... .

source: Tables
de: Tabellen
uk: Таблиці

source: Opened tables
de: Geöffnete Tabellen
uk: Відкриті таблиці

source: Opened table list. Adding and deleting tables operations are really open and close tables operations.
de: Liste von geöffneten Tabellen. Hinzufügen und Löschen von Tabellen entspricht Öffnen und Schliessen von Tabellen.
uk: Перелік відкритих таблиць. Операції додання та видалення таблиць на справді становлять операції відкриття та закриття таблиць.

source: Request
de: Anfrage
uk: Запит

source: Transaction
de: Eingangsübertragung
uk: Транзакція

source: Out;Into;No matter
de: Außerhalb;Innerhalb;Ganz gleich
uk: Зовні;В середині;Немає значення

source: Send
de: Absenden
uk: Надіслати

source: Result
de: Ergebnis
uk: Результат

source: Table:
de: Tabelle:
uk: Таблиця:

source: Table
de: Tabelle
uk: Таблиця

source: Table offset
de: Offset-Tabelle
uk: Зміщення таблиці

source: Data
de: Daten
uk: Дані

source: Field id = %s(%s) no present!
de: Feld id = %s(%s) ist nicht vorhanden!
uk: Поле id = %s(%s) відсутнє!

source: %s:%s:> Control element '%s' error!
de: %s:%s:> Fehler des Kontrollelements '%s'!
uk: %s:%s:> Помилка елементу керування '%s'.

source: Node already in process!
de: Knoten wird bearbeitet!
uk: Вузол вже обробляється!

source: Waiting for freeing by %d users!
de: Warten auf Freigabe von %d Benutzern!
uk: Очікування звільнення %d користувачами!

source: Timeouted of wait. Object is used by %d users. Free object first!
de: Zeitüberschreitung ist aufgetreten. Objekt wird von %d Benutzern verwendet.Zuerst Objekt freigeben!
uk: Перевищено час очікування. Об'єкт використовується %d користувачами. Звільніть об'єкт спочатку!

source: Blocking node error. Inform developers please!
de: Fehler beim Blockierung des Knotens. Informieren Sie die Entwickler!
uk: Помилка блокування вузлу. Інформуйте будь ласка розробників!

source: Node disable error. Restore node enabling.
de: Fehler beim Abschaltens des Knotens. Wiederherstellung des Einschaltens des Knotens.
uk: Помилка вимкнення вузлу. Відновлення увімкнення вузлу.

source: Node is disabled!
de: Der Knoten ist abgeschaltet!
uk: Вузол вимкнено!

source: Node '%s' no present!
de: Der Knoten '%s' ist nicht vorhanden!
uk: Вузол '%s' відсутній!

source: Copy from '%s' to '%s' is impossible
de: Kopieren von '%s' nach '%s' ist nicht zulässig.
uk: Копіювання з '%s' до '%s' неможливе

source: Destination node doesn't have branches.
de: Der Zielknoten hat keine Verzweigung.
uk: Цільовий вузол не має гілок.

source: Destination node doesn't have necessary branche.
de: Der Zielknoten hat keine erforderliche Verzweigung.
uk: Цільовий вузол не має потрібної гілки.

source: Branch group '%d' error.
de: Fehler der Branchengruppe '%d'.
uk: Помилка групи гілок '%d'.

source: Group of childs %d error!
de: Gruppe der Kinder %d Fehler!
uk: Помилка групи нащадків %d!

source: Node is not enabled!
de: Knoten ist nicht eingeschaltet!
uk: Вузол не увімкнено!

source: Add child id is empty!
de: Der hinzugefügte Kindbezeichner ist leer!
uk: Id нащадку, який додається, порожнє!

source: Node '%s' is already present.
de: Der Knoten '%s' ist schon vorhanden.
uk: Вузол '%s' вже присутній.

source: Node is begin processed now!
de: Knoten wird jetzt bearbeitet!
uk: Вузол оброблюється зараз!

source: Child '%s' is not present!
de: Kindknoten '%s' fehlt!
uk: Нащадок '%s' відсутній!

source: Node is the root or is not connected!
de: Knoten ist 'root' oder nicht verbunden!
uk: Вузол кореневий або не підключений!

source: Element '%s' is not present or disabled!
de: Element '%s' ist nicht vorhanden oder abgeschaltet!
uk: Елемент '%s' відсутній або вимкнений!

source: Too more users for node!!!
de: Zu viele Benutzer für Knoten!!!
uk: Дуже багато користувачів у вузла!!!

source: Function '%s' error or not enough parameters.
de: Fehler in der Funktion '%s' oder nicht genug Parameter.
uk: Помилка функції '%s' або недостатньо параметрів для неї.

source: Some tags on path '%s' are missed!
de: Einige Namen im Pfad '%s' sind falsch!
uk: Деякі теги у шляху '%s' помилкові!

source: Error access to element '%s'!
de: Fehler beim Zugriff auf das Element '%s'!
uk: Помилка доступу до елементу '%s'!

source: Element '%s' warning! %s
de: Element '%s' Warnung! %s
uk: Попередження елементу '%s'! %s

source: Node: %s
de: Knoten: %s
uk: Вузол: %s

source: Load error: %s
de: Lastfehler: %s
uk: Помилка завантаження: %s

source: Save error: %s
de: Fehler speichern %s
uk: Помилка збереження: %s

source: [TableName]
de: [Tabellenname]
uk: [Ім'яТаблиці]

source: Attribute '%s' is not present!
de: Attribut '%s' ist nicht vorhanden!
uk: Атрибут '%s' відсутній!

source: Element type is not string!
de: Elemententyp ist nicht Text!
uk: Тип елементу не рядок!

source: Element type is not real!
de: Elemententyp ist nicht Reelle Zahl!
uk: Тип елементу не реальний!

source: Element type is not int!
de: Elemententyp ist nicht Ganzzahl!
uk: Тип елементу не цілий!

source: Element type is not Boolean!
de: Elemententyp ist nicht Logisch!
uk: Тип елементу не логічний!

source: Element type is not selected!
de: Elemententyp ist nicht ausgewählt!
uk: Тип елементу не вибірковий!

source: Started.
de: Gestartet.
uk: Запущено.

source: Getting data from remote station:
de: Datenempfang von der entfernten Station
uk: Отримання даних з віддаленої станції:

source: Your redundancy configuration wrong and controller often enable-disable redundancy!
de: Ihre Redundanzkonfiguration falsch und Steuerung oft enable-deaktivieren Redundanz!
uk: Ваші налаштування резервування некоректні та контролер часто включає-виключає резервування!

source: Enabled.
de: Eingeschaltet
uk: Включено.

source: Disabled.
de: Abgeschaltet
uk: Виключено.

source: Load controller's configurations!
de: Konfiguration des Kontrollers laden!
uk: Завантаження конфігурації контролера!

source: Save controller's configurations!
de: Speichern der Kontrollerkonfiguration!
uk: Збереження конфігурації контролера!

source: Start controller!
de: Controller starten!
uk: Запуск контролера!

source: Stop controller!
de: Controller anhalten!
uk: Зупинка контролера!

source: Enable controller!
de: Controller einschalten!
uk: Ввімкнення контролера!

source: Enable parameter '%s' error.
de: Fehler beim Einschalten des Parameters '%s'.
uk: Помилка ввімкнення параметру '%s'.

source: Some parameters enable error.
de: Fehler beim Starten einiger Parameter.
uk: Помилка включення деяких параметрів.
