Repository: alimon/oscada
Catalog: src/po/*.po
Languages: de, uk

source: %s: Id or IO %d error for function '%s'!
de: %s: Fehler des Bezeichners oder IO %d für die Funktion %s'!
uk: %s: Помилка ідентифікатору або IO %d для функції '%s'!

source: Open Supervisory Control And Data Acquisition
de: Offenes System der Datenüberwachung und Datenerfassung
uk: Відкрита система диспетчерського контролю та збору даних

source: Roman Savochenko
de: Roman Savotschenko
uk: Роман Савоченко

source: Input transport no support!
de: Eingangsübertragung wird nicht unterstützt!
uk: Вхідні транспорти не підтримуються!

source: Output transport no support!
de: Ausgangsübertragung wird nicht unterstüzt!
uk: Вихідні транспорти не підтримуються!

source: New project
de: Neues Projekt
uk: Новий проект

source: User directory copy projects
de: Benutzer-Verzeichnis kopieren Projekte
uk: Проекти копій користув. теки

source: Pre-installed projects
de: Vorinstallierte Projekte
uk: Передвстановлені проекти

source: Select project for start.
de: Wählen Sie Projekt für den Start.
uk: Оберіть проект для запуску.

source: OpenSCADA start
uk: Запуск OpenSCADA

source: Enter new project ID. Do not use spaces!
de: Geben Sie das neue Projekt ID. Verwenden Sie keine Leerzeichen!
uk: Введіть ID нового проекту. Не використовуйте простори!

source: No a project set!
de: Nein ein Projekt einstellen!
uk: Жодного проекту не встановлено!

source: Set the project name to:
de: Stellen Sie den Namen des Projekts an:
uk: Встановлено назву проекту у:
