Repository: alimon/oscada
Catalog: src/moduls/daq/System/po/*.po
Languages: de

source: Load (%)
de: Auslastung (%)

source: User (%)
de: Benutzer (%)

source: Idle (%)
de: Idletime (%)

source: General
de: Im allgemein

source: Full CPU Load
de: Auslastung des Prozessors

source: CPU Load :
de: Auslastung des Prozessors:

source: Read (Kb)
de: Gelesen (Kb)

source: Write (Kb)
de: Geschrieben (Kb)

source: Disk(part)
de: Disk(Teil)

source: HD statistic:
de: HD-Statistik:

source: Measure unit
de: Masseinheit

source: Temperature
de: Temperatur

source: HD temperature:
de: HD-Temperatur:

source: Free (kB)
de: Frei (kB)

source: Use (kB)
de: Benutzung (kB)

source: Buffers (kB)
de: Puffer (kB)

source: Swap free (kB)
de: Swap frei (kB)

source: Swap use (kB)
de: Swap benutzt (kB)

source: Memory info
de: Speicherinformation

source: Receive (Kb)
de: Empfangen (Kb)

source: Transmit (Kb)
de: Uebermitteln (Кб)

source: Interface
de: Schnittstelle

source: Interface statistic:
de: Schnittstellenstatistik:

source: Data sensors
de: Datesensoren

source: Full seconds
de: Volle Sekunden

source: Seconds
de: Sekunden

source: Minutes
de: Minuten

source: Hours
de: Stunden

source: Days
de: Tage

source: System up time
de: Betriebszeit des Systems

source: Station up time
de: Betriebszeit der Station

source: System DA
de: Systemdatenerfassung

source: Roman Savochenko
de: Roman Savotschenko

source: Allow operation system data acquisition. Support OS Linux data sources: HDDTemp, Sensors, Uptime, Memory, CPU and other.
de: Ermöglicht die Datenerfassung des Betriebssystems. Unterstützt werden die ОС Linux Datenquellen: HDDTemp, Sensors, Uptime, Memory, CPU und andere.

source: Auto create active DA
de: Automatisches Erstellen ist aktiv - DA

source: System parameteres table
de: Tabelle der Systemparameter

source: Request data period (ms)
de: Datenanfrageperiode (msek)

source: Request task priority
de: Priorität der Anfrage

source: System part
de: Systemteil

source: Get data %.6g ms.
de: Datenempfang %.6g msek.

source: 2:Controller stoped
de: 2:Kontroller ist angehalten

source: 1:Parameter disabled
de: 1:Parameter ist abgeschaltet

source: CPU
de: Prozessor

source: HDD statistic
de: HDD Statistik

source: HDD temperature
de: HDD Temperatur

source: Memory
de: Speicher

source: Net statistic
de: Netzstatistik

source: Sensors
de: Sensoren

source: Up time
de: Betriebszeit
