Repository: alimon/oscada
Catalog: src/moduls/protocol/SelfSystem/po/*.po
Languages: de, ru, uk

source: Self protocol of OpenSCADA
ru: Собственный протокол OpenSCADA
uk: Власний протокол OpenSCADA

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Provides self OpenSCADA protocol based at XML and one's control interface.
ru: Предоставляет cобственный протокол основанный на XML и интерфейсе управления OpenSCADA.
uk: Надає власний протокол заснований на XML та інтерфейсі керування OpenSCADA.

source: Connections from the user '%s' and the source '%s' reached to limit %d. Erasing spare!
de: Verbindung vom Benutzer '%s' und die Quelle '%s' erreichte auf %d begrenzen. Erasing Überschuss!
ru: Подключения от пользователя '%s' и источника '%s' достигли лимита %d. Удаление лишних!
uk: Підключення від користувача '%s' та джерела '%s' досягли ліміту %d. Видалення зайвих!

source: SES_OPEN request: %d
de: SES_OPEN Antrag: %d
ru: SES_OPEN запрос: %d
uk: SES_OPEN запит: %d

source: Not full respond.
de: Partielles Ansprechen.
ru: Неполный ответ.
uk: Неповна відповідь.

source: SES_OPEN response: %d
de: SES_OPEN Antwort: %d
ru: SES_OPEN ответ: %d
uk: SES_OPEN відповідь: %d

source: Station '%s' error: %s!
de: Station '%s' Fehler: %s!
ru: Станция '%s' ошибка: %s!
uk: Помилка станції '%s': %s!

source: Station '%s' error: Respond format error!
de: Station '%s' Fehler: Antwort ist falsch!
ru: Ошибка станции '%s': Ответ не корректен!
uk: Помилка станції '%s': Відповідь помилкова!

source: REQ send: %d
de: REQ senden: %d
ru: REQ отправка: %d
uk: REQ надсилання: %d

source: REQ response first %d
de: REQ Antwort zuerst %d
ru: REQ первый ответ %d
uk: REQ перша відповідь %d

source: Station respond '%s' error!
de: Station antwortet mit '%s' Fehler!
ru: Ошибка ответа станции '%s'!
uk: Помилка відповіді станції '%s'!

source: REQ response full %d
de: REQ Antwort voll %d
ru: REQ весь ответ %d
uk: REQ повна відповідь %d

source: Request error: %s
de: Anforderungsfehler: %s
ru: Ошибка запроса: %s
uk: Помилка запиту: %s

source: Parameters
de: Optionen
ru: Параметры
uk: Параметри

source: State
de: Zustand
ru: Статус
uk: Стан

source: Active authentication sessions
de: Aktive Authentifizierung Sitzungen
ru: Активные сеансы аутентификации
uk: Активні сеанси аутентифікації

source: Module options
de: Optionen des Moduls
ru: Опции модуля
uk: Опції модуля

source: Life time of auth session(min)
de: Lebensdauer der Sitzung (min)
ru: Время жизни сессии (мин)
uk: Час життя сесії аутентифікації (хвил.)

source: Single user and host connections limit
de: Single-User und Host-Verbindungen Grenze
ru: Предел подключений одного пользователя и хоста
uk: Ліміт підключень одного користувача та хоста

source: Compression level
de: Kompressionsstufe
ru: Уровень компрессии
uk: Рівень компресії

source: ZLib compression level: -1 - optimal speed-size; 0 - disable; 1-9 - direct level.
de: Kompressionsstufe ZLib: -1 - optimale Geschwindigkeit-Grösse; 0 - abgeschaltet; 1-9 - direkte Stufe.
ru: Уровень компрессии ZLib: -1 - оптимальный, скорость-размер; 0 - отключен; 1-9 - прямой уровень.
uk: Рівень компресії ZLib: -1 - оптимальна швидкість-розмір; 0 - вимкнено; 1-9 - прямий рівень.

source: Lower compression border
de: Untere Kompressionsgrenze
ru: Нижняя граница компрессии
uk: Нижня межа компресії

source: Value in bytes.
de: Wert in Bytes.
ru: Значение в байтах.
uk: Значення у байтах.

source: Get request: '%s': %d, time: %f ms.
de: Holen Antrag: '%s': %d, Zeit: %f ms.
ru: Получение запроса: '%s': %d, время: %f мс.
uk: Отримання запиту: '%s': %d, час: %f мс.

source: Check and reforward request: '%s': %d, time: %f ms.
ru: Проверка и перенаправление запроса: '%s': %d, время: %f мс.
uk: Перевірка та переспрямування запиту: '%s': %d, час: %f мс.

source: Unpack and load request: '%s': %d, time: %f ms.
de: Packen und Laden Anfrage: '%s': %d, Zeit: %f ms.
ru: Распаковка и загрузка запроса: '%s': %d, время: %f мс.
uk: Розпакування та завантаження запиту: '%s': %d, час: %f мс.

source: Process request: '%s', time: %f ms.
de: Prozess Anfrage: '%s', Zeit: %f ms.
ru: Обработка запроса: '%s', время: %f мс.
uk: Обробка запиту: '%s', час: %f мс.

source: Save respond to stream and pack: '%s': %d, time: %f ms.
de: Sparen reagieren zu Strom und zu verpacken: '%s': %d, Zeit: %f ms.
ru: Сохранение ответа в поток и упаковка: '%s': %d, время: %f мс.
uk: Збереження відповіді до потоку та пакування: '%s': %d, час: %f мс.

source: Self system OpenSCADA protocol
de: Systemprotokoll OpenSCADA

source: Provides own OpenSCADA protocol based at XML and one's control interface.
de: Bietet Selbst OpenSCADA Protokoll Basis auf XML und OpenSCADA Steuerschnittstelle.
