Repository: alimon/oscada
Catalog: src/moduls/bd/FireBird/po/*.po
Languages: ru

source: DB FireBird
ru: БД FireBird

source: Roman Savochenko
ru: Роман Савоченко

source: DB module. Provides support of the DB FireBird.
ru: Модуль БД. Предоставляет поддержку БД FireBird.

source: Drop DB '%s' error: %s
ru: Ошибка удаления БД '%s': %s

source: Create DB '%s' error: %s
ru: Ошибка создания БД '%s': %s

source: Error open table '%s'. DB is disabled.
ru: Ошибка открытия таблицы '%s'. БД отключена.

source: Start transaction error: %s
ru: Ошибка открытия транзакции: %s

source: DSQL close transaction error: %s
ru: Ошибка закрытия транзакции: %s

source: Allocate statement error: (%d)%s
ru: Ошибка размещения выражения: (%d)%s

source: Start transaction error: (%d)%s
ru: Ошибка открытия транзакции: (%d)%s

source: DSQL prepare error: (%d)%s
ru: Ошибка подготовки DSQL: (%d)%s

source: DSQL describe error: (%d)%s
ru: Ошибка описания DSQL: (%d)%s

source: Connect to DB error: %s
ru: Ошибка подключения к БД: %s

source: Request error: %s
ru: Ошибка запроса: %s

source: DSQL execute error: %s
ru: Ошибка исполнения DSQL: %s

source: DSQL free statement error: %s
ru: Ошибка освобождения выражения: %s

source: FireBird address to DB must be written as: "{file};{user};{pass}[;{conTm}]". Where: file - full path to DB file in form: "[{host}:]{filePath}"; user - DB user; pass - password of DB user; conTm- connection timeout (s).
ru: Адрес БД FireBird записывается как: "{file};{user};{pass}[;{conTm}]". Где: файл - полный путь к файлу БД в формате: "[{host}:]{filePath}"; пользователь - пользователь БД; пароль - пароль пользователя БД; conTm - таймаут подключения (с).

source: Table '%s' is not present.
ru: Таблица '%s' отсутствует.

source: Table is empty.
ru: Таблица пуста.

source: Row is not present.
ru: Запись отсутствует.
