Repository: alimon/oscada
Catalog: src/moduls/daq/SoundCard/po/*.po
Languages: uk

source: Sound card
uk: Звукова карта

source: Roman Savochenko
uk: Роман Савоченко

source: Allow access to sound card data.
uk: Надає доступ до даних звукової карти.

source: Parameters' table
uk: Таблиця параметрів

source: Card device
uk: Пристрій карти

source: Card sample rate (Hz)
uk: Частота вибірки значень (Гц)

source: Card sample type
uk: Тип вибірки карти

source: Float 32;Int 32;Int 16
uk: Реальне 32;Ціле 32;Ціле 16

source: Gather task priority
uk: Пріоритет задачі збору

source: Standard
uk: Стандарт

source: Channel
uk: Канал

source: Value
uk: Значення

source: Allowed %d input channels
uk: Наявно %d вхідних каналів

source: Gathering from %d channels. Recieved %.2f MB. Adjusted samplerate %d. Lost frames %g
uk: Збір з %d каналів. Отримано %.2f МБ. Підлаштована частота вибірки %d. Втрачено кадрів %g

source: Selected device '%s' is error or default device no allow.
uk: Помилка вибраного пристрою '%s' або пристрій по замовченню не наявний.

source: No one channel is configured for acquisition.
uk: Жодного каналу не налаштовано для збору.

source: Sample type set is error.
uk: Помилка встановлення типу вибірки.

source: Sound input stream is not stopped!
uk: Звуковий потік не зупинено!

source: CallBack: Lost frames correct: framesPerBuffer=%lu; sRt=%d; t_sz=%lld; err=%g; diff=%lld.
uk: Зворотній виклик: Корекція втрати кадрів: framesPerBuffer=%lu; sRt=%d; t_sz=%lld; err=%g; diff=%lld.

source: CallBack: Sound counter difference fix: sRt=%d; dTm=%lld.
uk: Зворотній виклик: Виправлення різниці лічильника звуку: sRt=%d; dTm=%lld.
