Repository: alimon/oscada
Catalog: src/moduls/arhiv/FSArch/po/*.po
Languages: de, ru

source: Compressing for '%s' error %d!
de: Fehler bei der Komprimierung '%s': %d!
ru: Ошибка сжатия '%s': %d!

source: Decompressing for '%s' error %d!
de: Fehler beim Entpacken '%s': %d!
ru: Ошибка распаковки '%s': %d!

source: ======================= Module <%s:%s> options ======================= --noArchLimit Disable archives limit to the file number. Use for see archives mode, not work.
de: ======================= Optionen des Moduls <%s:%s> ======================== --noArchLimit Deaktivieren Limit für die Anzahl der Dateien. Verwenden Sie den Anzeigemodus von Archiven, nicht für die Arbeit.
ru: ======================= Опции модуля <%s:%s> ============================= --noArchLimit Отключить лимит на количество файлов. Используйте для режима просмотра архивов, не для работы.

source: Check message archivator '%s' error.
de: Fehler beim Prüfen des Nachrichtnarchivars '%s'.
ru: Ошибка проверки архиватора сообщений '%s'.

source: Check value archivator '%s' error.
de: Fehler beim Prüfen des Wertearchivars '%s'.
ru: Ошибка проверки архиватора значений '%s'.

source: %s: Mess: %s: information
ru: %s: Сообщ.: %s: информация

source: Local info DB for the messages archivator '%s'. Created automatically then don't modify, save and remove it!
de: Lokaler Info-DB für den Nachrichtenarchivator '%s'. Automatisch erstellt, dann nicht ändern, speichern und entfernen!
ru: Локальная информационная БД для архиватора сообщений '%s'. Создана автоматически, следовательно не изменяйте, не сохраняйте и не удаляйте её!

source: Archive is not started!
de: Archiv ist nicht gestartet!
ru: Архив не запущен!

source: Error create new archive file '%s'!
de: Fehler beim Erstellen der Archivdatei '%s'!
ru: Не мой архивный файл '%s'

source: Can not create directory '%s'.
de: Kann das Verzeichnis '%s' nicht erstellen !
ru: Не могу создать директорию '%s'.

source: Overall size of archivator's files
de: Gesamtgröße der Archivator-Dateien
ru: Общий размер файлов архиватора

source: Archiving time
de: Archivierungszeit
ru: Время архивирования

source: Path to a directory for files of messages of the archivator.
de: Pfad zu einem Verzeichnis für Dateien von Meldungen des Archivers.
ru: Путь к директории для файлов архиватора сообщений.

source: Additional options
de: Zusätzliche Optionen
ru: Дополнительные опции

source: Files of the archive in XML
de: Dateien des Archivs in XML
ru: Файлы архивов в XML

source: Enables archiving of messages by files in XML-format, rather than plain text. Use of archiving in XML-format requires more RAM because it needs for full downloading of the file, XML-parsing and storing the content into memory at the time of use.
de: Ermöglicht die Archivierung von Nachrichten durch Dateien im XML-Format, anstatt Klartext. Die Verwendung von Archivierung im XML-Format erfordert mehr RAM, weil es für das vollständige Herunterladen der Datei benötigt wird, XML-Parsing und Speicherung der Inhalte in den Speicher zum Zeitpunkt der Nutzung.
ru: Включает архивирование сообщений в файлы XML-формата, вместо плоского текста. Использование в архивировании XML-формата требует больше оперативной памяти поскольку необходима полная загрузка файла, XML-разбор и хранение в памяти на момент использования.

source: Maximum size of archive's file (kB)
de: Maximale Größe der Archivdatei (kB)
ru: Максимальный размер файла архива (кБ)

source: Sets limit on the size of one archive file. Disabling the restriction can be performed by setting the parameter to zero.
de: Sets begrenzen die Größe einer Archivdatei. Das Deaktivieren der Beschränkung kann durchgeführt werden, indem der Parameter auf Null gesetzt wird.
ru: Устанавливает ограничение на размер одного файла архива. Отключить ограничение можно установив параметр в ноль.

source: Maximum number of the files
de: Maximale Anzahl der Dateien
ru: Максимальное количество файлов

source: Limits the maximum number for files of the archive and additional with the size of single file it determines the size of archive on disk. Completely removing this restriction can be performed by setting the parameter to zero.
de: Begrenzt die maximale Anzahl für Dateien des Archivs und zusätzlich mit der Größe der einzelnen Datei bestimmt es die Größe des Archivs auf der Festplatte. Das vollständige Entfernen dieser Beschränkung kann durchgeführt werden, indem der Parameter auf Null gesetzt wird.
ru: Ограничивает максимальное количество файлов архива и совместно с размером отдельного файла определяет размер архива на диска. Полностью снять это ограничение можно установив параметр в ноль.

source: Time size of archive's file (days)
de: Zeitgröße der Archivdatei (Tage)
ru: Размер файла по времени (дней)

source: Sets limit on the size of single archive file on time.
de: Sets begrenzen die Größe der einzelnen Archivdatei pünktlich.
ru: Устанавливает ограничение на размер одного файла архива по времени.

source: Timeout to pack files of the archive (min)
de: Timeout zum Packen von Dateien des Archivs (min)
ru: Таймаут упаковки файлов архива (мин)

source: Sets the time after which, in the absence of requests, the archive file will be packaged in a gzip archive. Set to zero for disabling the packing by gzip.
de: Stellt die Zeit ein, nach der in Abwesenheit von Anfragen die Archivdatei in einem gzip-Archiv verpackt wird. Auf Null setzen, um die Verpackung durch gzip zu deaktivieren.
ru: Устанавливает промежуток времени по истечению которого, и в случае отсутствия обращений, файлы архивов будут упаковываться в gzip архив. Установить в ноль для отключения упаковки gzip.

source: Period of the archives checking (min)
de: Zeitraum der Archivprüfung (min)
ru: Период проверки архивов (мин)

source: Sets for checking frequency of the archives for the files emergence or deletion into the directory of the archive, as well as exceeding the limits and removing for old files.
de: Sets zur Überprüfung der Häufigkeit der Archive für die Dateien Entstehung oder Löschung in das Verzeichnis des Archivs, sowie Überschreitung der Grenzen und Entfernen für alte Dateien.
ru: Устанавливает периодичность проверки архивов на предмет появления или удаления в директории файлов архивов, а также на превышение лимитов и удаление старых файлов архивов.

source: Use an info file for the packed archives
de: Verwenden Sie eine Info-Datei für die gepackten Archive
ru: Использовать инф. файл для упакованных архивов

source: Specifies whether to create a file with information about the packed archive files by gzip-archiver. When copying files of archive to another station, this info file can speed up the target station process of first run by eliminating the need to decompress by gzip-archiver in order to obtain the information.
de: Gibt an, ob eine Datei mit Informationen über die gepackten Archivdateien von gzip-archiver erstellt werden soll. Beim Kopieren von Dateien des Archivs auf eine andere Station kann diese Info-Datei den Zielstationsprozess des ersten Laufes beschleunigen, indem man die Notwendigkeit entzieht, durch gzip-archiver zu dekomprimieren, um die Informationen zu erhalten.
ru: Указывает на необходимость создания файла с информацией о запакованных gzip-архиватором файлах архива. При копировании файлов архива на другую станцию этот информационный файл позволяют ускорить процесс первого запуска целевой станции за счёт исключения необходимости распаковки gzip-архивов для целью получения информации.

source: Prevent for duplicates
de: Vermeidung von Duplikaten
ru: Предотвращать дубликаты

source: Enables checking for duplicate messages at the time of putting a message into the archive. If there is a duplicate the message does not fit into the archive. This feature some increases the recording time to archive, but in cases of placing messages in the archive by past time from external sources it allows to eliminate the duplication.
de: Ermöglicht die Überprüfung auf doppelte Nachrichten zum Zeitpunkt der Einreichung einer Nachricht in das Archiv. Wenn es ein Duplikat gibt, passt die Nachricht nicht in das Archiv. Diese Funktion erhöht die Aufzeichnungszeit zum Archivieren, aber in Fällen der Platzierung von Nachrichten in das Archiv durch vergangene Zeit aus externen Quellen ermöglicht es, die Duplizierung zu beseitigen.
ru: Включает проверку на наличие дублирующих сообщений в момент помещения сообщения в архив. При наличии дубликата сообщение не помещается в архив. Данная функция несколько повышает время записи в архив, но в случаях помещения сообщений в архив обратным числом из внешних источников позволяет исключить дублирование.

source: Mean as duplicates and prevent its for equal time, category, level
de: Mittler als Duplikate und verhindern, dass es für gleiche Zeit, Kategorie, Ebene
ru: Считать дубликатами и предотвращать с равным временем, категорией, уровнем

source: Enables checking for duplicate messages at the time of putting a message into the archive. As duplicates there mean messages which equal to time, category and level. If there is a duplicate then the new message will replace the old one into the archive. This feature mostly usable for text of messages changing in time, for alarm's state to example.
de: Ermöglicht die Überprüfung auf doppelte Nachrichten zum Zeitpunkt der Einreichung einer Nachricht in das Archiv. Als Duplikate bedeuten Meldungen, die gleich Zeit, Kategorie und Ebene sind. Wenn es ein Duplikat gibt, dann wird die neue Nachricht das alte in das Archiv ersetzen. Diese Funktion ist meist verwendbar für Text der Nachrichten, die sich in der Zeit ändern, für den Alarmzustand zum Beispiel.
ru: Включает проверку на наличие дублирующих сообщений в момент помещения сообщения в архив. Дублирующими считаются сообщения с равным временем, категорией и уровнем. Новое дублирующее сообщение заменяет в архиве старое. Данная функция в основном полезна для изменения текста записи сообщения, например, для статуса нарушения.

source: Check now for the directory of the archivator
de: Überprüfen Sie jetzt das Verzeichnis des Archivers
ru: Проверить директорию архиватора сейчас

source: The command, which allows you to immediately start for checking the archives, for example, after some manual changes into the directory of the archiver.
de: Der Befehl, mit dem Sie sofort nach der Überprüfung der Archive beginnen können, z. B. nach einigen manuellen Änderungen in das Archivverzeichnis.
ru: Команда, которая позволяет запустить проверку архивов немедленно, например, после ручного изменения в директории архиватора.

source: Files
de: Dateien
ru: Файлы

source: Name
ru: Имя

source: Begin
de: Beginn
ru: Начало

source: End
de: Ende
ru: Конец

source: Charset
de: Zeichensatz
ru: Кодировка

source: Size
de: Größe
ru: Размер

source: Pack
ru: Упак.

source: Error
de: Fehler
ru: Ошибка

source: File '%s' creation error: %s(%d).
de: Datei '%s' Schöpfung Fehler: %s(%d).
ru: Ошибка создания файла '%s': %s(%d).

source: File '%s' header error!
de: Datei '%s' Dateikopf Fehler!
ru: Ошибка в заголовке файла '%s'!

source: Archive file: '%s' is not mine.
de: Nicht meine Archivdatei '%s'.
ru: Не мой архивный файл '%s'.

source: Archive '%s' file error.
de: Archiv '%s' Dateifehler.
ru: Ошибка в файле архива '%s'.

source: Inserting message to an error Archive file!
de: Hinzufügen einer Nachricht in das Fehler-Archivdatei!
ru: Вставка сообщения в архивный файл с ошибкой!

source: Archive file '%s' isn't attached!
de: Archivdatei '%s' ist nicht verbunden!
ru: Файл архива '%s' не подключен!

source: Write to the archive file '%s' error: %s(%d)
de: Schreiben Sie in die Archivdatei '%s' Fehler: %s(%d)
ru: Ошибка записи в файл '%s': %s(%d)

source: Getting messages from an error Archive file!
de: Empfange Nachrichten aus der Fehler-Archivdatei!
ru: Получение сообщений из архивного файла с ошибкой!

source: Archive file isn't attached!
de: Archivdatei ist nicht verbunden!
ru: Файл архива не подключен!

source: Write to '%s' error!
de: Schreiben in die Datei '%s' Fehler!
ru: Ошибка записи в файл '%s'!

source: %s: Val: %s: information
ru: %s: Знач.: %s: информация

source: Local info DB for the values archivator '%s'. Created automatically then don't modify, save and remove it!
de: Lokaler Info-DB für den Wertearchivator '%s'. Automatisch erstellt, dann nicht ändern, speichern und entfernen!
ru: Локальная информационная БД для архиватора значений '%s'. Создана автоматически, следовательно не изменяйте, не сохраняйте и не удаляйте её!

source: Unpack '%s' for information get.
de: Entpacken '%s' für weitere Informationen.
ru: Распаковка '%s' для получения информации.

source: Path to a directory for files of values of the archivator.
de: Pfad zu einem Verzeichnis für Dateien von Werten des Archivers.
ru: Путь к директории для файлов архиватора значений.

source: Time size of archive's file (hours)
de: Zeitgröße der Archivdatei (Stunden)
ru: Размер файла архива по времени (часов)

source: The parameter is set automatically when you change the values period by the archiver and generally proportional to values frequency of the archiver. Attention! Large files of the archive will be processed long by there is long unpacking for gzip-files and the primary indexing, when accessing to parts of deep in the archives of history.
de: Der Parameter wird automatisch gesetzt, wenn Sie die Werteperiode durch den Archivierer ändern und generell proportional zur Wertefrequenz des Archivers sind. Aufmerksamkeit! Große Dateien des Archivs werden lange verarbeitet, da es langsames Entpacken für gzip-Dateien und die primäre Indizierung gibt, beim Zugriff auf Teile von tief in den Archiven der Geschichte.
ru: Параметр устанавливается автоматически при смене периодичности значений архиватора и в целом пропорционален периодичности значений архиватора. Внимание! Большие файлы архива будут дольше обрабатываться в виду продолжительной распаковки gzip-файлов и первичной индексации, при доступе к участкам архива глубоко в истории.

source: Maximum number of the files to one archive
de: Maximale Anzahl der Dateien in einem Archiv
ru: Максимальное количество файлов одного архива

source: Maximum capacity for all archives (MB)
de: Maximale Kapazität für alle Archive (MB)
ru: Максимальный размер всех архивов (MB)

source: Sets limit to maximum amount of the disk space of all arhive's files of the archiver. The testing performs the periodically checking for the archives, which resulted in, on exceeding the limit, for the oldest files removing from all archives. To completely remove this restriction you can set it to value < 1.
de: Sets begrenzen den maximalen Speicherplatz aller arhive-Dateien des Archivers. Die Prüfung führt die periodische Überprüfung der Archive durch, die bei Überschreitung der Grenze für die ältesten Dateien aus allen Archiven resultierte. Um diese Einschränkung vollständig zu entfernen, kannst du sie auf den Wert <1 setzen.
ru: Устанавливает ограничение на максимально занимаемый объём дискового пространства файлами всех архивов архиватора. Проверка осуществляется с периодичностью проверки архивов, в результате которой, по превышению лимита, производится удаление самых старых файлов всех архивов. Полностью снять это ограничение можно установив параметр в значение < 1.

source: Rounding for numeric values (%)
de: Rundung für numerische Werte (%)
ru: Округление числовых значений (%)

source: Sets the percentage of boundary for values' difference of parameters into integer and real types where they are considered as identical and will be archived as a single value through the sequential packaging. Allows for well-packaging of slightly changing parameters which are outside certainty. To disable this property you can it set to zero.
de: Setzt den Prozentsatz der Grenzwerte für die Wertdifferenz der Werte in ganzzahlige und reale Typen, bei denen sie als identisch betrachtet werden und als Einzelwert durch die sequentielle Verpackung archiviert werden. Ermöglicht eine gute Verpackung von leicht wechselnden Parametern, die außerhalb der Sicherheit liegen. Um diese Eigenschaft zu deaktivieren, kannst du sie auf Null setzen.
ru: Устанавливает граничный процент различия значений параметров целого и вещественного типов при котором они считаются одинаковыми и помещаются в архив как одно значение, посредством последовательной упаковки. Позволяет хорошо упаковывать слабоменяющиеся, за пределами достоверности, параметры. Отключить данное свойство можно установив параметр в ноль.

source: Files size
de: Dateiumfang
ru: Размер файлов

source: Export
ru: Экспорт

source: Archive
de: Archiv
ru: Архив

source: Type
de: Typ
ru: Тип

source: To file
de: Zur Datei
ru: В файл

source: Period, us
de: Zeit uns
ru: Период, мкс

source: Unknown
de: Unbekannt
ru: Неизвестный

source: Boolean
ru: Логический

source: Int16
ru: Целый16

source: Int32
ru: Целый32

source: Int64
ru: Целый64

source: Float
ru: Веществ.

source: Double
ru: Двойной, вещ.

source: String
ru: Строка

source: Read parameters of the archive file '%s' error!
de: Lese Parameter der Archivdatei '%s' Fehler!
ru: Ошибка чтения параметров архивного файла '%s'!

source: Parameters of the archive file '%s' are error!
de: Archivdatei '%s' ist nicht geöffnet!
ru: Параметры архивного файла '%s' ошибочны!

source: Archive file '%s' is not opened!
ru: Файл архива '%s' не открыт!

source: Attach file '%s' error.
de: Fehler beim Verbinden der Datei '%s'.
ru: Ошибка подключения файла '%s'.

source: Archive file error!
de: Fehler in der Archivdatei!
ru: Ошибка в файле архива!

source: Warning! Allocated buffer size %d for indexes lesser for used %d.
de: Achtung! Zugeteilt Puffergröße %d für Indizes geringerem verwendet %d.
ru: Предупреждение! Выделенный размер буфера %d для индексов меньше использованого %d.

source: Write to the archive '%s' file '%s' error: %s(%d)
de: Schreiben Sie in das Archiv '%s' Datei '%s' Fehler: %s(%d)
ru: Ошибка записи в архивный '%s' файл '%s': %s(%d)

source: Read file '%s' for offset %d error!
de: Lesen Datei '%s' für Offset %d Fehler!
ru: Ошибка чтения файла '%s' для смещения %d!

source: Write to file '%s' error!
de: Schreiben in Datei '%s' Fehler!
ru: Ошибка записи в файл '%s'!

source: Error archive file structure: '%s'. Margin = %d byte. Will try fix that!
de: Fehler in der Dateistruktur: '%s'. Differenz = %d byte. Reparaturversuch!
ru: Ошибка в структуре файла: '%s'. Разница = %d байт. Попробую исправить это!

source: Error open/create archive file for copy here: %s
de: Fehler öffnen/erstellen Archivdatei für die Kopie hier: %s
ru: Ошибка открытия/создания нового файла архива для копирования: %s

source: Last value for actual archive file '%s' is not EVAL. Will try fix that!
de: Letzter Wert für die tatsächliche Archivdatei '%s' ist nicht EVAL. Reparaturversuch!
ru: Последнее значение актуального файла архива '%s' не EVAL. Попробую исправить это!

source: Arhivator on the file system
de: Arhivator auf dem Dateisystem
ru: Архиватор на файловую систему

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко

source: The archiver module. Provides functions for messages and values archiving to file system.
de: Das Archivierungsmodul. Funktionen zum Archivieren von Nachrichten und Werten in dasDateisystem
ru: Модуль архиватора. Предоставляет функции архивирования сообщений и значений на файловую систему.
