Repository: alimon/oscada
Catalog: src/moduls/daq/SNMP/po/*.po
Languages: de

source: Roman Savochenko
de: Roman Savotschenko

source: Allow realization of SNMP client service.
de: Anbindung eines Clients für das SNMP-Protokoll.

source: Parameteres table
de: Tabelle der Parameter

source: Acquisition schedule
de: Planung der Befragung

source: Gather task priority
de: Priorität der Datenerfassung

source: Remote host address
de: Adresse des entfernten Hosts

source: Retries
de: Versuche

source: Timeout (sec)
de: Zeitsperre (sec)

source: V3 parameters
de: V3 Parameter

source: Parameter's attributes limit
de: Grenze Parameter Attribute

source: OID list (next line separated)
de: OID-Liste (Trennung in neuer Zeile)

source: Call now.
de: Rufen Sie jetzt an.

source: Call by period: %s.
de: Aufruf mit einer Periode: %s.

source: Call next by cron '%s'.
de: Call nächsten durch cron '%s'.

source: Spent time: %s.
de: Verbrauchte Zeit: %s.

source: Error generating Ku from authentication pass phrase.
de: Fehler beim Generieren von Ku-Authentifizierung Passphrase.

source: Error generating Ku from privacy pass phrase.
de: Fehler beim Generieren von Ku Privatsphäre Passphrase.

source: Error SNMP session open.
de: Fehler beim Öffnen der SNMP-Sitzung.

source: SNMP agent host in IP address or domain host name. Also you can set port like "localhost:161"
de: SNMP-Agent-Host im IP-Adresse oder Domain Host-Namen. Auch Sie können Port wie "localhost:161"

source: Community group or user.
de: Gemeinschaft Gruppe oder des Benutzers.

source: Security level
de: Sicherheitsstufe

source: No auth/No privacy;Auth/No privacy;Auth/Privacy
de: Keine auth/Nein Datenschutz;Auth/Nein Datenschutz;Auth/Datenschutz

source: Privacy
de: Datenschutz

source: ASN type '%d' do not handled.
de: ASN-Typ '%d' nicht behandelt.

source: 10:Timeout: No Response from %s.
de: 10:Timeout: Keine Antwort von %s.

source: SNMP OID list, include directories for get all subitems. OID can write in the methods: ".1.3.6.1.2.1.1" - direct code addressing for object "System"; ".iso.org.dod.internet.mgmt.mib-2.system" - full symbol to direct code addressing for object "System"; "system.sysDescr.0" - simple, not full path, addressing from root alias (object "System"); "SNMPv2-MIB::sysDescr.0" - addressing from MIB base by module name for "system.sysDescr.0".
de: SNMP OID-Liste enthalten Verzeichnisse für alle Unterpunkte erhalten. OID kann in den Methoden zu schreiben: ".1.3.6.1.2.1.1" - direkte Adressierung Code für das Objekt "System"; ".iso.org.dod.internet.mgmt.mib-2.system" - Das vollständige Symbol direkte Adressierung Code für das Objekt "System"; "system.sysDescr.0" - einfache, nicht vollständigen Pfad von der Wurzel alias Adressierung (Objekt "System"); "SNMPv2-MIB::sysDescr.0" - Adressierung von MIB Basis von Modul-Name für "system.sysDescr.0".

source: MIB Tree
de: MIB-Baum

source: <<Append current>>
de: <<Anhängen aktuellen>>

source: 11:No authorized name.
de: 11:No Name zugelassen.
