Repository: alimon/oscada
Catalog: src/moduls/bd/MySQL/po/*.po
Languages: de, ru, uk

source: DB MySQL
ru: БД MySQL
uk: БД MySQL

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: BD module. Provides support of the BD MySQL.
de: Modul unterstützt die MySQL Datenbank.
ru: Модуль БД. Предоставляет поддержку БД MySQL.
uk: Модуль БД. Надає підтримку БД MySQL.

source: Error initializing client.
de: Fehler beim Initialisieren des Clients.
ru: Ошибка инициализации клиента.
uk: Помилка ініціалізації клієнта.

source: Connect to DB error: %s
de: Fehler: %s beim Verbinden mit der Datenbank
ru: Ошибка подключения к БД: %s
uk: Помилка підключення до БД: %s

source: Query to DB error: %s
de: Fehler bei der Abfrage an Datenbank: %s
ru: Ошибка запроса к БД: %s
uk: Помилка запиту до БД: %s

source: Error open table '%s'. DB is disabled.
de: Fehler beim Öffnen der Tabelle '%s'. Datenbank ist abgeschaltet.
ru: Ошибка открытия таблицы '%s'. БД отключена.
uk: Помилка відкриття таблиці '%s'. БД вимкнено.

source: Connect to DB error %d: %s
ru: Ошибка подключения к БД %d: %s
uk: Помилка підключення до БД %d: %s

source: Query '%s' is error.
de: Fehler bei der Abfrage '%s'.
ru: Ошибка запроса '%s'.
uk: Помилка запиту '%s'.

source: Query to DB error %d: %s
de: Fehler %d bei der Abfrage an Datenbank: %s
ru: Ошибка %d запроса к БД: %s
uk: Помилка %d запиту до БД: %s

source: Store result error: %s
de: Fehler beim Speichern des Ergebnisses : %s
ru: Ошибка сохранения результата: %s
uk: Помилка збереження результату: %s

source: Could not execute statement: %s
ru: Невозможно выполнить выражение: %s
uk: Неможливо виконати заяву: %s

source: MySQL DB address must be written as: "{host};{user};{pass};{db};{port}[;{u_sock}[;{names}[;{tms}]]]". Where: host - MySQL server hostname; user - DB user name; pass - user's password for DB access; db - DB name; port - DB server port (default 3306); u_sock - UNIX-socket name, for local access to DB (/var/lib/mysql/mysql.sock); names - MySQL SET NAMES charset; tms - MySQL timeouts in form "{connect},{read},{write}" and in seconds. For local DB: ";roman;123456;OpenSCADA;;/var/lib/mysql/mysql.sock;utf8;5,2,2". For remote DB: "server.nm.org;roman;123456;OpenSCADA;3306".
ru: Адрес БД MySQL записывается в виде: "{host};{user};{pass};{db};{port}[;{u_sock}[;{names}[;{tms}]]]". Где: host - имя хоста MySQL сервера; user - имя пользователя БД; pass - пароль пользователя для доступа к БД; db - имя БД; port - порт сервера БД (по умолчанию 3306); u_sock - имя UNIX-сокета, для локального доступа к БД (/var/lib/mysql/mysql.sock); names - MySQL кодировка передачи, устанавливаемая SET NAMES; tms - таймауты MySQL в формате "{connect},{read},{write}" и секундах. Для локальной БД: ";roman;123456;OpenSCADA;;/var/lib/mysql/mysql.sock;utf8;5,2,2". Для удалённой БД: "server.nm.org;roman;123456;OpenSCADA;3306".
uk: Адреса MySQL БД записується таким чином: "{host};{user};{pass};{db};{port}[;{u_sock}[;{names}[;{tms}]]]". Де: host - адреса хосту MySQL сервера; user - ім'я користувача БД; pass - пароль користувача для доступу до БД; db - ім'я БД; port - порт серверу БД (по замовченню 3306); u_sock - Ім'я UNIX-сокету, для локального доступу до БД (/var/lib/mysql/mysql.sock); names - MySQL кодування передавання даних, яка встановлюється SET NAMES; tms - таймаути MySQL у формі "{connect},{read},{write}" та секундах. Для локальної БД: ";roman;123456;OpenSCADA;;/var/lib/mysql/mysql.sock;utf8;5,2,2". Для віддаленої БД: "server.nm.org;roman;123456;OpenSCADA;3306".

source: Close opened transaction
ru: Закрыть открытую транзакцию
uk: Закрити відкриту транзакцію

source: Table is empty!
de: Tabelle ist leer!
ru: Таблица пуста!
uk: Таблиця порожня!

source: Row "%s" is not present.
ru: Запись "%s" отсутствует!
uk: Запис "%s" відсутній!

source: MySQL DB address must be written as: [<host>;<user>;<pass>;<db>;<port>;<u_sock>;<names>;<tms>]. Where: host - MySQL server hostname; user - DB user name; pass - user's password for DB access; db - DB name; port - DB server port (default 3306); u_sock - UNIX-socket name, for local access to DB (/var/lib/mysql/mysql.sock); names - MySQL SET NAMES charset; tms - MySQL timeouts in form [<connect>,<read>,<write>] and in seconds. For local DB: [;roman;123456;OpenSCADA;;/var/lib/mysql/mysql.sock;utf8;5,2,2]. For remote DB: [server.nm.org;roman;123456;OpenSCADA;3306].
de: Die Adresse der Datenbank MySQL wird geschrieben als: [<host>;<user>;<pass>;<db>;<port>;<u_sock>;<names>;<tms>]. Wo: host - Hostname des MySQL-Servers; user - Name des Datenbankbenutzers; pass - Kennwort des Datenbankbenutzers; db - Name der Datenbank; port - Port des Datenbank-Servers (Default 3306); u_sock - Name des UNIX-Sockets, für lokalen Zugriff an Datenbank (/var/lib/mysql/mysql.sock). names - MySQL SET NAMES charset; tms - MySQL-Timeouts in Form [<connect>,<read>,<write>] und in Sekunden. Für lokale Datenbank: [;roman;123456;OpenSCADA;;/var/lib/mysql/mysql.sock;utf8;5,2,2]. Für entfernte Datenbank: [server.nm.org;roman;123456;OpenSCADA;3306].

source: Row is not present!
de: Datensatz ist nicht vorhanden!
