Repository: alimon/oscada
Catalog: src/moduls/special/SystemTests/po/*.po
Languages: ru, uk

source: OpenSCADA system's tests
ru: Тесты системы OpenSCADA
uk: Тести системи OpenSCADA

source: Special
ru: Специальные
uk: Спеціальні

source: Roman Savochenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Allow the group tests for OpenSCADA system.
ru: Предоставляет группу тестов для системы OpenSCADA.
uk: Надає групу тестів для системи OpenSCADA.

source: SubType
ru: Подтип
uk: Підтип

source: ======================= The module <%s:%s> options ======================= ---------- Parameters of the module section <%s> in config file ---------- All tests main options: id test's id; on on test's flag; per repeat period (sek). *** Test's options ***
ru: ========================== Опции модуля <%s:%s> ========================== -------- Параметры модульной секции <%s> в конфигурационном файле -------- Общие опции всех тестов: id идентификатор теста; on флаг включения теста; per период повторения (сек). *** Опции тестов ***
uk: ========================== Опції модуля <%s:%s> ========================== -------- Параметри модульної секції <%s> у конфігураційному файлі -------- Загальні опції всіх тестів: id ідетифікатор тесту; on ввімкнення тесту; per період повтору (сек). *** Опції тестів ***

source: %s{%d <%s>, text <%s>, childs - %d.
ru: %s{%d <%s>, текст <%s>, потомков - %d.
uk: %s{%d <%s>, текст <%s>, нащадків - %d.

source: Attr <%s> = <%s>.
ru: Атрибут <%s> = <%s>.
uk: Атрибут <%s> = <%s>.

source: Test
ru: Тест
uk: Тест

source: Tests
ru: Тесты
uk: Тести

source: Number
ru: Количество
uk: Кількість

source: All: %d; Accessing: %d
ru: Все: %d; Доступны: %d
uk: Взагалі: %d; Доступні: %d

source: Archive
ru: Архив
uk: Архів

source: Result
ru: Результат
uk: Результат

source: Value archive
ru: Архив значений
uk: Архів значень

source: Values period (us)
ru: Период значений (мкс)
uk: Період значень (мкс)

source: Value archive allocation tests. Contain 7(8) tests for value archivator for check to correct working the consecutive pack mechanism.
ru: Тесты размещения в архиве значений. Содержит 7(8) тестов архиватора значений на проверку корректности функционирования последовательного механизма упаковки.
uk: Тест розташування у архіві значень.Містить 7(8) тестів архіватора значень на перевірку коректності функціонування послідовного механізму упакування.

source: Test: Start
ru: Тест: Запуск
uk: Тест: Запуск

source: Test1: Simple fill and check archive.
ru: Тест1: Простое заполнение и проверка ахива.
uk: Тест1: Просте заповнення та перевірка архіву.

source: Test1: Failed.
ru: Тест1: Ошибка.
uk: Тест1: Помилка.

source: Test1: Passed.
ru: Тест1: Пройден.
uk: Тест1: Виконано.

source: Test2: Internal insert double value (down).
ru: Тест2: Внутренняя вставка вещественного значения (вниз).
uk: Тест2: Внутрішня вставка реального значення (до долу).

source: Test2: Failed.
ru: Тест2: Ошибка.
uk: Тест2: Помилка.

source: Test2: Passed.
ru: Тест2: Пройден.
uk: Тест2: Виконано.

source: Test3: Internal insert double value (up).
ru: Тест3: Внутренняя вставка вещественного значения (вверх).
uk: Тест3: Внутрішня вставка реального значення (з верху).

source: Test3: Failed.
ru: Тест3: Ошибка.
uk: Тест3: Помилка.

source: Test3: Passed.
ru: Тест3: Пройден.
uk: Тест3: Виконано.

source: Test4: Internal insert double value (down).
ru: Тест4: Внутренняя вставка вещественного значения (вверх).
uk: Тест4: Внутрішня вставка реального значення (до долу).

source: Test4: Failed.
ru: Тест4: Ошибка.
uk: Тест4: Помилка.

source: Test4: Passed.
ru: Тест4: Пройден.
uk: Тест4: Виконано.

source: Test5: Internal insert no double value.
ru: Тест5: Внутренняя вставка не вещественного значения.
uk: Тест5: Внутрішня вставка не реального значення.

source: Test5: Failed.
ru: Тест5: Ошибка.
uk: Тест5: Помилка.

source: Test5: Passed.
ru: Тест5: Пройден.
uk: Тест5: Виконано.

source: Test6: Internal insert double value (up).
ru: Тест6: Внутренняя вставка вещественного значения (вверх).
uk: Тест6: Внутрішня вставка реального значення (з верху).

source: Test6: Failed.
ru: Тест6: Ошибка.
uk: Тест6: Помилка.

source: Test6: Passed.
ru: Тест6: Пройден.
uk: Тест6: Виконано.

source: Test7: Internal insert value instaead double value.
ru: Тест7: Внутренняя вставка значения вместо вещественного.
uk: Тест7: Внутрішня вставка значення замість реального значення.

source: Test7: Failed
ru: Тест7: Ошибка.
uk: Тест7: Помилка.

source: Test7: Passed.
ru: Тест7: Пройден.
uk: Тест7: Виконано.

source: Test: Passed
ru: Тест: Пройден.
uk: Тест: Виконано

source: Passed
ru: Пройден
uk: Виконано

source: Test: Failed: %s
ru: Тест: Ошибка: %s
uk: Тест: Помилка: %s

source: Failed: %s
ru: Ошибка: %s
uk: Помилка: %s

source: Base64 encoding
ru: Base64 кодирование
uk: Base64 кодування

source: Mime Base64 encoding algorithm tests.
ru: Тесты кодирования Mime Base64 алгоритмом.
uk: Тести кодування алгоритмом Mime Base64.

source: Test1: Encoding.
ru: Тест1: Кодирование.
uk: Тест1: Кодування.

source: Encoded text by length %d for time %f ms.
ru: Текст длиной %d закодировано за время %f мс.
uk: Текст довжиною %d закодовано за час %f мс.

source: Encoded text: %s
ru: Закодированный текст: %s
uk: Закодований текст: %s

source: Test2: Decoding.
ru: Тест2: Декодирование.
uk: Тест2: Декодування.

source: Decoded text by length %d for time %f ms.
ru: Текст длиной %d декодировано за время %f мс.
uk: Текст довжиною %d декодовано за час %f мс.

source: Test2: Failed. Decoding error.
ru: Тест2: Ошибка. Ошибка декодирования.
uk: Тест2: Помилка. Помилка декодування.

source: DB type
ru: Тип БД
uk: Тип БД

source: DB address
ru: Адрес БД
uk: Адреса БД

source: DB table
ru: Таблица БД
uk: Таблиця БД

source: Records number
ru: Количество записей
uk: Кількість записів

source: DB test
ru: Тест БД
uk: Тест БД

source: Full database test. Make: - make/open DB; - make/open table; - make multiply records for determined structure; - modify multiply records; - get and check values for multiply records; - modify record and table structure; - remove multiply records; - close/remove table; - close/remove DB.
ru: Полный тест БД. Выполняет: - создание/открытие БД; - создание/открытие таблицы; - создание множества записей (строк) предопределённой структуры; - модификация множества записей; - получение и проверка значений множества записей; - модификация структуры записи и таблицы; - удаление записей; - закрытие/удаление таблицы; - закрытие/удаление БД.
uk: Повний тест БД. Виконує: - створення/відкриття БД; - створення/відкриття таблиці; - створення множини записів (рядків) визначиною структурою; - модифікація множини записів; - отримання та перевірка значень множини записів; - модифікація структури запису та таблиці; - видалення записів; - закриття/видалення таблиці; - закриття/видалення БД.

source: Open DB '%s'.
ru: Открытие БД '%s'.
uk: Відкриття БД '%s'.

source: Open table '%s'.
ru: Открытие таблицы '%s'.
uk: Відкриття таблиці '%s'.

source: Connect to table '%s'.
ru: Подключение к таблице '%s'.
uk: Підключення до таблиці '%s'.

source: Create DB config.
ru: Создание конфигурации БД.
uk: Створення конфігурації БД.

source: Name field
ru: Поле имени
uk: Поле ім'я

source: Description field
ru: Поле описания
uk: Поле опису

source: Field value
ru: Поле значения
uk: Поле значення

source: Field id
ru: Поле идентификатора
uk: Поле ідентифікатору

source: Field stat
ru: Поле состояния
uk: Поле стану

source: Create records.
ru: Создание записей.
uk: Створення записів.

source: Created %d records for time %f sec.
ru: Создано %d записей в течении %f секунд.
uk: Створено %d записів за час %f сек.

source: Update records.
ru: Обновление записей.
uk: Оновлено записів.

source: Updated %d records for time %f sec.
ru: Обновлено %d записей в течении %f секунд.
uk: Оновлено %d записів за час %f сек.

source: Check records.
ru: Проверка записей.
uk: Перевірка записів.

source: Record #155='%s'; Descr='%s'; Value=%f; Id=%d; Stat=%d.
ru: Запись #155='%s'; Описание='%s'; Значение=%f; Id=%d; Состояние=%d.
uk: Запис #155='%s'; Опис='%s'; Значення=%f; Id=%d; Стан=%d.

source: Field <Sh> '%s' != '%s' error.
ru: Ошибка поля <Sh> '%s' != '%s'.
uk: Помилка поля <Sh> '%s' != '%s'.

source: Field <descr> '%s' != '%s' error.
ru: Ошибка поля <descr> '%s' != '%s'.
uk: Помилка поля <descr> '%s' != '%s'.

source: Field <id> %d != %d error.
ru: Ошибка поля <id> %d != %d.
uk: Помилка поля <id> %d != %d.

source: Field <stat> %d != %d error.
ru: Ошибка поля <stat> %d != %d.
uk: Помилка поля <stat> %d != %d.

source: Got %d records for time %f sec.
ru: Получено %d полей в течении %f секунд.
uk: Отримано %d записів за час %f сек.

source: Change DB structure.
ru: Изменение структуры БД.
uk: Зміна структури БД.

source: DB fix test
ru: Проверка исправления БД
uk: Тест виправлення БД

source: Record #2='%s'; Descr='%s'; Value=%f; Id=%d; Stat=%d.
ru: Запись #2='%s'; Описание='%s'; Значение=%f; Id=%d; Состояние=%d.
uk: Запис #2='%s'; Опис='%s'; Значення=%f; Id=%d; Стан=%d.

source: Add column error.
ru: Ошибка добавления колонки.
uk: Помилка додання стовпчика.

source: Add column ok.
ru: Колонка добавлена успешано.
uk: Вдале додання стовпчика.

source: Del column error.
ru: Ошибка удаления колонки.
uk: Помилка видалення стовпчика.

source: Del column ok.
ru: Колонка удалена успешано.
uk: Вдале видалення стовпчика.

source: Del %d records for time %f sec.
ru: Удалено %d полей в течении %f секунд.
uk: Видалено %d записів за час %f сек.

source: Close and delete table '%s'.
ru: Закрытие и удаление таблицы '%s'.
uk: Закриття та видалення таблиці '%s'.

source: Close and delete DB '%s'.
ru: Закрытие и удаление БД '%s'.
uk: Закриття та видалення БД '%s'.

source: Archivator
ru: Архиватор
uk: Архіватор

source: Messages category pattern
ru: Шаблон категории сообщения
uk: Шаблон категорії повідомлення

source: Messages depth (s)
ru: Глубина сообщения (с)
uk: Глибина повідомлень (с)

source: Messages
ru: Сообщения
uk: Повідомлення

source: Messages archive test. Periodic read new messages from archive, for selected archivator.
ru: Тест архива сообщений. Периодически вычитывает новые сообщения из архива, для указанного архиватора.
uk: Тест архіву повідомлень. Періодично вичитує нові повідомлення з архіву, для вказаного архиватору.

source: New messages present %d.
ru: Доступно %d новых сообщений.
uk: Наявно %d нових повідомлень.

source: Param
ru: Параметр
uk: Параметр

source: DAQ parameter address
ru: Адрес DAQ параметра
uk: Адреса DAQ параметру

source: DAQ parameters test. Make read a parameter's attributes and config fields.
ru: Тест DAQ параметров. Вычитывает атрибуты и конфигурационные поля параметра.
uk: Тест DAQ параметрів. Вичитує атрибути та конфігураційні поля параметру.

source: Value attrbutes present: %d
ru: Значение атрибута присутствует: %d
uk: Наявно значень атрибутів: %d

source: %s(SELECT): %s
ru: %s(ВЫБОР): %s
uk: %s(ВИБІР): %s

source: %s(STRING): %s
ru: %s(СТРОКА): %s
uk: %s(СТРОКА): %s

source: %s(INTEGER): %d
ru: %s(ЦЕЛОЕ): %d
uk: %s(ЦІЛЕ): %d

source: %s(REAL): %f
ru: %s(ВЕЩЕСТВЕННОЕ): %f
uk: %s(РЕАЛЬНЕ): %f

source: %s(BOOLEAN): %d
ru: %s(ЛОГИЧЕСКИЙ): %d
uk: %s(ЛОГІЧНЕ): %d

source: Config fields: %d
ru: Поля конфигурации: %d
uk: Полів конфігурації: %d

source: Path to module
ru: Путь к модулю
uk: Шлях до модуля

source: Mode (1-attach;-1-detach;0-change)
ru: Режим (1-подключ.;-1-отключ.;0-изменение)
uk: Режим (1-підключ.;-1-виключ.;0-змінити)

source: Full attach(to start)
ru: Полное подключение(при старте)
uk: Повне підключення (на старті)

source: Attach SO
ru: Подключение SO
uk: Підключення SO

source: Attach/detach module test.
ru: Тест подключения/отключения модулей.
uk: Тест підключення/виключення модулів.

source: Path to language element
ru: Путь к элементу языка
uk: Шлях до елементу мови

source: System control language
ru: Язык управления системой
uk: Мова контролю системи

source: System control language test. Make request to language elements by full path set. Full path to language element have view </Archive/%2fbd%2fm_per>. Full path contained two included path. First </d_Archive/> is path to the node of the control tree. Second </bd/m_per> is path to concrete node's element.
ru: Тест языка управления системой. Производит запрос элементов языка посредством полного пути. Полный путь к элементу языка имеет вид </Archive/%2fbd%2fm_per>. Полный путь состоит из двух вложенных путей. Первый </d_Archive/> это путь к узлу дерева контроля. Второй </bd/m_per> это путь к конкретному элементу узла.
uk: Тест мови контролю системи. Виконує запит елементів мови за посередництвом повного шляху. Повний шлях до елемента мови має вигляд </Archive/%2fbd%2fm_per>. Повний шлях складається з двох вкладених шляхів. Перший </d_Archive/> це шлях до вузла дерева контроля. Другий </bd/m_per> це шлях до конкретного елемента вузла.

source: SysContr test for path '%s'.
ru: Тест SysContr для пути '%s'.
uk: Тест SysContr за шляхом '%s'.

source: Address
ru: Адрес
uk: Адреса

source: Transport module
ru: Модуль транспорта
uk: Модуль транспорту

source: Request text
ru: Текст запроса
uk: Текст запиту

source: Transport
ru: Транспорт
uk: Транспорт

source: Output and/or input transports test. Make test for output transport by send the request to selected input transport.
ru: Тест выходных и/или входных транспортов. Выполняет тестирование исходящего транспорта путём отправления запроса к указанному входящему транспорту.
uk: Тест вихідних та/або вхідних транспортів. Виконує тестування вихідного транспорту шляхом надсилання запиту до вказаного вхідного транспорту.

source: %s: Put '%s'. Get: '%s'.
ru: %s: Передано '%s'. Получено: '%s'.
uk: %s: Надіслано '%s'. Отримано: '%s'.

source: Value buffer
ru: Буфер значений
uk: Буфер значень

source: Value buffer tests. Contain 13 tests for all aspects of value buffer (subsystem "Archives").
ru: Тесты буфера значений. Содержит 13 тестов всех аспектов буфера значений (подсистема "Архивы").
uk: Тести буферу значень. Містить 13 тестів всіх аспектів буферу значень (підсистема "Архіви").

source: Test%d
ru: Тест%d
uk: Тест%d

source: %s: Create buffer: Data = string, Size = 10, Period = 1s, HardGrid = yes, HighRes = no.
ru: %s: Создание буфера: Даные = строка, Размер = 10, Период = 1с, ЖёсткаяСетка = да, ВысокоеРазрешение = нет.
uk: %s: Створення буферу: Дані = строка, Розмір = 10, Періо = 1с, ЖорстГратка = так, ВисРоздЗд = ні.

source: %s: Passed.
ru: %s: Пройден.
uk: %s: Виконано.

source: Create buffer error.
ru: Сбой создания буфера.
uk: Збій створення буферу.

source: %s: Change buffer mode.
ru: %s: Изменение режима буфера.
uk: %s: Зміна режиму буфера.

source: Disable hard griding ok.
ru: Отключение жёсткой сетки успешно.
uk: Вдала зміна жорсткої гратки.

source: Disable hard griding failed.
ru: Сбой отключение жёсткой сетки.
uk: Збій зміни жорсткої гратки.

source: Set high resolution time ok.
ru: Установка высокого разрешения успешна.
uk: Вдале встановлення високої роздільної здатності часу.

source: Set high resolution time failed.
ru: Сбой установки высокого разрешения времени.
uk: Збій встановлення високої роздільної здатності часу.

source: Change buffer size ok.
ru: Изменение размера буфера успешно.
uk: Вдала зміна розміру буфера.

source: Change buffer size failed.
ru: Сбой изменения размера буфера.
uk: Збій зміни розміру буфера.

source: Change period ok.
ru: Изменение периода успешно.
uk: Вдала зміна періоду.

source: Change period failed.
ru: Сбой изменения периода.
uk: Збій зміни періоду.

source: %s: Destroy buffer.
ru: %s: Разрушение буфера.
uk: %s: Видалення буферу.

source: %s: Fill and check hard time griding string buffer.
ru: %s: Заполнение и проверка строкового буфера с жёсткой сеткой времени.
uk: %s: Заповнення та перевірка строкового буферу з жорсткою граткою часу.

source: Test:
uk: Тест:

source: Buffer begin or/and end error, at filling half buffer.
ru: Сбой начала и/или конца буфера, при заполнении половины буфера.
uk: Збій початку або/та кінця буферу, під час заповнення половини буферу.

source: Write a half buffer values error.
ru: Сбой записи половины буфера значений.
uk: Збії запису половини буферу значень.

source: Write a half buffer ok.
ru: Запись половины буфера значений успешна.
uk: Вдалий запис половини буферу.

source: Buffer begin or/and end error, at roll filling buffer.
ru: Сбой начала и/или конца буфера, при кольцевом заполнении буфера.
uk: Збій початку або/та кінця буферу, під час заповнення по колу.

source: Write a roll buffer values error.
ru: Сбой кольцевой записи значений в буфер.
uk: Збій запису буферу по колу.

source: Write a roll buffer ok.
ru: Кольцевая запись значений в буфер успешна.
uk: Вдалий запис буферу по колу.

source: Update buffer end error.
ru: Сбой обновления конца буфера.
uk: Збій оновлення кінця буферу.

source: Update buffer end ok.
ru: Обновления конца буфера успешно.
uk: Вдале оновлення кінця буферу.

source: Wrote 1000 values for time %f ms.
ru: Записано 1000 значений в течении %f мс.
uk: Записано 1000 значень за час %f мс.

source: Read 1000 values for time %f ms.
ru: Прочитано 1000 записей в течении %f мс.
uk: Прочитано 1000 значень за час %f мс.

source: %s: Fill and check hard time griding integer buffer.
ru: %s: Заполнение и проверка целочисленного буфера с жёсткой сеткой времени.
uk: %s: Заповнення та перевірка цілочисельного буферу з жорсткою граткою часу.

source: %s: Fill and check soft time griding string buffer (high time).
ru: %s: Заполнение и проверка строкового буфера с мягкой сеткой времени (высокое разрешение времени).
uk: %s: Заповнення та перевірка строкового буферу з м'якою граткою часу (висока розд. здатн. часу).

source: %s: Fill and check soft time griding integer buffer (high time).
ru: %s: Заполнение и проверка целочисленного буфера с мягкой сеткой времени (высокое разрешение времени).
uk: %s: Заповнення та перевірка цілочисельного буферу з м'якою граткою часу (висока розд. здатн. часу).

source: %s: Fill and check soft time griding string buffer (low time).
ru: %s: Заполнение и проверка строкового буфера с мягкой сеткой времени (низкое разрешение времени).
uk: %s: Заповнення та перевірка строкового буферу з м'якою граткою часу (низька розд. здатн. часу).

source: %s: Fill and check soft time griding integer buffer (low time).
ru: %s: Заполнение и проверка целочисленного буфера с мягкой сеткой времени (низкое разрешение времени).
uk: %s: Заповнення та перевірка цілочисельного буферу з м'якою граткою часу (низька розд. здатн. часу).

source: %s: Fill and check free time string buffer (high time).
ru: %s: Заполнение и проверка строкового буфера со свободным временем (высокое разрешение времени).
uk: %s: Заповнення та перевірка строкового буферу з вільним часом (висока розд. здатн. часу).

source: %s: Fill and check free time integer buffer (high time).
ru: %s: Заполнение и проверка целочисленного буфера со свободным временем (высокое разрешение времени).
uk: %s: Заповнення та перевірка цілочисельного буферу з вільним часом (висока розд. здатн. часу).

source: %s: Fill and check free time string buffer (low time).
ru: %s: Заполнение и проверка строкового буфера со свободным временем (низкого разрешение времени).
uk: %s: Заповнення та перевірка строкового буферу з вільним часом (низька розд. здатн. часу).

source: %s: Fill and check free time integer buffer (low time).
ru: %s: Заполнение и проверка целочисленного буфера со свободным временем (низкого разрешение времени).
uk: %s: Заповнення та перевірка цілочисельного з вільним часом (низька розд. здатн. часу).

source: %s: Failed: %s
ru: %s: Ошибка: %s
uk: %s: Помилка: %s

source: Failed: %s: %s
ru: Ошибка: %s: %s
uk: Помилка: %s: %s

source: Parameter attribute path
ru: Путь к атрибуту параметра
uk: Шлях до атрибуту параметра

source: Archive value getting depth (s)
ru: Глубина запроса к архиву значений (с)
uk: Глибина отримання значень архіву (с)

source: Archive value getting period (us)
ru: Период запроса к архиву значений (мкс)
uk: Період отримання значень архіву (мкс)

source: Parameter attribute
uk: Атрибут параметру

source: Parameter attribute's value test. Periodic make gathering for last value of selected attribute, and also gathering from archive for selected depth.
uk: Тест значень атрибуту параметра. Виконує періодичне опитування останнього значення вказаного атрибуту, а також опитування архіву на потрібну глибину.

source: Value of: %s.
ru: Значение из: %s.
uk: Значення з: %s.

source: Last value = %s
ru: Последнее значение = %s
uk: Останне значення = %s

source: Value %d = %s.
ru: Значение %d = %s.
uk: Значення %d = %s.

source: XML file
ru: XML файл
uk: XML файл

source: XML parsing
ru: Разбор XML
uk: Розбір XML

source: XML file parsing test. Parse and show selected file structure.
ru: Тест разбора файла XML. Парсит и отображает структуру указанного файла.
uk: Тест розбору XML файлу. Розбирає та відображає структуру вказаного файлу.

source: Open file '%s' error.
ru: Ошибка открытия файла '%s'.
uk: Помилка відкриття файлу '%s'.

source: Parameter atribute
ru: Атрибут параметра

source: Parameter atribute's value test. Periodic make gathering for last value of selected attribute, and also gathering from archive for selected depth.
ru: Тест значений атрибута параметра. Выполняет периодический опрос последнего значения указанного атрибута, а также опрос архива на указанную глубину.
