Repository: alimon/oscada
Catalog: src/moduls/special/FLibMath/po/*.po
Languages: ru, uk

source: Math function's lib
ru: Библиотека математических функций
uk: Бібліотека математичних функцій

source: Roman Savochenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Allow mathematic static function library.
ru: Предоставляет библиотеку стандартных математические функций.

source: Function
ru: Функция
uk: Функція

source: Functions
ru: Функции
uk: Функції

source: Y(rad.)
ru: Y(рад.)
uk: Y(рад.)

source: ArcCos
ru: Арккосинус
uk: Арккосинус

source: Arc cosine math function.
ru: Мат. функция арккосинус.
uk: Мат. функція арккосинус.

source: ArcSin
ru: Арксинус
uk: Арксинус

source: Arc sine math function.
ru: Мат. функция арксинус.
uk: Мат. функція арксинус.

source: ArcTan
ru: Арктангенс
uk: Арктангенс

source: Arc tangent math function.
ru: Мат. функция арктангенс.
uk: Мат. функція арктангенс.

source: X(rad.)
ru: X(рад.)
uk: X(рад.)

source: Cosine
ru: Косинус
uk: Косинус

source: Cosine math function.
ru: Мат. функция косинус.
uk: Мат. функція косинус

source: Cosine hyperbolical
ru: Косинус гиперболический

source: Cosine hyperbolical math function.
ru: Мат. функция косинус гиперболический.

source: Exponent
ru: Экспонента
uk: Експонента

source: Exponent math function.
ru: Мат. функция экспонента.
uk: Мат. функція експонента.

source: Natural logarithm
ru: Натуральный логарифм
uk: Натуральний логарифм

source: Natural logarithm math function.
ru: Мат. функция натуральный лагорифм.
uk: Мат. функція натуральний логарифм.

source: Decimal logarithm
ru: Десятичный логарифм
uk: Десятковий логарифм

source: Decimal logarithm math function.
ru: Мат. функция десятичный логарифм.
uk: Мат. функція десятковий логарифм.

source: Power
ru: Степень
uk: Степінь

source: Power math function.
ru: Мат. функция возведение в степень.
uk: Мат. функція зведення у степінь

source: Sine
ru: Синус
uk: Синус

source: Sine math function.
ru: Мат. функция синус.
uk: Мат. функція синус.

source: Sine hyperbolical
ru: Синус гипербалический

source: Sine hyperbolical math function.
ru: Мат. функция синус гипербалический.

source: Square root
ru: Корень квадратный
uk: Корінь квадратний

source: Square root math function.
ru: Мат. функция корень квадратный.
uk: Мат. функція корінь квадратний.

source: Tangent
ru: Тангенс
uk: Тангенс

source: Tangent math function.
ru: Мат. функция тангенс.
uk: Мат. функція тангенс.

source: Tangent hyperbolical
ru: Тангенс гипербалический

source: Tangent hyperbolical math function.
ru: Мат. функция тангенс гипербалический.

source: Ceil
ru: Округл. до большего
uk: Округлення до більшого

source: Ceil math function.
ru: Мат. функция округления до большего целого.
uk: Мат. функція округлення до більшого цілого.

source: Absolute
ru: Модуль
uk: Модуль

source: Absolute math function.
ru: Мат. функция модуль от числа.
uk: Мат. функція модуль значення.

source: Floor
ru: Округл. до меньшего
uk: Округлення до меншого

source: Floor math function.
ru: Мат. функция округления до меньшего целого
uk: Мат. функція округлення до меншого цілого.

source: Rand
ru: Случ. число
uk: Випадкове число

source: Rand math function.
ru: Мат. функция генератора случайных чисел.
uk: Мат. функція генерації випадкових чисел.

source: Condition
ru: Условие
uk: Умова

source: True value
ru: Верное знач.
uk: Дійсне значення

source: False value
ru: Ошибочное знач.
uk: Помилкове значення

source: IF condition
ru: Условие Если
uk: Умова Якщо

source: Function's type 'if'-condition.
ru: Функция условие Если.
uk: Функція типу 'якщо'-умова.

source: Allow mathematical static function library.
uk: Надає статичну бібліотеку математичних функцій.

source: Cosine hyperbolic
uk: Косинус гіперболічний

source: Cosine hyperbolic math function.
uk: Мат. функція косинус гіперболічний.

source: Sine hyperbolic
uk: Синус гіперболічний

source: Sine hyperbolic math function.
uk: Мат. функція синус гіперболічний.

source: Tangent hyperbolic
uk: Тангенс гіперболічний

source: Tangent hyperbolic math function.
uk: Мат. функція тангенс гіперболічний.
