Repository: alimon/oscada
Catalog: src/moduls/daq/AMRDevs/po/*.po
Languages: uk

source: 13:Error respond: Too short.
uk: 13:Помилка відповіді: Не повна.

source: 13:Error respond: CRC check error.
uk: 13:Помилка відповіді: Помилка перевірки CRC.

source: 14:Connection error - %s
uk: 14:Помилка підключення - %s

source: 15:Response PDU size error.
uk: 15:Помилка розміру PDU відповіді.

source: Attributes list
uk: Перелік атрибутів

source: Attributes configuration list. List must be written by lines in format: [dt:numb:id:name] Where: dt - data type: I-integer(16),LI-long integer(32),F-float; numb - register number (dec, hex or octal); id - created attribute identifier; name - created attribute name. Example: 'I:0x300:var:Variable' - integer access; 'F:200:float:Float' - get float from registers 200 and 201; 'LI:300:int32:Int32' - get int32 from registers 300 and 301.
uk: Перелік конфігурації атрибутів. Перелік має записуватися строками у форматі: [dt:numb:id:name] Де: dt - тип даних: I-ціле(16),LI-довге ціле(32),F-реальне; numb - номер регістру (десят., шіст., або вісімк.); id - ідентифікатор створюваного атрибуту; name - ім'я створюваного атрибуту. Приклад: 'I:0x300:var:Variable' - доступ до цілого; 'F:200:float:Float' - отримання реального з регістрів 200 та 201; 'LI:300:int32:Int32' - отримання int32 з регістрів 300 та 301.

source: Registers' fragments merge
uk: Поєднання фрагментів регістрів

source: Value
uk: Значення

source: Pressure
uk: Тиск

source: Temperature
uk: Температура

source: Current flow
uk: Поточні витрати

source: Quantity for start day
uk: Кількість з початку доби

source: Quantity for last day
uk: Кількість за попередню добу

source: Quantity for start
uk: Кількість з початку вимірювання

source: Caloric
uk: Калорійність

source: 14:Connection error or respond size short.
uk: 14:Помилка підключення або коротка відповідь.

source: 10:Respond error.
uk: 10:Помилка відповіді.

source: 11:Request broken.
uk: 11:Помилка запиту.

source: 15:Respond thread broken.
uk: 15:Помилкова нитка у відповіді.

source: Thread number
uk: Номер нитки

source: Firmware version
uk: Версія ПЗ

source: Input transport
uk: Вхідний транспорт

source: Master password
uk: Мастер пароль

source: Master PLC serial number
uk: Серійний номер МастерПЛК

source: Controllers network config-file
uk: Конф. файл мережі контролерів

source: PLC serial number
uk: Серійний номер ПЛК

source: Set PLC clock on different for more (s)
uk: Вст. годинника ПЛК при відхилені більш (с)

source: PLC clock's zone
uk: Зона годинника ПЛК

source: List
uk: Перелік

source: Parameter
uk: Параметр

source: Master PLC ID Request: '%s'
uk: Запит ID МастерПЛК: '%s'

source: Connection from PLC Kontar %xh.
uk: Підключення з ПЛК Контар %xh.

source: Password sequence set: '%s'.
uk: Вст. послідовн. пароля: '%s'.

source: Master PLC ID Response: '%s'
uk: Відповідь ID МастерПЛК: '%s'

source: No a propper connection from PLC.
uk: Немає придатного підключення з ПЛК.

source: Request: '%s'
uk: Запит: '%s'

source: Request (enc): '%s'
uk: Запит (код): '%s'

source: 13:Unapt MasterPLC ID: %xh != %xh
uk: 13:Непридатний ID МастерПЛК: %xh != %xh

source: 12:PLC: The password encripted by master key.
uk: 12:ПЛК: Пароль кодовано мастер ключем.

source: 12:PLC: Error.
uk: 12:ПЛК: Помилка.

source: 12:PLC: Unknown command.
uk: 12:ПЛК: Невідома команда.

source: 12:PLC: Wrong command format.
uk: 12:ПЛК: Помилковий формат команди.

source: 12:PLC: Error read from slave.
uk: 12:ПЛК: Помилка читання підлеглого.

source: 12:PLC: Network update in process.
uk: 12:ПЛК: Оновлення мережі в процесі.

source: Response (enc): '%s'
uk: Відповідь (код): '%s'

source: Response: '%s'
uk: Відповідь: '%s'

source: Error: '%s': '%s'
uk: Помилка: '%s': '%s'

source: 15:Response PDU size (%d from %d) error.
uk: 15:Помилка розміру PDU (%d з %d) відповіді.

source: <No select>
uk: <Не обрано>

source: AMR devices
uk: Пристрої АСКО

source: Roman Savochenko
uk: Роман Савоченко

source: Allow access to automatic meter reading devices. Supported devices: Kontar (http://www.mzta.ru).
uk: Надає доступ до пристроїв лічильників комерцевого обліку. Підтримуються пристрої: Kontar (http://www.mzta.ru).

source: Acquisition schedule
uk: Планування опитування

source: Gather task priority
uk: Рівень пріорітету задачі збору даних

source: Restore timeout (s)
uk: Час відновлення (с)

source: Request tries
uk: Спроб запиту

source: Call by period: %s.
uk: Виклик за періодом: %s.

source: Call next by cron '%s'.
uk: Наступний виклик за cron '%s'.

source: Spent time: %s.
uk: Витрачено часу: %s.

source: Status
uk: Стан

source: Disabled
uk: Виключено

source: Enabled
uk: Включено

source: Processed
uk: Обслуговування

source: 11:Value not gathered.
uk: 11:Значення не отримано.
