Repository: alimon/oscada
Catalog: src/moduls/daq/BlockCalc/po/*.po
Languages: de, ru, uk

source: Block link '%s' save error.
de: Fehler beim Speichern der Blockverbindung '%s'.
ru: Ошибка сохранения блочной связи '%s'.
uk: Помилка збереження зв'язку блока '%s'.

source: Node '%s' is not function.
de: Knoten '%s' ist keine Funktion.
ru: Узел '%s' не функция.
uk: Вузол '%s' не функція.

source: Link %d error!
de: Fehler in der Verbindung %d!
ru: Ошибка в связке %d!
uk: Помилка зв'язку %d!

source: Error reading block's '%s' links.
de: Fehler beim Lesen der Blockverbindung '%s'.
ru: Ошибка чтения связей блока '%s'.
uk: Помилка читання зв'язків блоку '%s'.

source: Error writing block's '%s' links.
de: Fehler beim Schreiben der Blockverbindung '%s'.
ru: Ошибка записи связей блока '%s'.
uk: Помилка запису зв'язків блоку '%s'.

source: Block disabled or error.
de: Block abgeschaltet oder Fehler.
ru: Блок отключен или ошибка.
uk: Блок виключено або помилка.

source: Block:
ru: Блок:
uk: Блок:

source: Block
ru: Блок
uk: Блок

source: State
de: Zustand
ru: Состояние
uk: Стан

source: Enable
de: Einschalten
ru: Включен
uk: Ввімкнено

source: Process
de: Bearbeitung
ru: Обрабатывается
uk: Обробляється

source: Configuration
de: Konfiguration
ru: Конфигурация
uk: Конфігурація

source: Name
ru: Имя
uk: Ім'я

source: Description
de: Beschreibung
ru: Описание
uk: Опис

source: To enable
de: Einschalten
ru: Включать
uk: Вмикати

source: To process
de: Bearbeiten
ru: Обрабатывать
uk: Обробляти

source: Prior block
de: Priorität Block
ru: Предшествующий блок
uk: Попередній блок

source: Priority block(s) calculate before this block. Blocks list is separated by symbol ';'.
de: Priorität Block(e) vor diesem Block berechnet. Blockiert Liste wird von Symbol getrennt ';'.
ru: Приоритетный блок(и) вычисляемый перед данным. Список блоков разделяется символом ';'.
uk: Пріоритетний блок(и) який має обчислюватися перед цим блоком. Перелік блоків поділяється символом ';'.

source: Function
de: Funktion
ru: Функция
uk: Функція

source: Go to function
de: Zur Funktion
ru: Перейти к функции
uk: Перейти до функції

source: Show
de: Zeigen
ru: Показать
uk: Показати

source: Hidden
de: Unsichtbar
ru: Скрытые
uk: Приховані

source: Links
de: Verbindungen
ru: Связи
uk: Зв'язки

source: Free
de: Frei
ru: Свободна
uk: Вільний

source: Local
de: Lokal
ru: Локальная
uk: Локальний

source: Global
ru: Глобальная
uk: Глобальний

source: Parameter
ru: Параметр
uk: Параметр

source: Local out
de: Lokal
ru: Локальный выход
uk: Локальний вихід

source: Global out
de: Globaler Ausgang
ru: Глобальный выход
uk: Глобальний вихід

source: Parameter out
de: Parameter-ein
ru: Параметр выход
uk: Параметр вихід

source: Local in
de: Lokaler Eingang
ru: Локальный вход
uk: Локальний вхід

source: Global in
de: Globaler Eingang
ru: Глобальный вход
uk: Глобальний вхід

source: Parameter in
de: Parameter-aus
ru: Параметр вход
uk: Параметр вхід

source: Block based calculator
de: Blockrechner
ru: Блочный вычислитель
uk: Блоковий обчислювач

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Allow block based calculator.
de: Erlaubt Berechnungen mit dem Blockrechner.
ru: Предоставляет блочный вычислитель.
uk: Надає блоковий обчислювач.

source: Parameters table
de: Tabelle der Parameter
ru: Таблица параметров
uk: Таблиця параметрів

source: Block's table
de: Tabelle des Blocks
ru: Таблица блоков
uk: Таблиця блоків

source: Calculate period (ms)
de: Rechenzeit (ms)
ru: Периодичность обсчёта (мс)
uk: Період обрахувань (мс)

source: Calculate schedule
de: Berechnet Zeitplan
ru: Планирование вычислений
uk: Політика планування

source: Calculate task priority
de: Priorität der Berechnung
ru: Приоритет задачи вычисления
uk: Пріоритет задачі обчислення

source: Iteration number into calculate period
de: Anzahl der Iterationen in der Rechenzeit
ru: Число итераций в одном периоде обсчёта
uk: Кількість ітерацій у одному періоді обрахування

source: Write to output links only at changes
de: Schreiben Ausgangsverbindungen nur bei Änderungen
ru: Записывать по выходным связям только при изменениях
uk: Записувати за вихідними зв'язками тільки при змінах

source: Standard
ru: Стандартный
uk: Стандартний

source: Blocks' IOs
de: IO-Parameter des Blocks
ru: Параметры блока
uk: Параметри блоку

source: Block's ID
de: Id des Blocks
ru: Id блока
uk: ID блоку

source: Link's type
de: Verbindungstyp
ru: Тип связи
uk: Тип зв'язку

source: Link
de: Verbindung
ru: Связь
uk: Зв'язок

source: Link's value
de: Verbindungswert
ru: Значение связи
uk: Значення зв'язку

source: Call now.
de: Rufen Sie jetzt an.
ru: Вызов сейчас.
uk: Виклик зараз.

source: Call by period: %s.
de: Call mit einer Periode: %s.
ru: Вызовы с периодом: %s.
uk: Виклик за періодом: %s.

source: Call next by cron '%s'.
de: Call nächsten durch cron '%s'.
ru: Следующий вызов по cron '%s'.
uk: Наступний виклик за cron '%s'.

source: Spent time: %s.
de: Verbrauchte Zeit: %s.
ru: Затрачено времени: %s.
uk: Витрачено часу: %s.

source: Enable block '%s' error.
de: Fehler beim Einschalten des Blocks '%s'.
ru: Ошибка включения блока '%s'.
uk: Помилка ввімкнення блоку '%s'.

source: Process block '%s' error.
de: Fehler bei der Bearbeitung des Blocks '%s'.
ru: Ошибка обработки блока '%s'.
uk: Помилка обрахунку блоку '%s'.

source: Block '%s' calc error.
de: Berechnungsfehler im Blocks '%s'.
ru: Ошибка '%s' вычисления блока.
uk: Помилка обчислення блоку '%s'.

source: Block '%s' is stopped.
de: Block '%s' ist angehalten.
ru: Блок '%s' остановлен.
uk: Блок '%s' зупинено.

source: Blocks scheme
de: Blockschema
ru: Схема блоков
uk: Схема блоків

source: Number
de: Zahl
ru: Количество
uk: Кількість

source: Blocks
de: Blöcke
ru: Блоки
uk: Блоки

source: All: %u; Enabled: %u; Process: %u
de: Alle: %u; Eingeschaltet: %u; Bearbeitung: %u
ru: Всего: %u; Включено: %u; Обрабатывается: %u
uk: Всього: %u; Включено: %u; Обробляється: %u

source: 1:Parameter is disabled.
de: 1:Parameter ist abgeschaltet.
ru: 1:Параметр отключен.
uk: 1:Параметр вимкнено.

source: 2:Controller is stopped.
de: 2:Controller ist angehalten.
ru: 2:Контроллер остановлен.
uk: 2:Контролер зупинено.

source: Attributes configuration list. List must be written by lines in format: [<blk>.<blk_io>:<aid>:<anm>] Where: blk - block identifier from block's scheme; for constant value set to: '*s' - String type; '*i' - Integer type; '*r' - Real type; '*b' - Boolean type. blk_io - block's parameter from block's scheme; for constant value set to attribute value; aid - created attribute identifier; anm - created attribute name. If 'aid' or 'anm' are not set they will be generated from selected block's parameter.
de: Liste der Konfiguration der Attribute. Die Liste wird gemacht zeilenweise im Format: [<blk>.<blk_io>:<aid>:<anm>] Wo: blk - Blockbezeichner, des Blockschemas; für die Konstante wird die Bedeutung bestimmt: '*s' - Zeilentyp; '*i' - integer-bedeutend; '*r' - sachlicher Typ; '*b' - logischer Typ. blk_io - Blocksparameter, des Blockschemas; für die Konstante die Bedeutungwird im Sinne eines Attributs bestimmt; aid - Bezeichner des gebildeten Attributs; anm - Name des gebildeten Attributs. Falls 'aid' oder 'anm' nicht eingesetzt sind werden sie aus dem gewählten Blocksparameter generiert.
ru: Список конфигурации атрибутов. Список формируется строками в формате: [<blk>.<blk_io>:<aid>:<anm>] Где: blk - идентификатор блока, блочной схемы; для постоянной значение устанавливается: '*s' - строковый тип; '*i' - целочисленный тип; '*r' - вещественный тип; '*b' - логический тип. blk_io - параметр блока, блочной схемы; для постоянной значений устанавливается в значение атрибута; aid - идентификатор создаваемого атрибута; anm - имя создаваемого атрибута. Если 'aid' или 'anm' не установлены то выполняется их генерация из выбранного параметра блока.
uk: Перелік конфігурації атрибутів. Перелік формується строками у форматі: [<blk>.<blk_io>:<aid>:<anm>] Де: blk - ідентифікатор блоку, блочної схеми; для константи значення встановлено у: '*s' - строковий тип; '*i' - цілий тип; '*r' - реальний тип; '*b' - логічний тип. blk_io - параметр блоку, блочної схеми; для константи значення встановлено у значення атрибута; aid - ідентифікатор створюваного атрибуту; anm - ім'я створюваного атрибуту. Якщо 'aid' або 'anm' не встановлено тоді виконується їх генерація з вибраного параметру блоку.
