Repository: alimon/oscada
Catalog: src/moduls/daq/ModBus/po/*.po
Languages: ru, uk

source: Parameters table
ru: Таблица параметров
uk: Таблиця параметрів

source: Logical parameters table
ru: Таблица логических параметров
uk: Таблиця логічних параметрів

source: Acquisition schedule
ru: Планирование опроса
uk: Планування опитування

source: Gather task priority
ru: Уровень приоритета задачи сбора данных
uk: Пріоритет задачі збору

source: Modbus protocol
ru: Modbus протокол
uk: Modbus протокол

source: Transport address
ru: Адрес транспорта
uk: Адреса транспорту

source: Destination node
ru: Узел назначения
uk: Вузол призначення

source: Data fragments merge
ru: Объединять фрагменты данных
uk: Поєднувати фрагменти даних

source: Use multi-items write functions (15,16)
ru: Использовать функции записи нескольких элементов (15,16)
uk: Використовувати функції запису багатьох елементів (15,16)

source: Asynchronous write
ru: Асинхронная запись
uk: Асинхроний запис

source: Connection timeout (ms)
ru: Время ожидания соединения (мс)
uk: Час очікування з'єднання (мс)

source: Restore timeout (s)
ru: Время восстановления (с)
uk: Час відновлення (с)

source: Request tries
ru: Попыток запроса
uk: Спроб запиту

source: Maximum request block size (bytes)
ru: Максимальный размер блока запроса (байты)
uk: Максимальний розмір блоку запиту (байти)

source: Standard
ru: Стандарт
uk: Стандарт

source: Attributes list
ru: Перечень атрибутов
uk: Перелік атрибутів

source: Logical
ru: Логический
uk: Логічний

source: Parameter template
ru: Шаблон параметра
uk: Шаблон параметру

source: Parameter ID
ru: ID параметра
uk: ID параметру

source: Value
ru: Значение
uk: Значення

source: Task terminated!
ru: Задача прервана!
uk: Завдання перервано!

source: Connection error. Restoring in %.6g s.
ru: Ошибка соединения. Восстановления через %.6g с.
uk: Помилка з'єднання. Відновлення через %.6g c.

source: Call now.
ru: Вызов сейчас.
uk: Виклик зараз.

source: Call by period: %s.
ru: Вызовы с периодом: %s.
uk: Виклик за періодом: %s.

source: Call next by cron '%s'.
ru: Следующий вызов по cron '%s'.
uk: Наступний виклик за cron '%s'.

source: Spent time: %s. Read %g(%g) registers, %g(%g) coils. Write %g registers, %g coils. Errors of connection %g, of respond %g.
ru: Затрачено времени: %s. Прочитано %g(%g) регистров, %g(%g) битов. Записано %g регистров, %g битов. Ошибок соединения %g, запроса %g.
uk: Витрачено часу: %s. Прочитано %g(%g) регістрів, %g(%g) бітів. Записано %g регістрів, %g бітів. Помилок з'єднань %g, відповідей %g.

source: DAQ.%s: connect to data source: %s.
ru: DAQ.%s: подключение к источнику данных: %s.
uk: DAQ.%s: підключення до джерела даних: %s.

source: STOP
ru: ОСТАНОВЛЕН
uk: ЗУПИНЕНО

source: 10:Connection error or no response.
ru: 10:Ошибка соединения или нет ответа.
uk: 10:Помилка з'єднання або немає відповіді.

source: 4:Server failure.
ru: 4:Ошибка сервера.
uk: 4:Збій серверу

source: 15:Response PDU size error.
ru: 15:Ошибка размера PDU ответа.
uk: 15:Помилка розміру PDU відповіді.

source: OK
ru: НОРМА
uk: НОРМА

source: Merge not adjacent fragments of registers to single block for request. Attention! Some devices don't support accompany request wrong registers into single block.
ru: Объединять несмежные фрагменты регистров в один блок для запроса. Внимание! Некоторые устройства не поддерживают сопутствующего запроса ошибочных регистров в одном блоке.
uk: Поєднувати несуміжні фрагменти регістрів для запиту одним блоком. Увага! Деякі пристрої не підтримують супутнього запиту помилкових регістрів у одному блоці.

source: Individual connection timeout for device requested by the task. For zero value used generic connection timeout from used output transport.
ru: Индивидуальное время ожидания для устройства, опрашиваемого этой задачей. Для нулевого значения используется общее время ожидания подключения из использованного выходного транспорта.
uk: Індивідуальний час очікування для пристрою, опитуваного цим завданням. Для нульового значення використовується загальний час очікування підключення із використаного вихідного транспорту.

source: 11:Value not gathered.
ru: 11:Значения не опрошены.
uk: 11:Значення не отримано.

source: Error calculate template.
ru: Ошибка вычисления шаблона.
uk: Помилка обчислення шаблону.

source: 1:Parameter is disabled.
ru: 1:Параметр отключен.
uk: 1:Параметр вимкнено.

source: 2:Acquisition is stopped.
ru: 2:Опрос остановлен.
uk: 2:Збір зупинено.

source: Attributes configuration list. List must be written by lines in format: "{dt}:{numb}:{rw}:{id}:{name}". Where: dt - ModBus data type (R-register[3,6(16)], C-coil[1,5(15)], RI-input register[4], CI-input coil[2]); R and RI can be expanded by suffixes: i2-Int16, i4-Int32, i8-Int64, u2-UInt16, u4-UInt32, f-Float, d-Double, b5-Bit5, s-String; Start from symbol '#' for comment line; numb - ModBus device's data address (dec, hex or octal) [0...65535]; rw - read/write mode (r-read; w-write; rw-readwrite); id - created attribute identifier; name - created attribute name. Examples: "R:0x300:rw:var:Variable" - register access; "C:100:rw:var1:Variable 1" - coin access; "R_f:200:r:float:Float" - get float from registers 200 and 201; "R_i4:400,300:r:int32:Int32" - get int32 from registers 400 and 300; "R_b10:25:r:rBit:Reg bit" - get bit 10 from register 25; "R_s:15,20:r:str:Reg blk" - get string, registers block, from register 15 and size 20.
ru: Список конфигурации атрибутов. Список формируется строками в формате: "{dt}:{numb}:{rw}:{id}:{name}". Где: dt - ModBus тип данных (R-регистр[3,6(16)], C-бит[1,5(15)], RI-регистр входа[4], CI-бит входа[2]); R и RI могут быть расширены суффиксами: i2-Int16, i4-Int32, i8-Int64, u2-UInt16, u4-UInt32, f-Float, d-Double, b5-Bit5, s-Строка; Начните с символа '#' для комментирования строки; numb - адрес ModBus устройства (десят., шестн., или восьмеричн.) [0...65535]; rw - режим чтения/записи (r-чтение; w-запись, rw-запись и чтение); id - идентификатор создаваемого атрибута; name - имя создаваемого атрибута. Примеры: "R:0x300:rw:var:Variable" - доступ к регистру; "C:100:rw:var1:Variable 1" - доступ к биту; "R_f:200:r:float:Float" - получить вещественное из регистров 200 и 201; "R_i4:400,300:r:int32:Int32" - получить int32 из регистров 400 и 300; "R_b10:25:r:rBit:Reg bit" - получить бит 10 из регистра 25; "R_s:15,20:r:str:Reg blk" - получить строку, блок регистров, из регистра 15 и размером 20.
uk: Перелік конфігурації атрибутів. Перелік формується строками у форматі: "{dt}:{numb}:{rw}:{id}:{name}". Де: dt - ModBus тип даних (R-регістер[3,6(16)], C-біт[1,5(15)], RI-регістер входу[4], CI-біт входу[2]); R та RI можуть бути розширені суфіксами: i2-Int16, i4-Int32, i8-Int64, u2-UInt16, u4-UInt32, f-Float, d-Double, b5-Bit5, s-Рядок; Почніть з символу '#' для коментування рядка; numb - адреса ModBus даних пристрою (десят., шіст., або вісімк.) [0...65535]; rw - режим запису/читання (r-читати, w-писати, rw-читати та писати); id - ідентифікатор створюваного атрибуту; name - ім'я створюваного атрибуту. Приклади: "R:0x300:rw:var:Variable" - доступ до регістру; "C:100:rw:var1:Variable 1" - доступ до біту; "R_f:200:r:float:Float" - отримати float з регістрів 200 та 201; "R_i4:400,300:r:int32:Int32" - отримати int32 з регістрів 400 та 300; "R_b10:25:r:rBit:Reg bit" - отримати біт 10 з регітру 25; "R_s:15,20:r:str:Reg blk" - отримати рядок, блок регістрів, із регистру 15 та розміром 20.

source: Template configuration
ru: Конфигурация шаблона
uk: Конфігурація шаблону

source: Parameters
ru: Параметры
uk: Параметри

source: ModBus address in format: "{dt}:{numb}:{rw}". Where: dt - ModBus data type (R-register[3,6(16)], C-coil[1,5(15)], RI-input register[4], CI-input coil[2]); R and RI can be expanded by suffixes: i2-Int16, i4-Int32, i8-Int64, u2-UInt16, u4-UInt32, f-Float, d-Double, b5-Bit5, s-String; numb - ModBus device's data address (dec, hex or octal) [0...65535]; rw - read/write mode (r-read; w-write; rw-readwrite). Examples: "R:0x300:rw" - register access; "C:100:rw" - coin access; "R_f:200:r" - get float from registers 200 and 201; "R_i4:400,300:r" - get int32 from registers 400 and 300; "R_b10:25:r" - get bit 10 from register 25; "R_s:15,20:r" - get string, registers block, from register 15 and size 20.
ru: ModBus адрес в формате: "{dt}:{numb}:{rw}". Где: dt - ModBus тип данных (R-регистр[3,6(16)], C-бит[1,5(15)], RI-регистр входа[4], CI-бит входа[2]); R и RI могут быть расширены суффиксами: i2-Int16, i4-Int32, i8-Int64, u2-UInt16, u4-UInt32, f-Float, d-Double, b5-Bit5, s-Строка; numb - адрес данных ModBus устройства (десят., шестн., или восьмеричн.) [0...65535]; rw - режим чтения/записи (r-чтение; w-запись, rw-запись и чтение); Примеры: "R:0x300:rw" - доступ к регистру; "C:100:rw" - доступ к биту; "R_f:200:r" - получить вещественное из регистров 200 и 201; "R_i4:400,300:r" - получить int32 из регистров 400 и 300; "R_b10:25:r" - получить бит 10 из регистра 25; "R_s:15,20:r" - получить строку, блок регистров, из регистра 15 и размером 20.
uk: ModBus адреса у форматі: "{dt}:{numb}:{rw}". Де: dt - ModBus тип даних (R-регістер[3,6(16)], C-біт[1,5(15)], RI-регістер входу[4], CI-біт входу[2]); R та RI можуть бути розширені суфіксами: i2-Int16, i4-Int32, i8-Int64, u2-UInt16, u4-UInt32, f-Float, d-Double, b5-Bit5, s-Рядок; numb - адреса ModBus даних пристрою (десят., шіст., або вісімк.) [0...65535]; rw - режим запису/читання (r-читати, w-писати, rw-читати та писати); Приклади: "R:0x300:rw" - доступ до регістру; "C:100:rw" - доступ до біту; "R_f:200:r" - отримати float з регістрів 200 та 201; "R_i4:400,300:r" - отримати int32 з регістрів 400 та 300; "R_b10:25:r" - отримати біт 10 з регітру 25; "R_s:15,20:r" - отримати рядок, блок регістрів, із регистру 15 та розміром 20.

source: Parameter id error.
ru: Ошибка id параметра.
uk: Помилка id параметру.

source: Name
ru: Имя
uk: Ім'я

source: Description
ru: Описание
uk: Опис

source: To enable
ru: Включать
uk: Вмикати

source: Address
ru: Адрес
uk: Адреса

source: Input transport
ru: Входящий транспорт
uk: Вхідний транспорт

source: Protocol
ru: Протокол
uk: Протокол

source: RTU;ASCII;TCP/IP;All
ru: RTU;ASCII;TCP/IP;Все
uk: RTU;ASCII;TCP/IP;Всі

source: Mode
ru: Режим
uk: Режим

source: Data;Gateway node;Gateway net
ru: Данные;Шлюз узла;Шлюз сети
uk: Дані;Шлюз вузла;Шлюз мережі

source: Calculate data period (s)
ru: Период обсчёта данных (с)
uk: Період обчислення даних (с)

source: Program
ru: Программа
uk: Програма

source: To transport
ru: В транспорт
uk: До транспорту

source: To protocol
ru: В протокол
uk: У протокол

source: To address
ru: По адресу
uk: За адресою

source: Node ID
ru: Ид. узла
uk: Ід. вузлу

source: Value type
ru: Тип значений
uk: Тип значення

source: Flags
ru: Флаги
uk: Прапорці

source: Real position
ru: Реальное положение
uk: Реальне положення

source: Search and create new node error.
ru: Ошибка поиска и создания нового узла.
uk: Помилка пошуку та створення нового вузлу.

source: 13:Error server respond
ru: 13:Ошибка в ответе сервера
uk: 13:Помилка відповіді серверу

source: Not full respond
ru: Неполный ответ
uk: Неповна відповідь

source: 13:Error respond: Too short.
ru: 13:Ошибка ответа: Очень короткий.
uk: 13:Помилка відповіді: Дуже коротка.

source: 13:Error respond: CRC check error.
ru: 13:Ошибка ответа: Ошибка проверки CRC.
uk: 13:Помилка відповіді: Помилка перевірки CRC.

source: 13:Error respond: Error format.
ru: 13:Ошибка ответа: Ошибка формата.
uk: 13:Помилка відповіді: Помилка формату.

source: 13:Error respond: LRC check error.
ru: 13:Ошибка ответа: Ошибка проверки LRC.
uk: 13:Помилка відповіді: Помилка перевірки LRC.

source: Protocol '%s' error.
ru: Ошибка протокола '%s'.
uk: Помилка протоколу '%s'.

source: 13:Error respond
ru: 13:Ошибка ответа
uk: 13:Помилка відповіді

source: 1:%02X:Function is not supported.
ru: 1:%02X:Функция не поддерживается.
uk: 1:%02X:Функція не підтримується.

source: 2:Requested address not allow or request area too long.
ru: 2:Запрошенный адрес недопустим или область запроса очень большая.
uk: 2:Адреса запиту недозволена або межа запиту дуже велика.

source: 3:Illegal data value into request.
ru: 3:Нелегальное значение данных в запросе.
uk: 3:Нелегальне значення даних у запиті.

source: 5:Request requires too long time for execute.
ru: 5:Запрос требует очень много времени для исполнения.
uk: 5:Запит вимагає дуже багато часу для виконання.

source: 6:Server is busy.
ru: 6:Сервер занят.
uk: 6:Сервер зайнятий.

source: 7:Program function is error. By request functions 13 or 14.
ru: 7:Ошибка функции программы. Запрошено функцией 13 или 14.
uk: 7:Помилка програмної функції. Запитано функцією 13 або 14.

source: 10:Gateway problem.
ru: 10:Проблема со шлюзом.
uk: 10:Помилка у шлюзі.

source: 12:%02X:Unknown error.
ru: 12:%02X:Неизвестная ошибка.
uk: 12:%02X:Невідома помилка.

source: 14:Device error:
ru: 14:Ошибка устройства:
uk: 14:Помилка пристрою:

source: REQ ->
ru: Запрос ->
uk: Запит ->

source: RESP ->
ru: Ответ ->
uk: Відпов. ->

source: ERR ->
ru: Ошибка ->
uk: Помилка ->

source: Node
ru: Узел
uk: Вузол

source: Nodes
ru: Узлы
uk: Вузли

source: Report
ru: Отчёт
uk: Звіт

source: Report length
ru: Размер отчёта
uk: Довжина звіту

source: Zero use for report disabling
ru: Ноль используется для отключения отчёта.
uk: Використовувати нуль для вимкнення звіту

source: Function calculate frequency (Hz)
ru: Частота вычисления функции (Гц)
uk: Частота обчислення функції (Гц)

source: Function start flag
ru: Флаг запуска функции
uk: Прапорець початку функції

source: Function stop flag
ru: Флаг остановки функции
uk: Прапорець завершення функції

source: Coil(%s) %d already registered for IO%d. IO%d will be disabled for process coil %d!
ru: Бит(%s) %d уже зарегистрирован для IO%d. IO%d будет исключён из обработки бита %d!

source: Register(%s) %d already registered for IO%d. IO%d will be disabled for process register %d!
ru: Регистр(%s) %d уже зарегистрирован для IO%d. IO%d будет исключён из обработки регистра %d!

source: ModBUS data type '%s' error!
ru: Ошибка типа данных '%s' ModBus!

source: Compile function by language '%s' error: %s
ru: Ошибка компиляции функции для языка '%s': %s
uk: Помилка компіляції функції з мовою '%s': %s

source: Disabled.
ru: Отключен.
uk: Виключено.

source: Enabled.
ru: Включен.
uk: Включено.

source: Spent time: %s. Requests %.4g. Read registers %.4g, coils %.4g, register inputs %.4g, coil inputs %.4g. Writed registers %.4g, coils %.4g.
ru: Затрачено времени: %s. Запросов %.4g. Прочитано %.4g регистров, %.4g битов, %.4g регистров входов,%.4g битов входов. Записано %.4g регистров, %.4g битов.

source: Requests %.4g.
ru: Запросов %.4g.
uk: Запитів %.4g.

source: Calculate node's function error.
ru: Ошибка вычисления функции узла.
uk: Помилка обчислення функції вузлу.

source: Node:
ru: Узел:
uk: Вузол:

source: State
ru: Состояние
uk: Стан

source: Status
ru: Статус
uk: Стан

source: Enable
ru: Включен
uk: Включено

source: DB
ru: БД
uk: БД

source: Configuration
ru: Конфигурация
uk: Конфігурація

source: Data
ru: Данные
uk: Дані

source: For "Id" field provide specific ModBus data form: "R{N}[w]", "RI{N}[w]" - specific register (and input) form, can expanded by suffixes: "i"-Int32, "f"-Float, "d"-Double, "s"-String; "R:{N}:[w]", "RI:{N}:[w]" - classic register (and input) form, can expanded by suffixes: "i4"-Int32, "i8"-Int64, "f"-Float, "d"-Double, "s"-String; "C{N}[w]", "CI{N}[w]", "C:{N}:[w]", "CI:{N}:[w]" - coil (and input). Where: {N} - ModBus device's data address (dec, hex or octal) [0...65535]; w - optional symbol for writing allow indicate. Examples: "R0x300w" - register access; "C100w" - coin access, allow for write; "R_f200" - get float from registers 200 and 201; "R_i400,300" - get int32 from registers 300 and 400; "R_s15,20" - get string, registers block, from register 15 and size 20; "R_i8:0x10:w" - get and set int64 into registers [0x10-0x13]; "R_d:0x20,0x30" - get double float point (8 byte) from registers [0x20,0x30-0x32].
ru: Для поля "Id" предоставляется специфическая форма записи ModBus данных: "R{N}[w]", "RI{N}[w]" - специфичная форма регистра (и входы), может быть расширен суффиксами: "i"-Int32, "f"-Float, "d"-Double, "s"-Строка; "R:{N}:[w]", "RI:{N}:[w]" - классическая форма регистра (и входы), может быть расширен суффиксами: "i4"-Int32, "i8"-Int64, "f"-Float, "d"-Double, "s"-Строка; "C{N}[w]", "CI{N}[w]", "C:{N}:[w]", "CI:{N}:[w]" - бит (и входы). Где: {N} - адрес данных ModBus устройства (десят., шестн., или восьмеричн.) [0...65535]; w - опциональный символ для индикации возможности записи. Примеры: "R0x300w" - доступ к регистру; "C100w" - доступ к биту, доступен для записи; "R_f200" - получить вещественное из регистров 200 и 201; "R_i400,300" - получить int32 из регистров 400 и 300; "R_s15,20" - получить строку, блок регистров, из регистра 15 и размером 20; "R_i8:0x10:w" - получить и установить int64 в регистры [0x10-0x13]; "R_d:0x20,0x30" - получить вещественное двойной точности (8 byte) из регистров [0x20,0x30-0x32].

source: Type
ru: Тип
uk: Тип

source: Real;Integer;Boolean;String
ru: Вещ.;Целый;Логич.;Строка
uk: Реальний;Цілий;Логічний;Рядок

source: Link
ru: Связь
uk: Зв'язок

source: Program language
ru: Язык программы.
uk: Мова програми

source: Links
ru: Связи
uk: Зв'язки

source: Disable node for this operation
ru: Отключите узел для этой операции
uk: Вимкніть вузол для цієї операції

source: New IO
ru: Новый IO
uk: Нове IO

source: Deleting lock attribute is not allowed.
ru: Удаление заблокированного атрибута недопустимо.
uk: Видалення замкненого атрибуту недозволено.

source: Changing locked attribute is not allowed.
ru: Изменение заблокированного атрибута недопустимо.
uk: Зміна замкненого атрибуту недозволено.

source: Empty value is not valid.
ru: Пустое значение недопустимо.
uk: Порожнє значення недозволено.

source: Roman Savochenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Allow realization of ModBus client service. Supported Modbus/TCP, Modbus/RTU and Modbus/ASCII protocols.
ru: Предоставляет реализацию клиентского сервиса протокола ModBus. Поддерживаются Modbus/TCP, Modbus/RTU и Modbus/ASCII протоколы.
uk: Надає реалізацію клієнтського ModBus сервісу. Підтримуються Modbus/TCP, Modbus/RTU та Modbus/ASCII протоколи.

source: Allow realization of ModBus protocols. Supported Modbus/TCP, Modbus/RTU and Modbus/ASCII protocols.
ru: Предоставляет реализацию протоколов ModBus. Поддерживаются Modbus/TCP, Modbus/RTU и Modbus/ASCII протоколы.
uk: Надає реалізацію ModBus протоколів. Підтримуються Modbus/TCP, Modbus/RTU та Modbus/ASCII протоколи.

source: Coil '%d' already registered for IO '%d'. IO '%d' will be disabled for process coil '%d'!
uk: Біт(coil) '%d' вже зареєстровано для IO '%d'. IO '%d' буде виключено із обробки біта(coil) '%d'!

source: Register '%d' already registered for IO '%d'. IO '%d' will be disabled for process register '%d'!
uk: Регістр '%d' вже зареєстровано для IO '%d'. IO '%d' буде виключено із обробки регістра '%d'!

source: ModBUS data type '%c' error!
uk: Помилка типу даних '%c' ModBus!

source: Spent time: %s. Requests %.4g. Read registers %.4g, coils %.4g. Writed registers %.4g, coils %.4g.
uk: Витрачено часу: %s. Запитів %.4g. Прочитано %.4g регістрів, %.4g бітів. Записано %.4g регістрів, %.4g бітів.

source: For "Id" field provide specific ModBus data form: "R{N}[w]" - specific register form, can expanded by suffixes: "i"-Int32, "f"-Float, "d"-Double, "s"-String; "R:{N}:[w]" - classic register form, can expanded by suffixes: "i4"-Int32, "i8"-Int64, "f"-Float, "d"-Double, "s"-String; "C{N}[w]" or "C:{N}:[w]" - coil. Where: {N} - ModBus device's data address (dec, hex or octal) [0...65535]; w - optional symbol for writing allow indicate. Examples: "R0x300w" - register access; "C100w" - coin access, allow for write; "R_f200" - get float from registers 200 and 201; "R_i400,300" - get int32 from registers 300 and 400; "R_s15,20" - get string, registers block, from register 15 and size 20; "R_i8:0x10:w" - get and set int64 into registers [0x10-0x13]; "R_d:0x20,0x30" - get double float point (8 byte) from registers [0x20,0x30-0x32].
uk: Для поля "Id" надається специфічна форма запису ModBus даних: "R{N}[w]" - специфічна форма регістру, може бути розширена суфіксами: "i"-Int32, "f"-Float, "d"-Double, "s"-Рядок; "R:{N}:[w]" - класична форма регістру, може бути розширена суфіксами: "i4"-Int32, "i8"-Int64, "f"-Float, "d"-Double, "s"-Рядок; "C{N}[w]" або "C:{N}:[w]" - біт. Де: {N} - адреса ModBus даних пристрою (десят., шіст., або вісімк.) [0...65535]; w - опціональний символ для індикації можливості запису. Приклади: "R0x300w" - доступ до регістру; "C100w" - доступ до біту; "R_f200" - отримати float з регістрів 200 та 201; "R_i400,300" - отримати int32 з регістрів 400 та 300; "R_s15,20" - отримати рядок, блок регістрів, із регистру 15 та розміром 20 "R_i8:0x10:w" - отримати або встановити int64 до регістрів [0x10-0x13]; "R_d:0x20,0x30" - отримати реальне подвійної точності (8 байт) з регістрів [0x20,0x30-0x32].
