Repository: alimon/oscada
Catalog: src/moduls/bd/DBF/po/*.po
Languages: de

source: Roman Savochenko
de: Roman Savotschenko

source: BD module. Provides support of the *.dbf files, version 3.0.
de: Modul unterstützt die *.dbf Datenbank Version 3.0.

source: Delete DB error!
de: Fehler beim Löschen der Datenbank!

source: Error create DB directory '%s'!
de: Fehler beim Erstellen des Datenbank-Verzeichnisses '%s'!

source: Restore previous directory as current error.
de: Wiederherstellung des vorherigen Verzeichnisses ist nicht erlaubt.

source: Error open table '%s'. DB is disabled.
de: Fehler beim Öffnen der Tabelle '%s', die Datenbank ist abgeschaltet.

source: For DBF address DB is the directory which contains files of tables (*.dbf). For example: /opt/dbf .
de: Für DBF ist die Adresse das Verzeichnis welches die Tabellendateien (*.dbf) beinhaltet. Zum Beispiel: /opt/dbf .

source: Open table error!
de: Fehler beim Öffnen der Tabelle!

source: Cell error!
de: Fehler in der Zelle!

source: Field is not present!
de: Das Feld ist nicht vorhanden!

source: Read only access to file '%s'.
de: Nur Lesezugriff auf Datei '%s'.

source: Column error!
de: Fehler in der Spalte!

source: Delete field error!
de: Fehler beim Löschen des Feldes!

source: Line error!
de: Fehler in der Zeile!

source: Key column '%s' is not present!
de: Die Schlüsselzeile '%s' ist nicht vorhanden!
