Repository: alimon/oscada
Catalog: src/moduls/special/FLibComplex1/po/*.po
Languages: ru

source: Complex1 function's lib
ru: Библиотека функций Complex1

source: Roman Savochenko
ru: Роман Савоченко

source: Allow static function library Complex1 (SCADA Complex1 functions).
ru: Предоставляет статическую библиотеку функций Complex1 (функции SCADA Complex1).

source: Function
ru: Функция

source: Functions
ru: Функции

source: Command "Open"
ru: Команда "Открыть"

source: Command "Close"
ru: Команда "Закрыть"

source: Command "Stop"
ru: Команда "Стоп"

source: Stat "Opened"
ru: Сотояние "Открыт"

source: Stat "Closed"
ru: Состояние "Закрыт"

source: Command hold time (s)
ru: Время удержания команды (с)

source: Calc period (ms)
ru: Период обсчёта (мс)

source: Process command clock
ru: Счётчик вычисления

source: Last command
ru: Последняя команда

source: Digital block
ru: Дискретный блок

source: Digital assemble block.
ru: Сборка дискретных сигналов.

source: Output
ru: Выход

source: Input %d.1
ru: Вход %d.1

source: Input %d.2
ru: Вход %d.2

source: Simple summator
ru: Простой сумматор

source: Simple summator per formula: out=in1_1*in1_2+in2_1*in2_2+in3_1*in3_2+in4_1*in4_2+ in5_1*in5_2+in6_1*in6_2+in7_1*in7_2+in8_1*in8_2;
ru: Простой сумматор по формуле: out=in1_1*in1_2+in2_1*in2_2+in3_1*in3_2+in4_1*in4_2+ in5_1*in5_2+in6_1*in6_2+in7_1*in7_2+in8_1*in8_2;

source: Input 1.
ru: Вход 1.

source: Input 2.
ru: Вход 2.

source: Simple multiplicator
ru: Простое умножение

source: Simple moltiplicator per formula: out=(in1_1*in1_2*in1_3*in1_4*in1_5*in1_6)/(in2_1*in2_2*in2_3*in2_4);
ru: Простое умножение по формуле: out=(in1_1*in1_2*in1_3*in1_4*in1_5*in1_6)/(in2_1*in2_2*in2_3*in2_4);

source: Input 3.
ru: Вход 3.

source: Input 4.
ru: Вход 4.

source: Multiplicator+divider
ru: Умножение+деление

source: Multiplicator+divider per formula: out=in1_1*in1_2*in1_3*in1_4*in1_5*(in2_1*in2_2*in2_3*in2_4*in2_5+ (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));
ru: Умножение+деление по формуле: out=in1_1*in1_2*in1_3*in1_4*in1_5*(in2_1*in2_2*in2_3*in2_4*in2_5+ (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));

source: Input 3
ru: Вход 3

source: Input 5
ru: Вход 5

source: Exponent
ru: Экспонента

source: Exponent per formula: out=exp (in1_1*in1_2*in1_3*in1_4*in1_5 + (in2_1*in2_2*in2_3*in2_4*in2_5+in3) / (in4_1*in4_2*in4_3*in4_4*in4_5+in5) );
ru: Экспонента по формуле: out=exp (in1_1*in1_2*in1_3*in1_4*in1_5 + (in2_1*in2_2*in2_3*in2_4*in2_5+in3) / (in4_1*in4_2*in4_3*in4_4*in4_5+in5) );

source: Power
ru: Степень

source: Power per formula: out=(in1_1*in1_2*in1_3*in1_4*in1_5)^(in2_1*in2_2*in2_3*in2_4*in2_5 + (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));
ru: Степень по формуле: out=(in1_1*in1_2*in1_3*in1_4*in1_5)^(in2_1*in2_2*in2_3*in2_4*in2_5 + (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));

source: Input 1
ru: Вход 1

source: Condition '<'
ru: Условие '<'

source: Condition '<' per formula: out=if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;
ru: Условие '<' по формуле: out=if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;

source: Condition '>'
ru: Условие '>'

source: Condition '>' per formula: out=if( in1>(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;
ru: Условие '>' по формуле: out=if( in1>(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;

source: Input 5.
ru: Вход 5.

source: Input 6.
ru: Вход 6.

source: Full condition
ru: Полное условие

source: Full condition per formula: out = if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else if( in1>(in4_1*in4_2*in4_3*in4_4) then in5_1*in5_2*in5_3*in5_4; else in6_1*in6_2*in6_3*in6_4;
ru: Полное условие по формуле: out = if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else if( in1>(in4_1*in4_2*in4_3*in4_4) then in5_1*in5_2*in5_3*in5_4; else in6_1*in6_2*in6_3*in6_4;

source: Select
ru: Выбор

source: Selector
ru: Выбор

source: Selector per formula: out = if( sel = 1 ) then in1_1*in1_2*in1_3*in1_4; if( sel = 2 ) then in2_1*in2_2*in2_3*in2_4; if( sel = 3 ) then in3_1*in3_2*in3_3*in3_4; if( sel = 4 ) then in4_1*in4_2*in4_3*in4_4;
ru: Выбор по формуле: out = if( sel = 1 ) then in1_1*in1_2*in1_3*in1_4; if( sel = 2 ) then in2_1*in2_2*in2_3*in2_4; if( sel = 3 ) then in3_1*in3_2*in3_3*in3_4; if( sel = 4 ) then in4_1*in4_2*in4_3*in4_4;

source: Input
ru: Вход

source: Previous
ru: Предыдущий

source: Positive koef
ru: Полож. коеф.

source: Negative koef
ru: Отриц. коеф.

source: Incrementator
ru: Итератор

source: Incrementator per formula: out = if( in > prev ) then prev + (k+)*(in-prev); else prev - (k-)*(prev-in);
ru: Итератор по формуле: out = if( in > prev ) then prev + (k+)*(in-prev); else prev - (k-)*(prev-in);

source: Input 6
ru: Вход 6

source: Divider
ru: Делитель

source: Divider per formula: out = (in1_1*in1_2*in1_3*in1_4*in1_5 + in2_1*in2_2*in2_3*in2_4*in2_5 + in3) / (in4_1*in4_2*in4_3*in4_4*in4_5 + in5_1*in5_2*in5_3*in5_4*in5_5 + in6);
ru: Делитель по формуле: out = (in1_1*in1_2*in1_3*in1_4*in1_5 + in2_1*in2_2*in2_3*in2_4*in2_5 + in3) / (in4_1*in4_2*in4_3*in4_4*in4_5 + in5_1*in5_2*in5_3*in5_4*in5_5 + in6);

source: Variable
ru: Переменная

source: Setpoint
ru: Задание

source: Max scale
ru: Макс. шкалы

source: Min scale
ru: Мин. шкалы

source: Manual input (%)
ru: Ручной ввод (%)

source: Output (%)
ru: Выход (%)

source: Auto mode
ru: Автомат

source: Cascade mode
ru: Каскад

source: Ti (ms)
ru: Ти (мс)

source: Td (ms)
ru: Тд (мс)

source: Td lag (ms)
ru: Т зад. диф. (мс)

source: Out up limit (%)
ru: Верхняя граница выхода (%)

source: Out down limit (%)
ru: Нижняя граница выхода (%)

source: Insensibility (%)
ru: Нечувствительность (%)

source: Follow sp from var on manual
ru: След. задание за переменной в ручном

source: K input 1
ru: Коэф. входа 1

source: K input 2
ru: Коэф. входа 2

source: Input 2
ru: Вход 2

source: K input 3
ru: Коэф. входа 3

source: K input 4
ru: Коэф. входа 4

source: Input 4
ru: Вход 4

source: Calc frequency (Hz)
ru: Частота вычисления (Гц)

source: Integral value
ru: Знач. интеграла

source: Differencial value
ru: Знач. дифференциала

source: Differencial lag
ru: Задержка диференцирования

source: PID regulator
ru: ПИД регулятор

source: Value
ru: Значение

source: Maximum
ru: Максимум

source: Minimum
ru: Минимум

source: Alarm
ru: Сигнал

source: Scale parameter alarm: out = if (val>max || val<min) then true; else false;
ru: Сигнал по шкале параметра: out = if (val>max || val<min) then true; else false;

source: Flow
ru: Расход

source: X positon
ru: X положение

source: Flow calc per formule: f = K1*((K3+K4*x)^K2);
ru: Расчёт расхода по формуле: f = K1*((K3+K4*x)^K2);

source: Sum and mult
ru: Сумма с умножением

source: Sum and mult per formule: out = in1_1*in1_2*(in1_3*in1_4+in1_5) + in2_1*in2_2*(in2_3*in2_4+in2_5) + in3_1*in3_2*(in3_3*in3_4+in3_5) + in4_1*in4_2*(in4_3*in4_4+in4_5);
ru: Сумма с умножением по формуле: out = in1_1*in1_2*(in1_3*in1_4+in1_5) + in2_1*in2_2*(in2_3*in2_4+in2_5) + in3_1*in3_2*(in3_3*in3_4+in3_5) + in4_1*in4_2*(in4_3*in4_4+in4_5);

source: Sum and divide
ru: Сумма с делением

source: Sum and divide per formule: out = in1_1*in1_2*(in1_3+in1_4/in1_5) + in2_1*in2_2*(in2_3+in2_4/in2_5) + in3_1*in3_2*(in3_3+in3_4/in3_5) + in4_1*in4_2*(in4_3+in4_4/in4_5);
ru: Сумма с делением по формуле: out = in1_1*in1_2*(in1_3+in1_4/in1_5) + in2_1*in2_2*(in2_3+in2_4/in2_5) + in3_1*in3_2*(in3_3+in3_4/in3_5) + in4_1*in4_2*(in4_3+in4_4/in4_5);

source: Klag
ru: Кзад

source: Lag
ru: Задержка

source: Lag per formule: y = y - Klag*( y - x );
ru: Задержка по формуле: y = y - Klag*( y - x );
