Repository: alimon/oscada
Catalog: src/moduls/protocol/HTTP/po/*.po
Languages: de

source: HTTP-realisation
de: HTTP-Realisierung

source: Roman Savochenko
de: Roman Savotschenko

source: Allow support HTTP for WWW based UIs.
de: HTTP-Unterstützung für eine WWW basierte Benutzerschnittstelle.

source: ======================= The module <%s:%s> options ======================= ---------- Parameters of the module section <%s> in config file ---------- AuthTime <min> Life time of the authentication, minutes (default 10).
de: ======================= Optionen des Moduls <%s:%s> ============================= ------- Parameter des Abschnitts <%s> in der Konfigurationsdatei--------- AuthTime <min> Lebensdauer der Authentifizierung, Minuten (standard 10).

source: Auth exit from user '%s'.
de: Auth Ausfahrt vom Benutzer '%s'.

source: Auth session for user '%s' expired.
de: AuthSession für den Benutzer '%s' abgelaufen ist.

source: HTTP method '%s' error or don't support.
de: Fehler oder die HTTP-Methode wird nicht unterstützt '%s'.

source: HTTP respond error
de: Fehle der HTTP-Antwort

source: Not full respond.
de: Nicht voll zu reagieren.

source: Protocol
de: Protokoll

source: Life time of the authentication (min)
de: Lebensdauer der Authentifizierung (Min)

source: For address field you can use address templates list, for example "192.168.1.*;192.168.2.*".
de: Für Adressfeld können Sie Adresse Vorlagen Liste, zum Beispiel "192.168.1.*;192.168.2.*".

source: Address
de: Adresse

source: User
de: Benutzername

source: Module help
de: Modul helfen

source: Content: %d: %s
de: Inhalt: %d: %s

source: Auth OK from user '%s'. Host: %s. User agent: %s.
de: Auth OK vom Benutzer '%s'. Host: %s. User-Agent: %s.

source: Going to page: <b>%s</b>
de: Gehen zur Seite: <b>%s</b>

source: Auth wrong from user '%s'. Host: %s. User agent: %s.
de: Auth falsch von Benutzer '%s'. Host: %s. User-Agent: %s.

source: <p style='color: #CF8122;'>Auth is wrong! Retry please.</p>
de: <p style='color: #CF8122;'>Fehler in der Authentifizierung! Versuchen Sie noch einmal.</p>

source: Find no one WWW subtype module!
de: Keine Modul mit dem Subtyp WWW gefunden!

source: Auto auth from user '%s'. Host: %s. User agent: %s.
de: Auto auth von Benutzer '%s'. Host: %s. User-Agent: %s.

source: HTML-template '%s' load error: %s
de: HTML-Template '%s' Last error: %s

source: Login
de: Einloggen

source: Welcome to the Web-interfaces of OpenSCADA system.
de: Willkommen in die Web-Schnittstellen des Systems OpenSCADA.

source: You are logged in as "<b>%s</b>".
de: Sie sind eingeloggt als "<b>%s</b>".

source: Select the necessary Web-module from the list below, press <a href='/logout'>here</a> to logout or <a href='/login'>here</a> to login as another user.
de: Wählen Sie den Web-Modul aus der Liste unten oder betätigen Sie <a href='/logout'>hier</a> zum Ausloggen oder <a href='/login'>hier</a> zum einloggen als anderer Benutzer.

source: You are not logged in the system!
de: Sie sind nicht eingeloggt!

source: To use some modules you must be logged in. To login now click <a href='/login'>here</a>.
de: Zum Bedienen einiger Module müssen Sie sich einloggen. Zum Einloggen drücken Sie<a href='/login'>hier</a>.

source: You can auto-login from user "<b>%s</b>" by simple selecting the module.
de: Sie können Auto-Login aus user "<b>%s</b>" einfachen Modul wählen.

source: Accessible web modules
de: Verfügbare Web Module

source: Login to system
de: Einloggen in das System

source: User name
de: Benutzername

source: Password
de: Kennwort

source: Clean
de: Bereinigen
