Repository: alimon/oscada
Catalog: src/moduls/ui/QTCfg/po/*.po
Languages: de, uk

source: Name
uk: Ім'я

source: Type
de: Typ
uk: Тип

source: Path
de: Pfad
uk: Шлях

source: The main navigation tree of the configurator.
de: Hauptbaumansicht der Systemeinstellungen
uk: Основне дерево навігації конфігуратора.

source: The main configurator frame.
de: Hauptfeld der Systemeinstellungen.
uk: Основне поле конфігуратора.

source: Tabulated configuration pages.
de: Konfigurationsseiten in Tabellenform.
uk: Табульовані конфігураційні сторінки.

source: &Close
de: &Schliessen
uk: &Закрити

source: Close configurator window
de: Fenster der Systemeinstellungen schliessen
uk: Закрити вікно конфігуратора

source: The button for closing OpenSCADA configurator window
de: Schaltfläche zum Schliessen der Systemeinstellungen von OpenSCADA
uk: Кнопка для закриття вікна конфігуратора OpenSCADA.

source: Press to close OpenSCADA configurator window
de: Betätigen um Systemeinstellungen von OpenSCADA zu schliessen
uk: Натиснути для закриття вікна конфігуратора OpenSCADA.

source: &Quit
de: &Beenden
uk: &Вихід

source: Quit OpenSCADA
de: OpenSCADA beenden
uk: Закрити OpenSCADA

source: The button for full quit from OpenSCADA
de: Schaltfläche zum Beenden von OpenSCADA
uk: Кнопка для повного виходу з OpenSCADA

source: Press for full quit from OpenSCADA
de: Betätigen um OpenSCADA zu beenden
uk: Натиснути для повного виходу з OpenSCADA

source: &Up
de: &Nach oben
uk: &Вверх

source: Up page
de: Eine Stufe nach oben
uk: На сторінку вверх

source: The button for going to level up
de: Schaltfläche für eine Stufe nach oben
uk: Кнопка для переходу на рівень вгору

source: Press for going to level up
de: Betätigen für eine Stufe nach oben
uk: Натиснути для переходу на рівень вгору

source: &Previous
de: &Eine Seite zurück
uk: &Попередня

source: Previous page
de: Vorhergehende Seite
uk: Попередня сторінка

source: The button for going to previous page
de: Schaltfläche für die vorhergehende Seite
uk: Кнопка для переходу на попередню сторінку

source: Press for going to previous page
de: Betätigen um zur vorhergehenden Seite zu kommen
uk: Натиснути для переходу на попередню сторінку

source: &Next
de: &Nächste Seite
uk: &Наступна

source: Next page
de: Nächste Seite
uk: Наступна сторінка

source: The button for going to next page
de: Schaltfläche für die nächste Seite
uk: Кнопка для переходу на наступну сторінку

source: Press for going to next page
de: Betätigen um zur nächsten Seite zu kommen
uk: Натиснути для переходу на наступну сторінку

source: Load from DB
de: Datenbank laden
uk: Завантажити з БД

source: Load item data from DB
de: Elemente aus der Datenbank laden
uk: Завантажити дані елементу з БД

source: The button for loading item data from DB
de: Schaltfläche für das Laden der Elemente aus der Datenbank
uk: Кнопка для завантаження даних елементу з БД

source: Press for loading item data from DB.
de: Betätigen um die Elemente aus der Datenbank zu laden.
uk: Натиснути для завантаження даних елементу з БД.

source: Save to DB
de: Datenbank speichern
uk: Зберегти у БД

source: Save item data to DB
de: Elemente in die Datenbank speichern
uk: Зберегти дані елементу у БД

source: The button for saving item data to DB
de: Schaltfläche für das Speichern der Elemente in die Datenbank
uk: Кнопка для збереження даних елементу у БД

source: Press for saving item data to DB.
de: Betätigen um die Elemente in die Datenbank zu speichern.
uk: Натиснути для збереження даних елементу у БД.

source: &Add
de: &Hinzufügen
uk: &Додати

source: Add item
de: Element hinzufügen
uk: Додати елемент

source: The button for adding new item
de: Schaltfläche für das Hinzufügen des neuen Elements
uk: Кнопка для додання елементу

source: Press for adding new item.
de: Betätigen um das neue Element hinzuzufügen
uk: Натиснути для додання елементу.

source: &Delete
de: &Löschen
uk: &Видалити

source: Delete item
de: Element löschen
uk: Видалити елемент

source: The button for deleting item
de: Schaltfläche für das Löschen des Elements
uk: Кнопка для видалення елементу

source: Press for deleting item.
de: Betätigen um das Element zu löschen
uk: Натиснути для видалення елементу.

source: Item cut
de: Element ausschneiden
uk: Вирізати елемент

source: Cutting of the item
de: Ausschneiden des Elements
uk: Вирізання елементу

source: The button for cutting of the item
de: Schaltfläche zum Ausschneiden des Elements
uk: Кнопка для вирізання елементу

source: Press to cut the item.
de: Betätigen um das Element auszuschneiden
uk: Натиснути для виконання вирізання елементу.

source: Item copy
de: Element kopieren
uk: Копіювати елемент

source: Copying of the item
de: Kopieren des Elements
uk: Копіювання елементу

source: The button for copying of the item
de: Schaltfläche zum Kopieren des Elements
uk: Кнопка для копіювання елементу

source: Press to copy the item.
de: Betätigen um das Element zu kopieren.
uk: Натиснути для виконання копіювання елементу.

source: Item paste
de: Element einfügen
uk: Вставити елемент

source: Pasting of the item
de: Einfügen des Elements
uk: Вставлення елементу

source: The button for pasting of the item
de: Schaltfläche zum Einfügen des Elements
uk: Кнопка для вставки елементу

source: Press to paste the item.
de: Betätigen um das Element einzufügen
uk: Натиснути для вставки елементу.

source: &Refresh
de: &Aktualisieren
uk: П&оновити

source: Refresh current page
de: Seite aktualisieren
uk: Поновити поточну сторінку

source: The button for refreshing of the content of the current page.
de: Schaltfläche zum Aktualisieren des Inhaltes der aktuellen Seite.
uk: Кнопка для поновлення вмісту поточної сторінки.

source: Press for refreshing of the content of the current page.
de: Betätigen um den Inhalt der laufenden Seite zu aktualisieren.
uk: Натиснути для поновлення вмісту поточної сторінки.

source: &Start
de: &Starten
uk: За&пустити

source: Start cycled refresh
de: Periodische Aktualisierung starten
uk: Запустити періодичне поновлення

source: The button for starting of the cycled refresh of the content of the current page.
de: Schaltfläche zum Starten der periodischen Aktualisierung der laufendenSeite
uk: Кнопка для запуску періодичного поновлення вмісту поточної сторінки.

source: Press to start the cycled refresh of the content of the current page.
de: Betätigen um die periodische Aktualisierung der laufenden Seite zu starten
uk: Натиснути для запуску періодичного поновлення вмісту поточної сторінки.

source: &Stop
de: &Anhalten
uk: &Зупинити

source: Stop cycled refresh
de: Periodische Aktualisierung anhalten
uk: Зупинити періодичне поновлення

source: The button for stopping of the cycled refresh of the content of the current page.
de: Schaltfläche zum Anhalten der periodischen Aktualisierung der laufenden Seite.
uk: Кнопка для зупинки періодичного поновлення вмісту поточної сторінки.

source: Press to stop the cycled refresh of the content of the current page.
de: Betätigen um die periodische Aktualisierung der laufenden Seite anzuhalten
uk: Натиснути для зупинки періодичного поновлення вмісту поточної сторінки.

source: &About
de: &Über
uk: &Про ...

source: Program and OpenSCADA information
de: Programm und OpenSCADA Information
uk: Інформація про програму та OpenSCADA

source: The button for display program and OpenSCADA information
de: Schaltfläche für Informationen über Programm und OpenSCADA
uk: Кнопка для відображення інформації про програму та OpenSCADA

source: Press to display program and OpenSCADA information
de: Betätigen um Informationen über Programm und OpenSCADA zu erhalten
uk: Натиснути для відображення інформації про програму та OpenSCADA

source: About &Qt
de: Über &Qt
uk: Про &Qt

source: Qt information
uk: Qt інформація

source: The button for getting the using Qt information
de: Schaltfläche für Informationen über Qt
uk: Кнопка для отримання інформації про використання Qt

source: Press to get the using Qt information.
de: Betätigen um Informationen über Qt zu erhalten.
uk: Натиснути для отримання інформації про використання Qt.

source: %1 manual
de: %1 Handbuch
uk: %1 підручник

source: The button for getting the using %1 manual
de: Schaltfläche für %1 Handbuch
uk: Кнопка для отримання підручника %1

source: Press to get the using %1 manual.
de: Betätigen um %1 Handbuch.
uk: Натиснути для отримання підручника %1.

source: The page manual
de: Die Seiten-Handbuch
uk: Підручник сторінки

source: Selected page manual
de: Ausgewählte Seiten-Handbuch
uk: Підручник обраної сторінки

source: The button for getting the using selected page manual.
de: Die Schaltfläche für das Erhalten der ausgewählten Seite mit Anleitung.
uk: Кнопка для отримання підручника обраної сторінки.

source: Press to get the using selected page manual.
de: Klicken um das Verwendung ausgewählter Seiten-Handbuch zu bekommen.
uk: Натиснути для отримання обраної сторінки.

source: What's &This
de: Was ist &das
uk: Що &це

source: Question about GUI elements
de: Hilfe über die Elemente der Benutzerschnittstelle
uk: Питання про GUI елементи

source: The button for requesting the information about user interface elements
de: Schaltfläche für Informationen über die Benutzerschnittstelle
uk: Кнопка для запиту інформації про елементи інтерфейсу користувача

source: Press for requesting about user interface elements
de: Betätigen um Informationen über die Benutzerschnittstelle zu erhalten
uk: Натисніть для запиту інформації про елементи інтерфейсу користувача

source: &File
de: &Datei
uk: &Файл

source: &Edit
de: &Bearbeiten
uk: Редагування

source: &View
de: &Ansicht
uk: &Вигляд

source: &Help
de: &Hilfe
uk: &Допомога

source: OpenSCADA toolbar
uk: Панель інструментів OpenSCADA

source: This label displays current user.
de: Dieses Feld zeigt den aktuellen Benutzer an
uk: Ця мітка відображає поточного користувача.

source: Field for display of the current user.
de: Das Feld für die Anzeige des aktuellen Benutzers
uk: Поле для відображення поточного користувача.

source: Double click to change user.
de: Zweimal betätigen um den Benutzers zu wechseln.
uk: Подвійно клацніть для зміни користувача.

source: This label displays the local station modifying.
de: Dieses Feld zeigt den bearbeitenden lokalen Bedienrechner an
uk: Ця мітка відображає факт внесення змін у локальну станцію.

source: Field for display of the local station modifying.
de: Das Feld für die Anzeige des bearbeitenden lokalen Bedienrechners
uk: Поле для відображення факту внесення змін у локальну станцію.

source: This button for call status bar history.
de: Diese Schaltfläche ist für den Aufruf der Geschichte der Zeile des Statuts
uk: Ця кнопка для виклику історії строки статусу.

source: Button for call status bar history.
de: Schaltfläche für den Aufruf der Geschichte der Zeile des Statuts
uk: Кнопка для виклику історії строки статусу.

source: Ready
de: Fertig
uk: Готовий

source: Changes save
de: Speichern der Änderungen
uk: Збереження змін

source: Some changes made. Save the changes to DB on exit?
de: Einige Änderungen vorgenommen. Speichern Sie die Änderungen an der Ausfahrt DB?
uk: Деякі зміни було зроблено. Зберегти зміни у БД перед виходом?

source: No one editable container is present.
de: Kein veränderbarer Container ist vorhanden.
uk: Жодного редагованого контейнеру не присутньо.

source: Add item to node: '%1'.
de: Element hinzufügen in den Knoten: '%1'.
uk: Додання елементу у вузол: '%1'.

source: Add node
de: Knoten hinzufügen
uk: Додання елементу

source: Node '%1' is already present.
de: Der Knoten '%1' ist schon vorhanden.
uk: Вузол '%1' вже присутній.

source: Are you sure of deleting nodes: '%1'?
de: Wollen Sie wirklich den Knoten: '%1' löschen?
uk: Ви дійсно бажаєте видалити елементи: '%1'?

source: Delete node
de: Knoten löschen
uk: Видалення елементу

source: Copy is impossible.
de: Kopieren ist nicht möglich.
uk: Копіювання неможливе.

source: Selected
de: Gewählt
uk: Вибраний

source: Move or copy node
de: Verschieben oder Kopieren des Knotens
uk: Переміщення або копіювання вузлу

source: Move node '%1' to '%2'.
de: Verschieben des Knotens '%1' nach '%2'.
uk: Переміщення вузлу '%1' у '%2'.

source: Copy node '%1' to '%2'.
de: Kopieren des Knotens '%1' nach '%2'.
uk: Скопіювати вузол '%1' до '%2'.

source: Do not the question anymore.
de: Mehr nicht fragen.
uk: Не запитувати більш.

source: Node '%1' is already present. Continue?
de: Der Knoten '%1' ist schon vorhanden. Weiter?
uk: Вузол '%1' вже присутній. Продовжити?

source: Status bar messages list:
de: Statusleiste Nachrichten-Liste:
uk: Перелік повідомлень строки статусу:

source: Status messages
de: Statusmeldungen
uk: Повідомлення статусу

source: %s v%s. %s Author: %s License: %s %s v%s. %s License: %s Author: %s Web site: %s
de: %s v%s. %s Autor: %s Lizenz: %s %s v%s. %s Lizenz: %s Autor: %s Web Seite: %s
uk: %s v%s. %s Автор: %s Ліцензія: %s %s v%s. %s Ліцензія: %s Автор: %s Web сайт: %s

source: Manual
de: Handbuch
uk: Підручник

source: No the manual '%1' found offline or online!
de: Nein das Handbuch '%1' gefunden, offline oder online!
uk: Не знайдено підручника '%1' локально та у мережі!

source: On
uk: Вкл

source: Off
uk: Викл

source: Changes apply
de: Änderungen gelten
uk: Прийняття змін

source: Some changes you don't apply! Apply now or lost the?
de: Einige Änderungen nicht gelten! Bewerben Sie sich jetzt oder verloren das?
uk: Деякі зміни не прийнято! Прийняти зараз або втратити?

source: Refresh items tree
de: Elementenbaum aktualisieren
uk: Оновити елементи дерева

source: Expand/update branch '%s' time %f ms.
de: Zeit der Erweiterung/Aktualisierung des Zweiges '%s' %f msek.
uk: Час розширення/поновлення гілки '%s' %f мс.

source: Send changes to selections
de: Senden Sie Änderungen an Selektionen
uk: Надсилання змін до обраних

source: Send current command '%s' to other selected nodes "%s"?
uk: Надіслати поточну команду '%s' до інших обраних вузлів "%s"?

source: Local station
de: Lokaler Bedienrechner
uk: Локальна станція

source: Remote station
de: Entfernter Bedienrechner
uk: Віддалена станція

source: %s| Set '%s' to '%s'!
de: %s| Installieren '%s' in '%s'!
uk: %s| Встановлено '%s' у '%s'!

source: %s| Go to link '%s'!
de: %s| Geh zum Link '%s'!
uk: %s| Перехід за посиланням '%s'!

source: %s| Press '%s'!
de: %s| Betätigen '%s'!
uk: %s| Натиснуто '%s'!

source: Value no valid:
de: Der Wert ist ungültig:
uk: Значення помилкове:

source: %s| Change '%s' from '%s' to '%s'!
de: %s| Ändern '%s' aus '%s' in '%s'!
uk: %s| Змінено '%s' з '%s' у '%s'!

source: Go
de: Ändern
uk: Перейти

source: Add
de: Hinzufügen
uk: Додати

source: Insert
de: Einfügen
uk: Вставити

source: Edit
de: Ändern
uk: Редагувати

source: Delete
de: Löschen
uk: Видалити

source: Up
de: Nach oben
uk: Вверх

source: Down
de: Nach unten
uk: Донизу

source: Item name set
de: Installieren des Elementsnamen
uk: Встановлення назви елементу

source: Add new element.
de: Ein neues Element hinzufügen s.
uk: Додання нового елементу.

source: Insert new element.
de: Ein neues Element einfügen.
uk: Вставлення нового елементу.

source: Rename element.
de: Umbenennen des Elements.
uk: Перейменування елементу.

source: %s| Add '%s' element <%s:%s>!
de: %s| Hinzufügen '%s' Element <%s:%s>!
uk: %s| Додано '%s' елемент <%s:%s>!

source: %s| Insert '%s' element <%s:%s> to %d!
de: %s| Einfügen '%s' des Elements <%s:%s> in %d!
uk: %s| Вставлено '%s' елемент <%s:%s> до %d!

source: %s| Set '%s' element %d to <%s:%s>!
de: %s| Installieren '%s' des Element %d in <%s:%s>!
uk: %s| Встановлено '%s' елемент %d у <%s:%s>!

source: %s| Delete '%s' element <%s:%s>!
de: %s| Löschen '%s' des Elements <%s:%s>!
uk: %s| Видалення '%s' елементу <%s:%s>!

source: %s| Move '%s' from %d to %d!
de: %s| Verschieben '%s' von %d nach %d!
uk: %s| Пересування '%s' з %d до %d!

source: Add record
de: Datensatz hinzufügen
uk: Додати запис

source: Insert record
de: Datensatz einfügen
uk: Вставити запис

source: Delete record
de: Datensatz löschen
uk: Видалити запис

source: Move Up
de: Nach oben verschieben
uk: Пересунути вгору

source: Move Down
de: Nach unten verschieben
uk: Пересунути донизу

source: Copy
de: Kopieren
uk: Копіювати

source: %s| Add '%s' record.
de: %s| Hinzufügen '%s' Datensatz.
uk: %s| Додано '%s' запис.

source: %s| Insert '%s' record %d.
de: %s| Einfügen '%s' des Datensatzes %d.
uk: %s| Вставлення '%s' запису %d.

source: %s| Delete '%s' record '%s'.
de: %s| Löschen '%s' des Datensatzes '%s'.
uk: %s| Видалення '%s' запису '%s'.

source: %s| Move '%s' record from %d to %d.
de: %s| Verschieben '%s' des Datensatzes aus %d in %d.
uk: %s| Пересування '%s' запису з %d до %d.

source: Save image
de: Abbildung speichern
uk: Зберегти зображення

source: Load image
de: Abbildung laden
uk: Завантажити зображення

source: Save picture
de: Das Bild speichern
uk: Збереження картинки

source: Images (*.png *.xpm *.jpg)
de: Abbildungen (*.png *.xpm *.jpg)
uk: Зображення (*.png *.xpm *.jpg)

source: Save to file %s error
de: Fehler beim Speichern in die Datei %s
uk: Помилка збереження до файлу %s

source: Load picture
de: Bild laden
uk: Завантаження картинки

source: Images (*.png *.jpg)
de: Abbildungen (*.png *.jpg)
uk: Зображення (*.png *.jpg)

source: Open file %s error
de: Fehler beim Öffnen der Datei %s
uk: Помилка відкриття файлу %s

source: Image file %s error
de: Fehler in der Bilddatei %s
uk: Помилковий файл зображення %s

source: %s| Upload picture '%s' to: %s.
de: %s| Speichern des Bildes '%s' nach %s.
uk: %s| Завантаження картинки '%s' до: %s.

source: Value '%s' is not valid!
de: Wert '%s' ist ungültig
uk: Значення '%s' помилкове!

source: %s| Set '%s' cell ('%s':%s) to: %s.
de: %s| Installieren '%s' der Zelle ('%s':%s) in %s.
uk: %s| Встановлено '%s' чарунку ('%s':%s) у: %s.

source: Selective element '%s' is not present!
de: Ausgewähltes Element '%s' fehlt!
uk: Вибірковий елемент '%s' відсутній!

source: %s| Change '%s' to: '%s'!
de: %s| Ändern '%s' in: '%s'!
uk: %s| Змінено '%s' у: '%s'!

source: Picture is not set!
de: Es ist kein Bild hinterlegt!
uk: Картинку не встановлено!

source: Find
de: Suche
uk: Пошук

source: Find next
de: Weitersuchen
uk: Пошук наступного

source: Apply
de: Übernehmen
uk: Прийняти

source: Cancel
de: Abbrechen
uk: Скасувати

source: Cursor = (%1:%2)
uk: Курсор = (%1:%2)

source: Enter text string for search:
de: Geben Sie den Text-String für Suche:
uk: Введіть строку тексту для пошуку:

source: String search
de: String-Suche
uk: Пошук строки

source: Backward
de: Rückwärts
uk: Зворотній

source: Case sensitively
de: Case sensibel
uk: Чутливий до регістру

source: Whole words
de: Ganze Wörter
uk: Слово цілком

source: Name:
uk: Ім'я:

source: Item type:
de: Typ des Elements:
uk: Тип елементу:

source: Select user
de: Benutzer auswählen
uk: Вибір користувача

source: User:
de: Benutzer:
uk: Користувач:

source: Password:
de: Kennwort:
uk: Пароль:

source: Auth is wrong!!!
de: Falsches Kennwort
uk: Помилка аутентифікації!!!

source: System configurator (Qt)
de: Systemeinstellung (Qt)
uk: Системний конфігуратор (Qt)

source: Roman Savochenko
de: Roman Savotschenko
uk: Роман Савоченко

source: Allow the Qt based OpenSCADA system configurator.
de: Ermöglicht die Qt-basierte Systemeinstellung von OpenSCADA.
uk: Надає базований на Qt конфігуратор системи OpenSCADA.

source: ======================= The module <%s:%s> options ======================= ---------- Parameters of the module section '%s' in config-file ---------- StartPath <path> Configurator start path. StartUser <user> No password requested start user.
de: ======================= Optionen des Moduls <%s:%s> ======================== ------ Parameter des Abschnitts '%s' in der Konfigurationsdatei -- StartPath <path> Verzeichnispfad der Systemeinstellungen. StartUser <user> Start, ohne Kennwort, Benutzer.
uk: ======================= Опції модуля <%s:%s> ============================= ------- Параметри модульної секції '%s' у конфігураційному файлі --------- StartPath <шлях> Стартовий шлях конфігуратору. StartUser <корист> Стартовий користувач, без паролю.

source: Load module.
de: Modul laden.
uk: Завантаження модуля.

source: Save module.
de: Modul speichern.
uk: Збереження модуля.

source: Start module.
de: Starten des Moduls.
uk: Запуск модуля.

source: Stop module.
de: Anhalten des Moduls.
uk: Зупинка модуля.

source: Module options
de: Optionen des Moduls
uk: Параметри модуля

source: Configurator start path
de: Verzeichnispfad der Systemeinstellungen
uk: Початковий шлях конфігуратору

source: Configurator start user
de: Benutzer für die Systemeinstellungen
uk: Початковий користувач конфігуратору

source: Go to remote stations list configuration
de: Konfiguration der entfernten Stationen
uk: Перейти до конфігурації переліку віддалених станцій

source: QTCfg dialog
uk: QTCfg діалог

source: Node id and/or name select
de: Auswahl des Bezeichners und/oder des Namens
uk: Вибір ідентифікатора та/або ім'я вузлу

source: Send current change to other selected nodes "%s"?
de: Senden Stromänderung zu anderen ausgewählten Knoten "%s"?

source: Options help
de: Optionen Hilfe
